#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioModulation

#include "Basic.hpp"

#include "AudioModulation_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "Engine_classes.hpp"
#include "AudioExtensions_classes.hpp"


namespace SDK
{

// Class AudioModulation.SoundModulationGenerator
// 0x0000 (0x0028 - 0x0028)
class USoundModulationGenerator : public USoundModulatorBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundModulationGenerator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundModulationGenerator")
	}
	static class USoundModulationGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundModulationGenerator>();
	}
};
DUMPER7_ASSERTS_USoundModulationGenerator;

// Class AudioModulation.SoundModulationGeneratorEnvelopeFollower
// 0x0020 (0x0048 - 0x0028)
class USoundModulationGeneratorEnvelopeFollower final : public USoundModulationGenerator
{
public:
	struct FEnvelopeFollowerGeneratorParams       Params_0;                                          // 0x0028(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundModulationGeneratorEnvelopeFollower")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundModulationGeneratorEnvelopeFollower")
	}
	static class USoundModulationGeneratorEnvelopeFollower* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundModulationGeneratorEnvelopeFollower>();
	}
};
DUMPER7_ASSERTS_USoundModulationGeneratorEnvelopeFollower;

// Class AudioModulation.AudioModulationSettings
// 0x0010 (0x0048 - 0x0038)
class UAudioModulationSettings final : public UDeveloperSettings
{
public:
	TArray<struct FSoftObjectPath>                Parameters;                                        // 0x0038(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioModulationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioModulationSettings")
	}
	static class UAudioModulationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioModulationSettings>();
	}
};
DUMPER7_ASSERTS_UAudioModulationSettings;

// Class AudioModulation.SoundModulationGeneratorLFO
// 0x0018 (0x0040 - 0x0028)
class USoundModulationGeneratorLFO final : public USoundModulationGenerator
{
public:
	struct FSoundModulationLFOParams              Params_0;                                          // 0x0028(0x0014)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundModulationGeneratorLFO")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundModulationGeneratorLFO")
	}
	static class USoundModulationGeneratorLFO* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundModulationGeneratorLFO>();
	}
};
DUMPER7_ASSERTS_USoundModulationGeneratorLFO;

// Class AudioModulation.AudioModulationStatics
// 0x0000 (0x0028 - 0x0028)
class UAudioModulationStatics final : public UBlueprintFunctionLibrary
{
public:
	static void ActivateBus(const class UObject* WorldContextObject, class USoundControlBus* Bus);
	static void ActivateBusMix(const class UObject* WorldContextObject, class USoundControlBusMix* Mix);
	static void ActivateGenerator(const class UObject* WorldContextObject, class USoundModulationGenerator* Generator);
	static class USoundControlBus* CreateBus(const class UObject* WorldContextObject, class FName Name_0, class USoundModulationParameter* Parameter, bool Activate);
	static class USoundControlBusMix* CreateBusMix(const class UObject* WorldContextObject, class FName Name_0, const TArray<struct FSoundControlBusMixStage>& Stages, bool Activate);
	static struct FSoundControlBusMixStage CreateBusMixStage(const class UObject* WorldContextObject, class USoundControlBus* Bus, float Value, float AttackTime, float ReleaseTime);
	static void DeactivateBus(const class UObject* WorldContextObject, class USoundControlBus* Bus);
	static void DeactivateBusMix(const class UObject* WorldContextObject, class USoundControlBusMix* Mix);
	static void DeactivateGenerator(const class UObject* WorldContextObject, class USoundModulationGenerator* Generator);
	static TArray<struct FSoundControlBusMixStage> LoadMixFromProfile(const class UObject* WorldContextObject, class USoundControlBusMix* Mix, bool bActivate, int32 ProfileIndex);
	static void SaveMixToProfile(const class UObject* WorldContextObject, class USoundControlBusMix* Mix, int32 ProfileIndex);
	static void UpdateMix(const class UObject* WorldContextObject, class USoundControlBusMix* Mix, const TArray<struct FSoundControlBusMixStage>& Stages, float FadeTime);
	static void UpdateMixByFilter(const class UObject* WorldContextObject, class USoundControlBusMix* Mix, const class FString& AddressFilter, TSubclassOf<class USoundModulationParameter> ParamClassFilter, class USoundModulationParameter* ParamFilter, float Value, float FadeTime);
	static void UpdateMixFromObject(const class UObject* WorldContextObject, class USoundControlBusMix* Mix, float FadeTime);
	static void UpdateModulator(const class UObject* WorldContextObject, class USoundModulatorBase* Modulator);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioModulationStatics")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioModulationStatics")
	}
	static class UAudioModulationStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioModulationStatics>();
	}
};
DUMPER7_ASSERTS_UAudioModulationStatics;

// Class AudioModulation.AudioModulationStyle
// 0x0000 (0x0028 - 0x0028)
class UAudioModulationStyle final : public UBlueprintFunctionLibrary
{
public:
	static const struct FColor GetControlBusColor();
	static const struct FColor GetControlBusMixColor();
	static const struct FColor GetModulationGeneratorColor();
	static const struct FColor GetParameterColor();
	static const struct FColor GetPatchColor();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioModulationStyle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioModulationStyle")
	}
	static class UAudioModulationStyle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioModulationStyle>();
	}
};
DUMPER7_ASSERTS_UAudioModulationStyle;

// Class AudioModulation.SoundControlBus
// 0x0030 (0x0058 - 0x0028)
class USoundControlBus final : public USoundModulatorBase
{
public:
	bool                                          bBypass;                                           // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Address;                                           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USoundModulationGenerator*>      Generators;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class USoundModulationParameter*              Parameter;                                         // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundControlBus")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundControlBus")
	}
	static class USoundControlBus* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundControlBus>();
	}
};
DUMPER7_ASSERTS_USoundControlBus;

// Class AudioModulation.SoundControlBusMix
// 0x0018 (0x0040 - 0x0028)
class USoundControlBusMix final : public UObject
{
public:
	uint32                                        ProfileIndex;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoundControlBusMixStage>       MixStages;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	void ActivateMix();
	void DeactivateAllMixes();
	void DeactivateMix();
	void LoadMixFromProfile();
	void SaveMixToProfile();
	void SoloMix();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundControlBusMix")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundControlBusMix")
	}
	static class USoundControlBusMix* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundControlBusMix>();
	}
};
DUMPER7_ASSERTS_USoundControlBusMix;

// Class AudioModulation.SoundModulationParameter
// 0x0008 (0x0030 - 0x0028)
class USoundModulationParameter : public UObject
{
public:
	struct FSoundModulationParameterSettings      settings;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundModulationParameter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundModulationParameter")
	}
	static class USoundModulationParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundModulationParameter>();
	}
};
DUMPER7_ASSERTS_USoundModulationParameter;

// Class AudioModulation.SoundModulationParameterScaled
// 0x0008 (0x0038 - 0x0030)
class USoundModulationParameterScaled final : public USoundModulationParameter
{
public:
	float                                         UnitMin;                                           // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnitMax;                                           // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundModulationParameterScaled")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundModulationParameterScaled")
	}
	static class USoundModulationParameterScaled* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundModulationParameterScaled>();
	}
};
DUMPER7_ASSERTS_USoundModulationParameterScaled;

// Class AudioModulation.SoundModulationParameterFrequencyBase
// 0x0000 (0x0030 - 0x0030)
class USoundModulationParameterFrequencyBase : public USoundModulationParameter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundModulationParameterFrequencyBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundModulationParameterFrequencyBase")
	}
	static class USoundModulationParameterFrequencyBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundModulationParameterFrequencyBase>();
	}
};
DUMPER7_ASSERTS_USoundModulationParameterFrequencyBase;

// Class AudioModulation.SoundModulationParameterFrequency
// 0x0008 (0x0038 - 0x0030)
class USoundModulationParameterFrequency final : public USoundModulationParameterFrequencyBase
{
public:
	float                                         UnitMin;                                           // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnitMax;                                           // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundModulationParameterFrequency")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundModulationParameterFrequency")
	}
	static class USoundModulationParameterFrequency* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundModulationParameterFrequency>();
	}
};
DUMPER7_ASSERTS_USoundModulationParameterFrequency;

// Class AudioModulation.SoundModulationParameterFilterFrequency
// 0x0000 (0x0030 - 0x0030)
class USoundModulationParameterFilterFrequency : public USoundModulationParameterFrequencyBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundModulationParameterFilterFrequency")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundModulationParameterFilterFrequency")
	}
	static class USoundModulationParameterFilterFrequency* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundModulationParameterFilterFrequency>();
	}
};
DUMPER7_ASSERTS_USoundModulationParameterFilterFrequency;

// Class AudioModulation.SoundModulationParameterLPFFrequency
// 0x0000 (0x0030 - 0x0030)
class USoundModulationParameterLPFFrequency final : public USoundModulationParameterFilterFrequency
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundModulationParameterLPFFrequency")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundModulationParameterLPFFrequency")
	}
	static class USoundModulationParameterLPFFrequency* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundModulationParameterLPFFrequency>();
	}
};
DUMPER7_ASSERTS_USoundModulationParameterLPFFrequency;

// Class AudioModulation.SoundModulationParameterHPFFrequency
// 0x0000 (0x0030 - 0x0030)
class USoundModulationParameterHPFFrequency final : public USoundModulationParameterFilterFrequency
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundModulationParameterHPFFrequency")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundModulationParameterHPFFrequency")
	}
	static class USoundModulationParameterHPFFrequency* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundModulationParameterHPFFrequency>();
	}
};
DUMPER7_ASSERTS_USoundModulationParameterHPFFrequency;

// Class AudioModulation.SoundModulationParameterBipolar
// 0x0008 (0x0038 - 0x0030)
class USoundModulationParameterBipolar final : public USoundModulationParameter
{
public:
	float                                         UnitRange;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundModulationParameterBipolar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundModulationParameterBipolar")
	}
	static class USoundModulationParameterBipolar* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundModulationParameterBipolar>();
	}
};
DUMPER7_ASSERTS_USoundModulationParameterBipolar;

// Class AudioModulation.SoundModulationParameterVolume
// 0x0008 (0x0038 - 0x0030)
class USoundModulationParameterVolume final : public USoundModulationParameter
{
public:
	float                                         MinVolume;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundModulationParameterVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundModulationParameterVolume")
	}
	static class USoundModulationParameterVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundModulationParameterVolume>();
	}
};
DUMPER7_ASSERTS_USoundModulationParameterVolume;

// Class AudioModulation.SoundModulationPatch
// 0x0020 (0x0048 - 0x0028)
class USoundModulationPatch final : public USoundModulatorBase
{
public:
	struct FSoundControlModulationPatch           PatchSettings;                                     // 0x0028(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SoundModulationPatch")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundModulationPatch")
	}
	static class USoundModulationPatch* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundModulationPatch>();
	}
};
DUMPER7_ASSERTS_USoundModulationPatch;

}

