#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LightCharacter_Bot

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LightCharacter_Bot.BP_LightCharacter_Bot_C.ExecuteUbergraph_BP_LightCharacter_Bot
// 0x0010 (0x0010 - 0x0000)
struct BP_LightCharacter_Bot_C_ExecuteUbergraph_BP_LightCharacter_Bot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFirstPerson;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_LightCharacter_Bot_C_ExecuteUbergraph_BP_LightCharacter_Bot;

// Function BP_LightCharacter_Bot.BP_LightCharacter_Bot_C.BP_UpdateForClientPerspective
// 0x0001 (0x0001 - 0x0000)
struct BP_LightCharacter_Bot_C_BP_UpdateForClientPerspective final
{
public:
	bool                                          bFirstPerson;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_LightCharacter_Bot_C_BP_UpdateForClientPerspective;

// Function BP_LightCharacter_Bot.BP_LightCharacter_Bot_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LightCharacter_Bot_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_LightCharacter_Bot_C_ReceiveTick;

}

