#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LightCharacter

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LightCharacter.BP_LightCharacter_C.ExecuteUbergraph_BP_LightCharacter
// 0x0014 (0x0014 - 0x0000)
struct BP_LightCharacter_C_ExecuteUbergraph_BP_LightCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFirstPerson;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_LightCharacter_C_ExecuteUbergraph_BP_LightCharacter;

// Function BP_LightCharacter.BP_LightCharacter_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LightCharacter_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_LightCharacter_C_ReceiveTick;

// Function BP_LightCharacter.BP_LightCharacter_C.BP_UpdateForClientPerspective
// 0x0001 (0x0001 - 0x0000)
struct BP_LightCharacter_C_BP_UpdateForClientPerspective final
{
public:
	bool                                          bFirstPerson;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_LightCharacter_C_BP_UpdateForClientPerspective;

}

