#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PersonalCloak

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PersonalCloak.BP_PersonalCloak_C.ExecuteUbergraph_BP_PersonalCloak
// 0x0020 (0x0020 - 0x0000)
struct BP_PersonalCloak_C_ExecuteUbergraph_BP_PersonalCloak final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMACharacter*                           K2Node_Event_ReceivingCharacter;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PersonalCloak_C_ExecuteUbergraph_BP_PersonalCloak;

// Function BP_PersonalCloak.BP_PersonalCloak_C.OnActiveChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_PersonalCloak_C_OnActiveChanged final
{
public:
	class AMACharacter*                           ReceivingCharacter;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_PersonalCloak_C_OnActiveChanged;

}

