#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Reload

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Reload.BP_Reload_C.ExecuteUbergraph_BP_Reload
// 0x0010 (0x0010 - 0x0000)
struct BP_Reload_C_ExecuteUbergraph_BP_Reload final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMACharacter*                           K2Node_Event_ReceivingCharacter;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Reload_C_ExecuteUbergraph_BP_Reload;

// Function BP_Reload.BP_Reload_C.OnActiveChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_Reload_C_OnActiveChanged final
{
public:
	class AMACharacter*                           ReceivingCharacter;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Reload_C_OnActiveChanged;

}

