#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rocks

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Rocks.BP_Rocks_C
// 0x0070 (0x0298 - 0x0228)
class ABP_Rocks_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Rock;                                              // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    Rock_Mesh;                                         // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Rock_Select;                                       // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInstance*>              Grassy_Materials;                                  // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              Snow_Materials;                                    // 0x0260(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstance*>              Desert_Materials;                                  // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Biome_Select;                                      // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Material_Select_Index;                             // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NewVar_0;                                          // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Rocks_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Rocks_C")
	}
	static class ABP_Rocks_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Rocks_C>();
	}
};
DUMPER7_ASSERTS_ABP_Rocks_C;

}

