#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultBurnInOptions

#include "Basic.hpp"

#include "LevelSequence_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DefaultBurnInOptions.DefaultBurnInOptions_C
// 0x0100 (0x0128 - 0x0028)
class UDefaultBurnInOptions_C final : public ULevelSequenceBurnInInitSettings
{
public:
	class FText                                   TopLeftText;                                       // 0x0028(0x0018)(Edit, BlueprintVisible)
	class FText                                   TopCenterText;                                     // 0x0040(0x0018)(Edit, BlueprintVisible)
	class FText                                   TopRightText;                                      // 0x0058(0x0018)(Edit, BlueprintVisible)
	class FText                                   BottomLeftText;                                    // 0x0070(0x0018)(Edit, BlueprintVisible)
	class FText                                   BottomCenterText;                                  // 0x0088(0x0018)(Edit, BlueprintVisible)
	class FText                                   BottomRightText;                                   // 0x00A0(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             Watermark;                                         // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           WatermarkTint;                                     // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         Font;                                              // 0x00D0(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DefaultBurnInOptions_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DefaultBurnInOptions_C")
	}
	static class UDefaultBurnInOptions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultBurnInOptions_C>();
	}
};
DUMPER7_ASSERTS_UDefaultBurnInOptions_C;

}

