#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameSettings

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "GameSettings_structs.hpp"
#include "CommonUI_classes.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class GameSettings.GameResponsivePanel
// 0x0018 (0x0138 - 0x0120)
class UGameResponsivePanel final : public UPanelWidget
{
public:
	bool                                          bCanStackVertically;                               // 0x0120(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x17];                                     // 0x0121(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UGameResponsivePanelSlot* AddChildToGameResponsivePanel(class UWidget* Content);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameResponsivePanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameResponsivePanel")
	}
	static class UGameResponsivePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameResponsivePanel>();
	}
};
DUMPER7_ASSERTS_UGameResponsivePanel;

// Class GameSettings.GameResponsivePanelSlot
// 0x0008 (0x0040 - 0x0038)
class UGameResponsivePanelSlot final : public UPanelSlot
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameResponsivePanelSlot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameResponsivePanelSlot")
	}
	static class UGameResponsivePanelSlot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameResponsivePanelSlot>();
	}
};
DUMPER7_ASSERTS_UGameResponsivePanelSlot;

// Class GameSettings.GameSetting
// 0x0140 (0x0168 - 0x0028)
class UGameSetting : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class ULocalPlayer*                           LocalPlayer;                                       // 0x0070(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameSetting*                           SettingParent;                                     // 0x0078(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameSettingRegistry*                   OwningRegistry;                                    // 0x0080(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_88[0xE0];                                      // 0x0088(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	ESlateVisibility GetDisplayNameVisibility();

	class FText GetDescriptionRichText() const;
	class FName GetDevName() const;
	class FText GetDisplayName() const;
	class FText GetDynamicDetails() const;
	const struct FGameplayTagContainer GetTags() const;
	class FText GetWarningRichText() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSetting")
	}
	static class UGameSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSetting>();
	}
};
DUMPER7_ASSERTS_UGameSetting;

// Class GameSettings.GameSettingAction
// 0x0050 (0x01B8 - 0x0168)
class UGameSettingAction : public UGameSetting
{
public:
	uint8                                         Pad_168[0x50];                                     // 0x0168(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingAction")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingAction")
	}
	static class UGameSettingAction* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingAction>();
	}
};
DUMPER7_ASSERTS_UGameSettingAction;

// Class GameSettings.GameSettingCollection
// 0x0010 (0x0178 - 0x0168)
class UGameSettingCollection : public UGameSetting
{
public:
	TArray<class UGameSetting*>                   settings;                                          // 0x0168(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingCollection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingCollection")
	}
	static class UGameSettingCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingCollection>();
	}
};
DUMPER7_ASSERTS_UGameSettingCollection;

// Class GameSettings.GameSettingCollectionPage
// 0x0030 (0x01A8 - 0x0178)
class UGameSettingCollectionPage final : public UGameSettingCollection
{
public:
	uint8                                         Pad_178[0x30];                                     // 0x0178(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingCollectionPage")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingCollectionPage")
	}
	static class UGameSettingCollectionPage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingCollectionPage>();
	}
};
DUMPER7_ASSERTS_UGameSettingCollectionPage;

// Class GameSettings.GameSettingDetailExtension
// 0x0008 (0x0268 - 0x0260)
class UGameSettingDetailExtension final : public UUserWidget
{
public:
	class UGameSetting*                           Setting;                                           // 0x0260(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnSettingAssigned(class UGameSetting* InSetting);
	void OnSettingValueChanged(class UGameSetting* InSetting);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingDetailExtension")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingDetailExtension")
	}
	static class UGameSettingDetailExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingDetailExtension>();
	}
};
DUMPER7_ASSERTS_UGameSettingDetailExtension;

// Class GameSettings.GameSettingDetailView
// 0x00D0 (0x0330 - 0x0260)
class UGameSettingDetailView : public UUserWidget
{
public:
	class UGameSettingVisualData*                 VisualData;                                        // 0x0260(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FUserWidgetPool                        ExtensionWidgetPool;                               // 0x0268(0x0080)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UGameSetting*                           CurrentSetting;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F0[0x10];                                     // 0x02F0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonTextBlock*                       Text_SettingName;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_Description;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_DynamicDetails;                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_WarningDetails;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonRichTextBlock*                   RichText_DisabledDetails;                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerticalBox*                           Box_DetailsExtension;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingDetailView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingDetailView")
	}
	static class UGameSettingDetailView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingDetailView>();
	}
};
DUMPER7_ASSERTS_UGameSettingDetailView;

// Class GameSettings.GameSettingListEntryBase
// 0x0038 (0x02C0 - 0x0288)
class UGameSettingListEntryBase : public UCommonUserWidget
{
public:
	uint8                                         Pad_288[0x10];                                     // 0x0288(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSetting*                           Setting;                                           // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A0[0x18];                                     // 0x02A0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Background;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UWidget* GetPrimaryGamepadFocusWidget();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntryBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntryBase")
	}
	static class UGameSettingListEntryBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntryBase>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntryBase;

// Class GameSettings.GameSettingListEntry_Setting
// 0x0008 (0x02C8 - 0x02C0)
class UGameSettingListEntry_Setting : public UGameSettingListEntryBase
{
public:
	class UCommonTextBlock*                       Text_SettingName;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntry_Setting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntry_Setting")
	}
	static class UGameSettingListEntry_Setting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntry_Setting>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntry_Setting;

// Class GameSettings.GameSettingListEntrySetting_Discrete
// 0x0030 (0x02F8 - 0x02C8)
class UGameSettingListEntrySetting_Discrete : public UGameSettingListEntry_Setting
{
public:
	bool                                          bHasActualRotator;                                 // 0x02C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingValueDiscrete*              DiscreteSetting;                                   // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           Panel_Value;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSettingRotator*                    Rotator_SettingValue;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Decrease;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Increase;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_Discrete")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_Discrete")
	}
	static class UGameSettingListEntrySetting_Discrete* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_Discrete>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_Discrete;

// Class GameSettings.GameSettingListEntrySetting_Dropdown
// 0x0020 (0x02E8 - 0x02C8)
class UGameSettingListEntrySetting_Dropdown : public UGameSettingListEntry_Setting
{
public:
	bool                                          bHasActualRotator;                                 // 0x02C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingValueDropdown*              DropdownSetting;                                   // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           Panel_Value;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UComboBoxString*                        Dropdown_Box;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleSelectionChanged(const class FString& SelectedItem, ESelectInfo SelectionType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_Dropdown")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_Dropdown")
	}
	static class UGameSettingListEntrySetting_Dropdown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_Dropdown>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_Dropdown;

// Class GameSettings.GameSettingListEntrySetting_Color
// 0x0030 (0x02F8 - 0x02C8)
class UGameSettingListEntrySetting_Color final : public UGameSettingListEntry_Setting
{
public:
	bool                                          bHasActualRotator;                                 // 0x02C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingValueDiscrete*              DiscreteSetting;                                   // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           Panel_Value;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSettingRotator*                    Rotator_SettingValue;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Decrease;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonButtonBase*                      Button_Increase;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_Color")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_Color")
	}
	static class UGameSettingListEntrySetting_Color* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_Color>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_Color;

// Class GameSettings.GameSettingListEntrySetting_Scalar
// 0x0020 (0x02E8 - 0x02C8)
class UGameSettingListEntrySetting_Scalar : public UGameSettingListEntry_Setting
{
public:
	class UGameSettingValueScalar*                ScalarSetting;                                     // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPanelWidget*                           Panel_Value;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAnalogSlider*                          Slider_SettingValue;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCommonTextBlock*                       Text_SettingValue;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleSliderCaptureEnded();
	void HandleSliderValueChanged(float Value);
	void OnDefaultValueChanged(float DefaultValue);
	void OnValueChanged(float Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_Scalar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_Scalar")
	}
	static class UGameSettingListEntrySetting_Scalar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_Scalar>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_Scalar;

// Class GameSettings.GameSettingValue
// 0x0000 (0x0168 - 0x0168)
class UGameSettingValue : public UGameSetting
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValue")
	}
	static class UGameSettingValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValue>();
	}
};
DUMPER7_ASSERTS_UGameSettingValue;

// Class GameSettings.GameSettingValueDropdown
// 0x0000 (0x0168 - 0x0168)
class UGameSettingValueDropdown : public UGameSettingValue
{
public:
	int32 GetDiscreteOptionDefaultIndex() const;
	int32 GetDiscreteOptionIndex() const;
	TArray<class FText> GetDiscreteOptions() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDropdown")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDropdown")
	}
	static class UGameSettingValueDropdown* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDropdown>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDropdown;

// Class GameSettings.GameSettingValueDropdownDynamic
// 0x0068 (0x01D0 - 0x0168)
class UGameSettingValueDropdownDynamic : public UGameSettingValueDropdown
{
public:
	uint8                                         Pad_168[0x68];                                     // 0x0168(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDropdownDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDropdownDynamic")
	}
	static class UGameSettingValueDropdownDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDropdownDynamic>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDropdownDynamic;

// Class GameSettings.GameSettingValueDropdownDynamic_Bool
// 0x0000 (0x01D0 - 0x01D0)
class UGameSettingValueDropdownDynamic_Bool final : public UGameSettingValueDropdownDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDropdownDynamic_Bool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDropdownDynamic_Bool")
	}
	static class UGameSettingValueDropdownDynamic_Bool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDropdownDynamic_Bool>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDropdownDynamic_Bool;

// Class GameSettings.GameSettingListEntrySetting_Action
// 0x0010 (0x02D8 - 0x02C8)
class UGameSettingListEntrySetting_Action : public UGameSettingListEntry_Setting
{
public:
	class UGameSettingAction*                     ActionSetting;                                     // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Action;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnSettingAssigned(const class FText& ActionText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_Action")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_Action")
	}
	static class UGameSettingListEntrySetting_Action* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_Action>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_Action;

// Class GameSettings.GameSettingListEntrySetting_Navigation
// 0x0010 (0x02D8 - 0x02C8)
class UGameSettingListEntrySetting_Navigation : public UGameSettingListEntry_Setting
{
public:
	class UGameSettingCollectionPage*             CollectionSetting;                                 // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonBase*                      Button_Navigate;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnSettingAssigned(const class FText& ActionText);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_Navigation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_Navigation")
	}
	static class UGameSettingListEntrySetting_Navigation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_Navigation>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_Navigation;

// Class GameSettings.GameSettingValueScalar
// 0x0000 (0x0168 - 0x0168)
class UGameSettingValueScalar : public UGameSettingValue
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueScalar")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueScalar")
	}
	static class UGameSettingValueScalar* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueScalar>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueScalar;

// Class GameSettings.GameSettingValueScalarDynamic
// 0x00C8 (0x0230 - 0x0168)
class UGameSettingValueScalarDynamic : public UGameSettingValueScalar
{
public:
	uint8                                         Pad_168[0xC8];                                     // 0x0168(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueScalarDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueScalarDynamic")
	}
	static class UGameSettingValueScalarDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueScalarDynamic>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueScalarDynamic;

// Class GameSettings.GameSettingListEntrySetting_SpinBox
// 0x0010 (0x02D8 - 0x02C8)
class UGameSettingListEntrySetting_SpinBox : public UGameSettingListEntry_Setting
{
public:
	class UGameSettingValueSpinBox*               SpinboxSetting;                                    // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USpinBox*                               Spin_Box;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void HandleValueCommited(float InValue, ETextCommit CommitMethod);
	void OnValueChanged(float DefaultValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListEntrySetting_SpinBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListEntrySetting_SpinBox")
	}
	static class UGameSettingListEntrySetting_SpinBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListEntrySetting_SpinBox>();
	}
};
DUMPER7_ASSERTS_UGameSettingListEntrySetting_SpinBox;

// Class GameSettings.GameSettingListView
// 0x0058 (0x03C0 - 0x0368)
class UGameSettingListView final : public UListView
{
public:
	class UGameSettingVisualData*                 VisualData;                                        // 0x0368(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_370[0x50];                                     // 0x0370(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingListView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingListView")
	}
	static class UGameSettingListView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingListView>();
	}
};
DUMPER7_ASSERTS_UGameSettingListView;

// Class GameSettings.GameSettingPanel
// 0x0438 (0x06C0 - 0x0288)
class UGameSettingPanel : public UCommonUserWidget
{
public:
	uint8                                         Pad_288[0x18];                                     // 0x0288(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingRegistry*                   Registry;                                          // 0x02A0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UGameSetting*>                   VisibleSettings;                                   // 0x02A8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class UGameSetting*                           LastHoveredOrSelectedSetting;                      // 0x02B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameSettingFilterState                FilterState;                                       // 0x02C0(0x03B8)(Transient, NativeAccessSpecifierPrivate)
	TArray<struct FGameSettingFilterState>        FilterNavigationStack;                             // 0x0678(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_688[0x10];                                     // 0x0688(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingListView*                   ListView_Settings;                                 // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSettingDetailView*                 Details_Settings;                                  // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMulticastInlineDelegate<void(class UGameSetting* Setting, const struct FGameplayTag& action)> BP_OnExecuteNamedAction; // 0x06A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_6B8[0x8];                                      // 0x06B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingPanel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingPanel")
	}
	static class UGameSettingPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingPanel>();
	}
};
DUMPER7_ASSERTS_UGameSettingPanel;

// Class GameSettings.GameSettingValueDropdownDynamic_Color
// 0x0000 (0x01D0 - 0x01D0)
class UGameSettingValueDropdownDynamic_Color final : public UGameSettingValueDropdownDynamic
{
public:
	struct FLinearColor GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDropdownDynamic_Color")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDropdownDynamic_Color")
	}
	static class UGameSettingValueDropdownDynamic_Color* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDropdownDynamic_Color>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDropdownDynamic_Color;

// Class GameSettings.GameSettingPressAnyKey
// 0x0048 (0x0368 - 0x0320)
class UGameSettingPressAnyKey : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_320[0x48];                                     // 0x0320(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingPressAnyKey")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingPressAnyKey")
	}
	static class UGameSettingPressAnyKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingPressAnyKey>();
	}
};
DUMPER7_ASSERTS_UGameSettingPressAnyKey;

// Class GameSettings.GameSettingRegistry
// 0x0088 (0x00B0 - 0x0028)
class UGameSettingRegistry : public UObject
{
public:
	uint8                                         Pad_28[0x60];                                      // 0x0028(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UGameSetting*>                   TopLevelSettings;                                  // 0x0088(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UGameSetting*>                   RegisteredSettings;                                // 0x0098(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class ULocalPlayer*                           OwningLocalPlayer;                                 // 0x00A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingRegistry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingRegistry")
	}
	static class UGameSettingRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingRegistry>();
	}
};
DUMPER7_ASSERTS_UGameSettingRegistry;

// Class GameSettings.GameSettingRotator
// 0x0000 (0x0BF8 - 0x0BF8)
class UGameSettingRotator : public UCommonRotator
{
public:
	void BP_OnDefaultOptionSpecified(int32 DefaultOptionIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingRotator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingRotator")
	}
	static class UGameSettingRotator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingRotator>();
	}
};
DUMPER7_ASSERTS_UGameSettingRotator;

// Class GameSettings.GameSettingVisualData
// 0x0140 (0x0170 - 0x0030)
class UGameSettingVisualData final : public UDataAsset
{
public:
	TMap<TSubclassOf<class UGameSetting>, TSubclassOf<class UGameSettingListEntryBase>> EntryWidgetForClass; // 0x0030(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<class FName, TSubclassOf<class UGameSettingListEntryBase>> EntryWidgetForName;              // 0x0080(0x0050)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UGameSetting>, struct FGameSettingClassExtensions> ExtensionsForClasses;  // 0x00D0(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FGameSettingNameExtensions> ExtensionsForName;                          // 0x0120(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingVisualData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingVisualData")
	}
	static class UGameSettingVisualData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingVisualData>();
	}
};
DUMPER7_ASSERTS_UGameSettingVisualData;

// Class GameSettings.GameSettingScreen
// 0x0070 (0x0390 - 0x0320)
class UGameSettingScreen : public UCommonActivatableWidget
{
public:
	uint8                                         Pad_320[0x60];                                     // 0x0320(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingPanel*                      Settings_Panel;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGameSettingRegistry*                   Registry;                                          // 0x0388(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void ApplyChanges();
	bool AttemptToPopNavigation();
	void CancelChanges();
	class UGameSettingCollection* GetSettingCollection(class FName SettingDevName, bool* HasAnySettings);
	void NavigateToSetting(class FName SettingDevName);
	void NavigateToSettings(const TArray<class FName>& SettingDevNames);
	void OnSettingsDirtyStateChanged(bool bSettingsDirty);

	bool HaveSettingsBeenChanged() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingScreen")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingScreen")
	}
	static class UGameSettingScreen* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingScreen>();
	}
};
DUMPER7_ASSERTS_UGameSettingScreen;

// Class GameSettings.GameSettingValueDiscrete
// 0x0000 (0x0168 - 0x0168)
class UGameSettingValueDiscrete : public UGameSettingValue
{
public:
	int32 GetDiscreteOptionDefaultIndex() const;
	int32 GetDiscreteOptionIndex() const;
	TArray<class FText> GetDiscreteOptions() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscrete")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscrete")
	}
	static class UGameSettingValueDiscrete* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscrete>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscrete;

// Class GameSettings.GameSettingValueDiscreteDynamic
// 0x0068 (0x01D0 - 0x0168)
class UGameSettingValueDiscreteDynamic : public UGameSettingValueDiscrete
{
public:
	uint8                                         Pad_168[0x68];                                     // 0x0168(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic")
	}
	static class UGameSettingValueDiscreteDynamic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic;

// Class GameSettings.GameSettingValueDropdownDynamic_Vector2D
// 0x0000 (0x01D0 - 0x01D0)
class UGameSettingValueDropdownDynamic_Vector2D final : public UGameSettingValueDropdownDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDropdownDynamic_Vector2D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDropdownDynamic_Vector2D")
	}
	static class UGameSettingValueDropdownDynamic_Vector2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDropdownDynamic_Vector2D>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDropdownDynamic_Vector2D;

// Class GameSettings.GameSettingValueDiscreteDynamic_Bool
// 0x0000 (0x01D0 - 0x01D0)
class UGameSettingValueDiscreteDynamic_Bool final : public UGameSettingValueDiscreteDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Bool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Bool")
	}
	static class UGameSettingValueDiscreteDynamic_Bool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Bool>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Bool;

// Class GameSettings.GameSettingValueDiscreteDynamic_Number
// 0x0000 (0x01D0 - 0x01D0)
class UGameSettingValueDiscreteDynamic_Number final : public UGameSettingValueDiscreteDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Number")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Number")
	}
	static class UGameSettingValueDiscreteDynamic_Number* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Number>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Number;

// Class GameSettings.GameSettingValueDiscreteDynamic_Enum
// 0x0000 (0x01D0 - 0x01D0)
class UGameSettingValueDiscreteDynamic_Enum final : public UGameSettingValueDiscreteDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Enum")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Enum")
	}
	static class UGameSettingValueDiscreteDynamic_Enum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Enum>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Enum;

// Class GameSettings.GameSettingValueDiscreteDynamic_Color
// 0x0000 (0x01D0 - 0x01D0)
class UGameSettingValueDiscreteDynamic_Color final : public UGameSettingValueDiscreteDynamic
{
public:
	struct FLinearColor GetValue() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Color")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Color")
	}
	static class UGameSettingValueDiscreteDynamic_Color* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Color>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Color;

// Class GameSettings.GameSettingValueDiscreteDynamic_Vector2D
// 0x0000 (0x01D0 - 0x01D0)
class UGameSettingValueDiscreteDynamic_Vector2D final : public UGameSettingValueDiscreteDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDiscreteDynamic_Vector2D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDiscreteDynamic_Vector2D")
	}
	static class UGameSettingValueDiscreteDynamic_Vector2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDiscreteDynamic_Vector2D>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDiscreteDynamic_Vector2D;

// Class GameSettings.GameSettingValueDropdownDynamic_Number
// 0x0000 (0x01D0 - 0x01D0)
class UGameSettingValueDropdownDynamic_Number final : public UGameSettingValueDropdownDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDropdownDynamic_Number")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDropdownDynamic_Number")
	}
	static class UGameSettingValueDropdownDynamic_Number* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDropdownDynamic_Number>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDropdownDynamic_Number;

// Class GameSettings.GameSettingValueDropdownDynamic_Enum
// 0x0000 (0x01D0 - 0x01D0)
class UGameSettingValueDropdownDynamic_Enum final : public UGameSettingValueDropdownDynamic
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueDropdownDynamic_Enum")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueDropdownDynamic_Enum")
	}
	static class UGameSettingValueDropdownDynamic_Enum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueDropdownDynamic_Enum>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueDropdownDynamic_Enum;

// Class GameSettings.GameSettingValueSpinBox
// 0x0070 (0x01D8 - 0x0168)
class UGameSettingValueSpinBox final : public UGameSettingValue
{
public:
	uint8                                         Pad_168[0x70];                                     // 0x0168(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingValueSpinBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingValueSpinBox")
	}
	static class UGameSettingValueSpinBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameSettingValueSpinBox>();
	}
};
DUMPER7_ASSERTS_UGameSettingValueSpinBox;

// Class GameSettings.GameSettingActionInterface
// 0x0000 (0x0000 - 0x0000)
class IGameSettingActionInterface final
{
public:
	bool ExecuteActionForSetting(const struct FGameplayTag& ActionTag, class UGameSetting* InSetting);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GameSettingActionInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GameSettingActionInterface")
	}
	static class IGameSettingActionInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IGameSettingActionInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IGameSettingActionInterface;

// Class GameSettings.KeyAlreadyBoundWarning
// 0x0010 (0x0378 - 0x0368)
class UKeyAlreadyBoundWarning : public UGameSettingPressAnyKey
{
public:
	class UTextBlock*                             WarningText;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             CancelText;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("KeyAlreadyBoundWarning")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"KeyAlreadyBoundWarning")
	}
	static class UKeyAlreadyBoundWarning* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKeyAlreadyBoundWarning>();
	}
};
DUMPER7_ASSERTS_UKeyAlreadyBoundWarning;

}

