#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameSettings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function GameSettings.GameResponsivePanel.AddChildToGameResponsivePanel
// 0x0010 (0x0010 - 0x0000)
struct GameResponsivePanel_AddChildToGameResponsivePanel final
{
public:
	class UWidget*                                Content;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameResponsivePanelSlot*               ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameResponsivePanel_AddChildToGameResponsivePanel;

// Function GameSettings.GameSetting.GetDisplayNameVisibility
// 0x0001 (0x0001 - 0x0000)
struct GameSetting_GetDisplayNameVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetDisplayNameVisibility;

// Function GameSettings.GameSetting.GetDescriptionRichText
// 0x0018 (0x0018 - 0x0000)
struct GameSetting_GetDescriptionRichText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetDescriptionRichText;

// Function GameSettings.GameSetting.GetDevName
// 0x0008 (0x0008 - 0x0000)
struct GameSetting_GetDevName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetDevName;

// Function GameSettings.GameSetting.GetDisplayName
// 0x0018 (0x0018 - 0x0000)
struct GameSetting_GetDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetDisplayName;

// Function GameSettings.GameSetting.GetDynamicDetails
// 0x0018 (0x0018 - 0x0000)
struct GameSetting_GetDynamicDetails final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetDynamicDetails;

// Function GameSettings.GameSetting.GetTags
// 0x0020 (0x0020 - 0x0000)
struct GameSetting_GetTags final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetTags;

// Function GameSettings.GameSetting.GetWarningRichText
// 0x0018 (0x0018 - 0x0000)
struct GameSetting_GetWarningRichText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSetting_GetWarningRichText;

// Function GameSettings.GameSettingDetailExtension.OnSettingAssigned
// 0x0008 (0x0008 - 0x0000)
struct GameSettingDetailExtension_OnSettingAssigned final
{
public:
	class UGameSetting*                           InSetting;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingDetailExtension_OnSettingAssigned;

// Function GameSettings.GameSettingDetailExtension.OnSettingValueChanged
// 0x0008 (0x0008 - 0x0000)
struct GameSettingDetailExtension_OnSettingValueChanged final
{
public:
	class UGameSetting*                           InSetting;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingDetailExtension_OnSettingValueChanged;

// Function GameSettings.GameSettingListEntryBase.GetPrimaryGamepadFocusWidget
// 0x0008 (0x0008 - 0x0000)
struct GameSettingListEntryBase_GetPrimaryGamepadFocusWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingListEntryBase_GetPrimaryGamepadFocusWidget;

// Function GameSettings.GameSettingListEntrySetting_Dropdown.HandleSelectionChanged
// 0x0018 (0x0018 - 0x0000)
struct GameSettingListEntrySetting_Dropdown_HandleSelectionChanged final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameSettingListEntrySetting_Dropdown_HandleSelectionChanged;

// Function GameSettings.GameSettingValueDropdown.GetDiscreteOptionDefaultIndex
// 0x0004 (0x0004 - 0x0000)
struct GameSettingValueDropdown_GetDiscreteOptionDefaultIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueDropdown_GetDiscreteOptionDefaultIndex;

// Function GameSettings.GameSettingValueDropdown.GetDiscreteOptionIndex
// 0x0004 (0x0004 - 0x0000)
struct GameSettingValueDropdown_GetDiscreteOptionIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueDropdown_GetDiscreteOptionIndex;

// Function GameSettings.GameSettingValueDropdown.GetDiscreteOptions
// 0x0010 (0x0010 - 0x0000)
struct GameSettingValueDropdown_GetDiscreteOptions final
{
public:
	TArray<class FText>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueDropdown_GetDiscreteOptions;

// Function GameSettings.GameSettingListEntrySetting_Scalar.HandleSliderValueChanged
// 0x0004 (0x0004 - 0x0000)
struct GameSettingListEntrySetting_Scalar_HandleSliderValueChanged final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingListEntrySetting_Scalar_HandleSliderValueChanged;

// Function GameSettings.GameSettingListEntrySetting_Scalar.OnDefaultValueChanged
// 0x0004 (0x0004 - 0x0000)
struct GameSettingListEntrySetting_Scalar_OnDefaultValueChanged final
{
public:
	float                                         DefaultValue;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingListEntrySetting_Scalar_OnDefaultValueChanged;

// Function GameSettings.GameSettingListEntrySetting_Scalar.OnValueChanged
// 0x0004 (0x0004 - 0x0000)
struct GameSettingListEntrySetting_Scalar_OnValueChanged final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingListEntrySetting_Scalar_OnValueChanged;

// Function GameSettings.GameSettingListEntrySetting_Action.OnSettingAssigned
// 0x0018 (0x0018 - 0x0000)
struct GameSettingListEntrySetting_Action_OnSettingAssigned final
{
public:
	class FText                                   ActionText;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingListEntrySetting_Action_OnSettingAssigned;

// Function GameSettings.GameSettingListEntrySetting_Navigation.OnSettingAssigned
// 0x0018 (0x0018 - 0x0000)
struct GameSettingListEntrySetting_Navigation_OnSettingAssigned final
{
public:
	class FText                                   ActionText;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingListEntrySetting_Navigation_OnSettingAssigned;

// Function GameSettings.GameSettingListEntrySetting_SpinBox.HandleValueCommited
// 0x0008 (0x0008 - 0x0000)
struct GameSettingListEntrySetting_SpinBox_HandleValueCommited final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextCommit                                   CommitMethod;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameSettingListEntrySetting_SpinBox_HandleValueCommited;

// Function GameSettings.GameSettingListEntrySetting_SpinBox.OnValueChanged
// 0x0004 (0x0004 - 0x0000)
struct GameSettingListEntrySetting_SpinBox_OnValueChanged final
{
public:
	float                                         DefaultValue;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingListEntrySetting_SpinBox_OnValueChanged;

// Function GameSettings.GameSettingRotator.BP_OnDefaultOptionSpecified
// 0x0004 (0x0004 - 0x0000)
struct GameSettingRotator_BP_OnDefaultOptionSpecified final
{
public:
	int32                                         DefaultOptionIndex;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingRotator_BP_OnDefaultOptionSpecified;

// Function GameSettings.GameSettingScreen.AttemptToPopNavigation
// 0x0001 (0x0001 - 0x0000)
struct GameSettingScreen_AttemptToPopNavigation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingScreen_AttemptToPopNavigation;

// Function GameSettings.GameSettingScreen.GetSettingCollection
// 0x0018 (0x0018 - 0x0000)
struct GameSettingScreen_GetSettingCollection final
{
public:
	class FName                                   SettingDevName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HasAnySettings;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameSettingCollection*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingScreen_GetSettingCollection;

// Function GameSettings.GameSettingScreen.NavigateToSetting
// 0x0008 (0x0008 - 0x0000)
struct GameSettingScreen_NavigateToSetting final
{
public:
	class FName                                   SettingDevName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingScreen_NavigateToSetting;

// Function GameSettings.GameSettingScreen.NavigateToSettings
// 0x0010 (0x0010 - 0x0000)
struct GameSettingScreen_NavigateToSettings final
{
public:
	TArray<class FName>                           SettingDevNames;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingScreen_NavigateToSettings;

// Function GameSettings.GameSettingScreen.OnSettingsDirtyStateChanged
// 0x0001 (0x0001 - 0x0000)
struct GameSettingScreen_OnSettingsDirtyStateChanged final
{
public:
	bool                                          bSettingsDirty;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingScreen_OnSettingsDirtyStateChanged;

// Function GameSettings.GameSettingScreen.HaveSettingsBeenChanged
// 0x0001 (0x0001 - 0x0000)
struct GameSettingScreen_HaveSettingsBeenChanged final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingScreen_HaveSettingsBeenChanged;

// Function GameSettings.GameSettingValueDiscrete.GetDiscreteOptionDefaultIndex
// 0x0004 (0x0004 - 0x0000)
struct GameSettingValueDiscrete_GetDiscreteOptionDefaultIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueDiscrete_GetDiscreteOptionDefaultIndex;

// Function GameSettings.GameSettingValueDiscrete.GetDiscreteOptionIndex
// 0x0004 (0x0004 - 0x0000)
struct GameSettingValueDiscrete_GetDiscreteOptionIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueDiscrete_GetDiscreteOptionIndex;

// Function GameSettings.GameSettingValueDiscrete.GetDiscreteOptions
// 0x0010 (0x0010 - 0x0000)
struct GameSettingValueDiscrete_GetDiscreteOptions final
{
public:
	TArray<class FText>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueDiscrete_GetDiscreteOptions;

// Function GameSettings.GameSettingActionInterface.ExecuteActionForSetting
// 0x0018 (0x0018 - 0x0000)
struct GameSettingActionInterface_ExecuteActionForSetting final
{
public:
	struct FGameplayTag                           ActionTag;                                         // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGameSetting*                           InSetting;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameSettingActionInterface_ExecuteActionForSetting;

// Function GameSettings.GameSettingValueDiscreteDynamic_Color.GetValue
// 0x0010 (0x0010 - 0x0000)
struct GameSettingValueDiscreteDynamic_Color_GetValue final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueDiscreteDynamic_Color_GetValue;

// Function GameSettings.GameSettingValueDropdownDynamic_Color.GetValue
// 0x0010 (0x0010 - 0x0000)
struct GameSettingValueDropdownDynamic_Color_GetValue final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameSettingValueDropdownDynamic_Color_GetValue;

}

