#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GrappleHookProProjectile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GrappleHookProProjectile.GrappleHookProProjectile_C.ExecuteUbergraph_GrappleHookProProjectile
// 0x0158 (0x0158 - 0x0000)
struct GrappleHookProProjectile_C_ExecuteUbergraph_GrappleHookProProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ImpactPoint;                          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ImpactNormal;                         // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_HitActor;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_Event_Character;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0040(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_ImpactResult;           // 0x00CC(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GrappleHookProProjectile_C_ExecuteUbergraph_GrappleHookProProjectile;

// Function GrappleHookProProjectile.GrappleHookProProjectile_C.BndEvt__GrappleHookProProjectile_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature
// 0x0088 (0x0088 - 0x0000)
struct GrappleHookProProjectile_C_BndEvt__GrappleHookProProjectile_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature final
{
public:
	struct FHitResult                             ImpactResult;                                      // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_GrappleHookProProjectile_C_BndEvt__GrappleHookProProjectile_ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature;

// Function GrappleHookProProjectile.GrappleHookProProjectile_C.OnProjectileSpawn
// 0x0008 (0x0008 - 0x0000)
struct GrappleHookProProjectile_C_OnProjectileSpawn final
{
public:
	class ACharacter*                             Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GrappleHookProProjectile_C_OnProjectileSpawn;

// Function GrappleHookProProjectile.GrappleHookProProjectile_C.OnProjectileHit
// 0x0020 (0x0020 - 0x0000)
struct GrappleHookProProjectile_C_OnProjectileHit final
{
public:
	struct FVector                                ImpactPoint;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactNormal;                                      // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HitActor;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GrappleHookProProjectile_C_OnProjectileHit;

// Function GrappleHookProProjectile.GrappleHookProProjectile_C.PlaySoundNearProjectile
// 0x0010 (0x0010 - 0x0000)
struct GrappleHookProProjectile_C_PlaySoundNearProjectile final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GrappleHookProProjectile_C_PlaySoundNearProjectile;

// Function GrappleHookProProjectile.GrappleHookProProjectile_C.ChangeProjectileMesh
// 0x0010 (0x0010 - 0x0000)
struct GrappleHookProProjectile_C_ChangeProjectileMesh final
{
public:
	class UStaticMesh*                            NewMesh;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GrappleHookProProjectile_C_ChangeProjectileMesh;

// Function GrappleHookProProjectile.GrappleHookProProjectile_C.ChangeProjectileScale
// 0x000C (0x000C - 0x0000)
struct GrappleHookProProjectile_C_ChangeProjectileScale final
{
public:
	struct FVector                                NewScale;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GrappleHookProProjectile_C_ChangeProjectileScale;

// Function GrappleHookProProjectile.GrappleHookProProjectile_C.ChangeProjectileRotation
// 0x0094 (0x0094 - 0x0000)
struct GrappleHookProProjectile_C_ChangeProjectileRotation final
{
public:
	struct FRotator                               New_Rotation;                                      // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x000C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_GrappleHookProProjectile_C_ChangeProjectileRotation;

// Function GrappleHookProProjectile.GrappleHookProProjectile_C.ChangeProjectileMaterial
// 0x0010 (0x0010 - 0x0000)
struct GrappleHookProProjectile_C_ChangeProjectileMaterial final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GrappleHookProProjectile_C_ChangeProjectileMaterial;

// Function GrappleHookProProjectile.GrappleHookProProjectile_C.OnHitSoundFinishedPlaySoundLoop
// 0x0001 (0x0001 - 0x0000)
struct GrappleHookProProjectile_C_OnHitSoundFinishedPlaySoundLoop final
{
public:
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GrappleHookProProjectile_C_OnHitSoundFinishedPlaySoundLoop;

// Function GrappleHookProProjectile.GrappleHookProProjectile_C.ResetProjectile
// 0x0018 (0x0018 - 0x0000)
struct GrappleHookProProjectile_C_ResetProjectile final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GrappleHookProProjectile_C_ResetProjectile;

// Function GrappleHookProProjectile.GrappleHookProProjectile_C.SetProjectileHit
// 0x0014 (0x0014 - 0x0000)
struct GrappleHookProProjectile_C_SetProjectileHit final
{
public:
	bool                                          IsProjectileHit_0;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
};
DUMPER7_ASSERTS_GrappleHookProProjectile_C_SetProjectileHit;

// Function GrappleHookProProjectile.GrappleHookProProjectile_C.SetActive
// 0x0001 (0x0001 - 0x0000)
struct GrappleHookProProjectile_C_SetActive final
{
public:
	bool                                          IsActive_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_GrappleHookProProjectile_C_SetActive;

}

