#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HathoraSDK

#include "Basic.hpp"

#include "HathoraSDK_structs.hpp"


namespace SDK::Params
{

// Function HathoraSDK.HathoraAuthV1LoginAnonymous.LoginAnonymous
// 0x0018 (0x0018 - 0x0000)
struct HathoraAuthV1LoginAnonymous_LoginAnonymous final
{
public:
	class UHathoraSDKAuthV1*                      HathoraSDKAuthV1_0;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraAuthV1LoginAnonymous*           ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraAuthV1LoginAnonymous_LoginAnonymous;

// Function HathoraSDK.HathoraAuthV1LoginGoogle.LoginGoogle
// 0x0028 (0x0028 - 0x0000)
struct HathoraAuthV1LoginGoogle_LoginGoogle final
{
public:
	class UHathoraSDKAuthV1*                      HathoraSDKAuthV1_0;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IdToken;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraAuthV1LoginGoogle*              ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraAuthV1LoginGoogle_LoginGoogle;

// Function HathoraSDK.HathoraAuthV1LoginNickname.LoginNickname
// 0x0028 (0x0028 - 0x0000)
struct HathoraAuthV1LoginNickname_LoginNickname final
{
public:
	class UHathoraSDKAuthV1*                      HathoraSDKAuthV1_0;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Nickname;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraAuthV1LoginNickname*            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraAuthV1LoginNickname_LoginNickname;

// Function HathoraSDK.HathoraDiscoveryV1GetPingServiceEndpoints.GetPingServiceEndpoints
// 0x0018 (0x0018 - 0x0000)
struct HathoraDiscoveryV1GetPingServiceEndpoints_GetPingServiceEndpoints final
{
public:
	class UHathoraSDKDiscoveryV1*                 HathoraSDKDiscoveryV1_0;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraDiscoveryV1GetPingServiceEndpoints* ReturnValue;                                   // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraDiscoveryV1GetPingServiceEndpoints_GetPingServiceEndpoints;

// Function HathoraSDK.HathoraGetRegionalPings.GetRegionalPings
// 0x0018 (0x0018 - 0x0000)
struct HathoraGetRegionalPings_GetRegionalPings final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumPingsPerRegion;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHathoraGetRegionalPings*               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraGetRegionalPings_GetRegionalPings;

// Function HathoraSDK.HathoraLobbyComponent.CreateAndJoinLobby
// 0x0020 (0x0020 - 0x0000)
struct HathoraLobbyComponent_CreateAndJoinLobby final
{
public:
	EHathoraLobbyVisibility                       Visibility;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RoomConfig;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHathoraCloudRegion                           Region;                                            // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ShortCodeLength;                                   // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraLobbyComponent_CreateAndJoinLobby;

// Function HathoraSDK.HathoraLobbyComponent.CreateAndJoinLobbyCustomShortCode
// 0x0030 (0x0030 - 0x0000)
struct HathoraLobbyComponent_CreateAndJoinLobbyCustomShortCode final
{
public:
	EHathoraLobbyVisibility                       Visibility;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RoomConfig;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHathoraCloudRegion                           Region;                                            // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ShortCode;                                         // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraLobbyComponent_CreateAndJoinLobbyCustomShortCode;

// Function HathoraSDK.HathoraLobbyComponent.GetSDK
// 0x0008 (0x0008 - 0x0000)
struct HathoraLobbyComponent_GetSDK final
{
public:
	class UHathoraSDK*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraLobbyComponent_GetSDK;

// Function HathoraSDK.HathoraLobbyComponent.IsLoggedIn
// 0x0001 (0x0001 - 0x0000)
struct HathoraLobbyComponent_IsLoggedIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraLobbyComponent_IsLoggedIn;

// Function HathoraSDK.HathoraLobbyComponent.JoinLobbyWithConnectionInfo
// 0x0068 (0x0068 - 0x0000)
struct HathoraLobbyComponent_JoinLobbyWithConnectionInfo final
{
public:
	struct FHathoraConnectionInfo                 ConnectionInfo;                                    // 0x0000(0x0068)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraLobbyComponent_JoinLobbyWithConnectionInfo;

// Function HathoraSDK.HathoraLobbyComponent.JoinLobbyWithShortCode
// 0x0010 (0x0010 - 0x0000)
struct HathoraLobbyComponent_JoinLobbyWithShortCode final
{
public:
	class FString                                 ShortCode;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraLobbyComponent_JoinLobbyWithShortCode;

// Function HathoraSDK.HathoraLobbyV3CreateLobby.CreateLobby
// 0x0058 (0x0058 - 0x0000)
struct HathoraLobbyV3CreateLobby_CreateLobby final
{
public:
	class UHathoraSDKLobbyV3*                     HathoraSDKLobbyV3_0;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHathoraLobbyVisibility                       Visibility;                                        // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RoomConfig;                                        // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHathoraCloudRegion                           Region;                                            // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ShortCode;                                         // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraLobbyV3CreateLobby*             ReturnValue;                                       // 0x0050(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraLobbyV3CreateLobby_CreateLobby;

// Function HathoraSDK.HathoraLobbyV3GetLobbyInfoByRoomId.GetLobbyInfoByRoomId
// 0x0028 (0x0028 - 0x0000)
struct HathoraLobbyV3GetLobbyInfoByRoomId_GetLobbyInfoByRoomId final
{
public:
	class UHathoraSDKLobbyV3*                     HathoraSDKLobbyV3_0;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraLobbyV3GetLobbyInfoByRoomId*    ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraLobbyV3GetLobbyInfoByRoomId_GetLobbyInfoByRoomId;

// Function HathoraSDK.HathoraLobbyV3GetLobbyInfoByShortCode.GetLobbyInfoByShortCode
// 0x0028 (0x0028 - 0x0000)
struct HathoraLobbyV3GetLobbyInfoByShortCode_GetLobbyInfoByShortCode final
{
public:
	class UHathoraSDKLobbyV3*                     HathoraSDKLobbyV3_0;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShortCode;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraLobbyV3GetLobbyInfoByShortCode* ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraLobbyV3GetLobbyInfoByShortCode_GetLobbyInfoByShortCode;

// Function HathoraSDK.HathoraLobbyV3ListAllActivePublicLobbies.ListAllActivePublicLobbies
// 0x0018 (0x0018 - 0x0000)
struct HathoraLobbyV3ListAllActivePublicLobbies_ListAllActivePublicLobbies final
{
public:
	class UHathoraSDKLobbyV3*                     HathoraSDKLobbyV3_0;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraLobbyV3ListAllActivePublicLobbies* ReturnValue;                                    // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraLobbyV3ListAllActivePublicLobbies_ListAllActivePublicLobbies;

// Function HathoraSDK.HathoraLobbyV3ListRegionActivePublicLobbies.ListRegionActivePublicLobbies
// 0x0020 (0x0020 - 0x0000)
struct HathoraLobbyV3ListRegionActivePublicLobbies_ListRegionActivePublicLobbies final
{
public:
	class UHathoraSDKLobbyV3*                     HathoraSDKLobbyV3_0;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHathoraCloudRegion                           Region;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHathoraLobbyV3ListRegionActivePublicLobbies* ReturnValue;                                 // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraLobbyV3ListRegionActivePublicLobbies_ListRegionActivePublicLobbies;

// Function HathoraSDK.HathoraProcessesV2GetLatestProcesses.GetLatestProcesses
// 0x0038 (0x0038 - 0x0000)
struct HathoraProcessesV2GetLatestProcesses_GetLatestProcesses final
{
public:
	class UHathoraSDKProcessesV2*                 HathoraSDKProcessesV2_0;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EHathoraProcessStatus>                 StatusFilter_0;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EHathoraCloudRegion>                   RegionFilter_0;                                    // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UHathoraProcessesV2GetLatestProcesses*  ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraProcessesV2GetLatestProcesses_GetLatestProcesses;

// Function HathoraSDK.HathoraProcessesV2GetProcessInfo.GetProcessInfo
// 0x0028 (0x0028 - 0x0000)
struct HathoraProcessesV2GetProcessInfo_GetProcessInfo final
{
public:
	class UHathoraSDKProcessesV2*                 HathoraSDKProcessesV2_0;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProcessId;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraProcessesV2GetProcessInfo*      ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraProcessesV2GetProcessInfo_GetProcessInfo;

// Function HathoraSDK.HathoraProcessesV2StopProcess.StopProcess
// 0x0028 (0x0028 - 0x0000)
struct HathoraProcessesV2StopProcess_StopProcess final
{
public:
	class UHathoraSDKProcessesV2*                 HathoraSDKProcessesV2_0;                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProcessId;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraProcessesV2StopProcess*         ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraProcessesV2StopProcess_StopProcess;

// Function HathoraSDK.HathoraRoomV2CreateRoom.CreateRoom
// 0x0040 (0x0040 - 0x0000)
struct HathoraRoomV2CreateRoom_CreateRoom final
{
public:
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2_0;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHathoraCloudRegion                           Region;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RoomConfig;                                        // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraRoomV2CreateRoom*               ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraRoomV2CreateRoom_CreateRoom;

// Function HathoraSDK.HathoraRoomV2DestroyRoom.DestroyRoom
// 0x0028 (0x0028 - 0x0000)
struct HathoraRoomV2DestroyRoom_DestroyRoom final
{
public:
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2_0;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraRoomV2DestroyRoom*              ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraRoomV2DestroyRoom_DestroyRoom;

// Function HathoraSDK.HathoraRoomV2GetActiveRoomsForProcess.GetActiveRoomsForProcess
// 0x0028 (0x0028 - 0x0000)
struct HathoraRoomV2GetActiveRoomsForProcess_GetActiveRoomsForProcess final
{
public:
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2_0;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProcessId;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraRoomV2GetActiveRoomsForProcess* ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraRoomV2GetActiveRoomsForProcess_GetActiveRoomsForProcess;

// Function HathoraSDK.HathoraRoomV2GetConnectionInfo.GetConnectionInfo
// 0x0028 (0x0028 - 0x0000)
struct HathoraRoomV2GetConnectionInfo_GetConnectionInfo final
{
public:
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2_0;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraRoomV2GetConnectionInfo*        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraRoomV2GetConnectionInfo_GetConnectionInfo;

// Function HathoraSDK.HathoraRoomV2GetInactiveRoomsForProcess.GetInactiveRoomsForProcess
// 0x0028 (0x0028 - 0x0000)
struct HathoraRoomV2GetInactiveRoomsForProcess_GetInactiveRoomsForProcess final
{
public:
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2_0;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProcessId;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraRoomV2GetInactiveRoomsForProcess* ReturnValue;                                     // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraRoomV2GetInactiveRoomsForProcess_GetInactiveRoomsForProcess;

// Function HathoraSDK.HathoraRoomV2GetRoomInfo.GetRoomInfo
// 0x0028 (0x0028 - 0x0000)
struct HathoraRoomV2GetRoomInfo_GetRoomInfo final
{
public:
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2_0;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraRoomV2GetRoomInfo*              ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraRoomV2GetRoomInfo_GetRoomInfo;

// Function HathoraSDK.HathoraRoomV2SuspendRoom.SuspendRoom
// 0x0028 (0x0028 - 0x0000)
struct HathoraRoomV2SuspendRoom_SuspendRoom final
{
public:
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2_0;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraRoomV2SuspendRoom*              ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraRoomV2SuspendRoom_SuspendRoom;

// Function HathoraSDK.HathoraRoomV2UpdateRoomConfig.UpdateRoomConfig
// 0x0038 (0x0038 - 0x0000)
struct HathoraRoomV2UpdateRoomConfig_UpdateRoomConfig final
{
public:
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2_0;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomId;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoomConfig;                                        // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraRoomV2UpdateRoomConfig*         ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraRoomV2UpdateRoomConfig_UpdateRoomConfig;

// Function HathoraSDK.HathoraSDK.CreateHathoraSDK
// 0x0008 (0x0008 - 0x0000)
struct HathoraSDK_CreateHathoraSDK final
{
public:
	class UHathoraSDK*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraSDK_CreateHathoraSDK;

// Function HathoraSDK.HathoraSDK.GetRegionString
// 0x0018 (0x0018 - 0x0000)
struct HathoraSDK_GetRegionString final
{
public:
	EHathoraCloudRegion                           Region;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraSDK_GetRegionString;

// Function HathoraSDK.HathoraSDK.GetServerEnvironment
// 0x0038 (0x0038 - 0x0000)
struct HathoraSDK_GetServerEnvironment final
{
public:
	struct FHathoraServerEnvironment              ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraSDK_GetServerEnvironment;

// Function HathoraSDK.HathoraSDK.ParseErrorMessage
// 0x0020 (0x0020 - 0x0000)
struct HathoraSDK_ParseErrorMessage final
{
public:
	class FString                                 Content;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraSDK_ParseErrorMessage;

// Function HathoraSDK.HathoraSDK.ParseRegion
// 0x0018 (0x0018 - 0x0000)
struct HathoraSDK_ParseRegion final
{
public:
	class FString                                 RegionString;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHathoraCloudRegion                           ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HathoraSDK_ParseRegion;

// Function HathoraSDK.HathoraSDK.IsLoggedIn
// 0x0001 (0x0001 - 0x0000)
struct HathoraSDK_IsLoggedIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraSDK_IsLoggedIn;

// Function HathoraSDK.HathoraSDK.SetAuthToken
// 0x0010 (0x0010 - 0x0000)
struct HathoraSDK_SetAuthToken final
{
public:
	class FString                                 Token;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraSDK_SetAuthToken;

// Function HathoraSDK.HathoraSDKAPI.OnWorldRemoved
// 0x0010 (0x0010 - 0x0000)
struct HathoraSDKAPI_OnWorldRemoved final
{
public:
	class ULevel*                                 Level;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 World;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraSDKAPI_OnWorldRemoved;

// Function HathoraSDK.HathoraSDKAuthV1.IsLoggedIn
// 0x0001 (0x0001 - 0x0000)
struct HathoraSDKAuthV1_IsLoggedIn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraSDKAuthV1_IsLoggedIn;

// Function HathoraSDK.HathoraSDKProcessesV2.GetProcessStatusString
// 0x0018 (0x0018 - 0x0000)
struct HathoraSDKProcessesV2_GetProcessStatusString final
{
public:
	EHathoraProcessStatus                         Region;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HathoraSDKProcessesV2_GetProcessStatusString;

// Function HathoraSDK.HathoraSDKProcessesV2.ParseStatus
// 0x0018 (0x0018 - 0x0000)
struct HathoraSDKProcessesV2_ParseStatus final
{
public:
	class FString                                 StatusString;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHathoraProcessStatus                         ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_HathoraSDKProcessesV2_ParseStatus;

}

