#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HathoraSDK

#include "Basic.hpp"

#include "HathoraSDK_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class HathoraSDK.HathoraAuthV1LoginAnonymous
// 0x0018 (0x0048 - 0x0030)
class UHathoraAuthV1LoginAnonymous final : public UBlueprintAsyncActionBase
{
public:
	class UHathoraSDKAuthV1*                      HathoraSDKAuthV1;                                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FHathoraLoginResult& Result)> OnComplete;             // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UHathoraAuthV1LoginAnonymous* LoginAnonymous(class UHathoraSDKAuthV1* HathoraSDKAuthV1_0, class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraAuthV1LoginAnonymous")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraAuthV1LoginAnonymous")
	}
	static class UHathoraAuthV1LoginAnonymous* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraAuthV1LoginAnonymous>();
	}
};
DUMPER7_ASSERTS_UHathoraAuthV1LoginAnonymous;

// Class HathoraSDK.HathoraAuthV1LoginGoogle
// 0x0028 (0x0058 - 0x0030)
class UHathoraAuthV1LoginGoogle final : public UBlueprintAsyncActionBase
{
public:
	class UHathoraSDKAuthV1*                      HathoraSDKAuthV1;                                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FHathoraLoginResult& Result)> OnComplete;             // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UHathoraAuthV1LoginGoogle* LoginGoogle(class UHathoraSDKAuthV1* HathoraSDKAuthV1_0, class UObject* WorldContextObject, const class FString& IDToken);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraAuthV1LoginGoogle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraAuthV1LoginGoogle")
	}
	static class UHathoraAuthV1LoginGoogle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraAuthV1LoginGoogle>();
	}
};
DUMPER7_ASSERTS_UHathoraAuthV1LoginGoogle;

// Class HathoraSDK.HathoraAuthV1LoginNickname
// 0x0028 (0x0058 - 0x0030)
class UHathoraAuthV1LoginNickname final : public UBlueprintAsyncActionBase
{
public:
	class UHathoraSDKAuthV1*                      HathoraSDKAuthV1;                                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FHathoraLoginResult& Result)> OnComplete;             // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UHathoraAuthV1LoginNickname* LoginNickname(class UHathoraSDKAuthV1* HathoraSDKAuthV1_0, class UObject* WorldContextObject, const class FString& Nickname);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraAuthV1LoginNickname")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraAuthV1LoginNickname")
	}
	static class UHathoraAuthV1LoginNickname* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraAuthV1LoginNickname>();
	}
};
DUMPER7_ASSERTS_UHathoraAuthV1LoginNickname;

// Class HathoraSDK.HathoraDiscoveryV1GetPingServiceEndpoints
// 0x0018 (0x0048 - 0x0030)
class UHathoraDiscoveryV1GetPingServiceEndpoints final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const TArray<struct FHathoraDiscoveredPingEndpoint>& Endpoints)> OnComplete; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKDiscoveryV1*                 HathoraSDKDiscoveryV1;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UHathoraDiscoveryV1GetPingServiceEndpoints* GetPingServiceEndpoints(class UHathoraSDKDiscoveryV1* HathoraSDKDiscoveryV1_0, class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraDiscoveryV1GetPingServiceEndpoints")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraDiscoveryV1GetPingServiceEndpoints")
	}
	static class UHathoraDiscoveryV1GetPingServiceEndpoints* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraDiscoveryV1GetPingServiceEndpoints>();
	}
};
DUMPER7_ASSERTS_UHathoraDiscoveryV1GetPingServiceEndpoints;

// Class HathoraSDK.HathoraGetRegionalPings
// 0x0018 (0x0048 - 0x0030)
class UHathoraGetRegionalPings final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraRegionPings& Result)> OnComplete;             // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraGetRegionalPings* GetRegionalPings(class UObject* WorldContextObject, int32 NumPingsPerRegion);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraGetRegionalPings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraGetRegionalPings")
	}
	static class UHathoraGetRegionalPings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraGetRegionalPings>();
	}
};
DUMPER7_ASSERTS_UHathoraGetRegionalPings;

// Class HathoraSDK.HathoraLobbyComponent
// 0x0088 (0x0138 - 0x00B0)
class UHathoraLobbyComponent final : public UActorComponent
{
public:
	TMulticastInlineDelegate<void(const class FString& Error)> OnError;                              // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FHathoraConnectionInfo& ConnectionInfo, const class FString& RoomConfig, EHathoraCloudRegion Region)> OnLobbyReady; // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDK*                            SDK;                                               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D8[0x60];                                      // 0x00D8(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CreateAndJoinLobby(EHathoraLobbyVisibility Visibility, const class FString& RoomConfig, EHathoraCloudRegion Region, int32 ShortCodeLength);
	void CreateAndJoinLobbyCustomShortCode(EHathoraLobbyVisibility Visibility, const class FString& RoomConfig, EHathoraCloudRegion Region, const class FString& ShortCode);
	void FetchPublicLobbies();
	class UHathoraSDK* GetSDK();
	bool IsLoggedIn();
	void JoinLobbyWithConnectionInfo(const struct FHathoraConnectionInfo& ConnectionInfo);
	void JoinLobbyWithShortCode(const class FString& ShortCode);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraLobbyComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraLobbyComponent")
	}
	static class UHathoraLobbyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraLobbyComponent>();
	}
};
DUMPER7_ASSERTS_UHathoraLobbyComponent;

// Class HathoraSDK.HathoraLobbyV3CreateLobby
// 0x0058 (0x0088 - 0x0030)
class UHathoraLobbyV3CreateLobby final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraLobbyInfoResult& Result)> OnComplete;         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKLobbyV3*                     HathoraSDKLobbyV3;                                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x40];                                      // 0x0048(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraLobbyV3CreateLobby* CreateLobby(class UHathoraSDKLobbyV3* HathoraSDKLobbyV3_0, class UObject* WorldContextObject, EHathoraLobbyVisibility Visibility, const class FString& RoomConfig, EHathoraCloudRegion Region, const class FString& ShortCode, const class FString& RoomId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraLobbyV3CreateLobby")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraLobbyV3CreateLobby")
	}
	static class UHathoraLobbyV3CreateLobby* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraLobbyV3CreateLobby>();
	}
};
DUMPER7_ASSERTS_UHathoraLobbyV3CreateLobby;

// Class HathoraSDK.HathoraLobbyV3GetLobbyInfoByRoomId
// 0x0028 (0x0058 - 0x0030)
class UHathoraLobbyV3GetLobbyInfoByRoomId final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraLobbyInfoResult& Result)> OnComplete;         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKLobbyV3*                     HathoraSDKLobbyV3;                                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraLobbyV3GetLobbyInfoByRoomId* GetLobbyInfoByRoomId(class UHathoraSDKLobbyV3* HathoraSDKLobbyV3_0, class UObject* WorldContextObject, const class FString& RoomId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraLobbyV3GetLobbyInfoByRoomId")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraLobbyV3GetLobbyInfoByRoomId")
	}
	static class UHathoraLobbyV3GetLobbyInfoByRoomId* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraLobbyV3GetLobbyInfoByRoomId>();
	}
};
DUMPER7_ASSERTS_UHathoraLobbyV3GetLobbyInfoByRoomId;

// Class HathoraSDK.HathoraLobbyV3GetLobbyInfoByShortCode
// 0x0028 (0x0058 - 0x0030)
class UHathoraLobbyV3GetLobbyInfoByShortCode final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraLobbyInfoResult& Result)> OnComplete;         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKLobbyV3*                     HathoraSDKLobbyV3;                                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraLobbyV3GetLobbyInfoByShortCode* GetLobbyInfoByShortCode(class UHathoraSDKLobbyV3* HathoraSDKLobbyV3_0, class UObject* WorldContextObject, const class FString& ShortCode);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraLobbyV3GetLobbyInfoByShortCode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraLobbyV3GetLobbyInfoByShortCode")
	}
	static class UHathoraLobbyV3GetLobbyInfoByShortCode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraLobbyV3GetLobbyInfoByShortCode>();
	}
};
DUMPER7_ASSERTS_UHathoraLobbyV3GetLobbyInfoByShortCode;

// Class HathoraSDK.HathoraLobbyV3ListAllActivePublicLobbies
// 0x0018 (0x0048 - 0x0030)
class UHathoraLobbyV3ListAllActivePublicLobbies final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraLobbyInfosResult& Result)> OnComplete;        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKLobbyV3*                     HathoraSDKLobbyV3;                                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UHathoraLobbyV3ListAllActivePublicLobbies* ListAllActivePublicLobbies(class UHathoraSDKLobbyV3* HathoraSDKLobbyV3_0, class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraLobbyV3ListAllActivePublicLobbies")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraLobbyV3ListAllActivePublicLobbies")
	}
	static class UHathoraLobbyV3ListAllActivePublicLobbies* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraLobbyV3ListAllActivePublicLobbies>();
	}
};
DUMPER7_ASSERTS_UHathoraLobbyV3ListAllActivePublicLobbies;

// Class HathoraSDK.HathoraLobbyV3ListRegionActivePublicLobbies
// 0x0020 (0x0050 - 0x0030)
class UHathoraLobbyV3ListRegionActivePublicLobbies final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraLobbyInfosResult& Result)> OnComplete;        // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKLobbyV3*                     HathoraSDKLobbyV3;                                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraLobbyV3ListRegionActivePublicLobbies* ListRegionActivePublicLobbies(class UHathoraSDKLobbyV3* HathoraSDKLobbyV3_0, class UObject* WorldContextObject, EHathoraCloudRegion Region);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraLobbyV3ListRegionActivePublicLobbies")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraLobbyV3ListRegionActivePublicLobbies")
	}
	static class UHathoraLobbyV3ListRegionActivePublicLobbies* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraLobbyV3ListRegionActivePublicLobbies>();
	}
};
DUMPER7_ASSERTS_UHathoraLobbyV3ListRegionActivePublicLobbies;

// Class HathoraSDK.HathoraProcessesV2GetLatestProcesses
// 0x0038 (0x0068 - 0x0030)
class UHathoraProcessesV2GetLatestProcesses final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraProcessInfosResult& Result)> OnComplete;      // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKProcessesV2*                 HathoraSDKProcessesV2;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EHathoraProcessStatus>                 StatusFilter;                                      // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EHathoraCloudRegion>                   RegionFilter;                                      // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UHathoraProcessesV2GetLatestProcesses* GetLatestProcesses(class UHathoraSDKProcessesV2* HathoraSDKProcessesV2_0, class UObject* WorldContextObject, const TArray<EHathoraProcessStatus>& StatusFilter_0, const TArray<EHathoraCloudRegion>& RegionFilter_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraProcessesV2GetLatestProcesses")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraProcessesV2GetLatestProcesses")
	}
	static class UHathoraProcessesV2GetLatestProcesses* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraProcessesV2GetLatestProcesses>();
	}
};
DUMPER7_ASSERTS_UHathoraProcessesV2GetLatestProcesses;

// Class HathoraSDK.HathoraProcessesV2GetProcessInfo
// 0x0028 (0x0058 - 0x0030)
class UHathoraProcessesV2GetProcessInfo final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraProcessInfoResult& Result)> OnComplete;       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKProcessesV2*                 HathoraSDKProcessesV2;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraProcessesV2GetProcessInfo* GetProcessInfo(class UHathoraSDKProcessesV2* HathoraSDKProcessesV2_0, class UObject* WorldContextObject, const class FString& ProcessId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraProcessesV2GetProcessInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraProcessesV2GetProcessInfo")
	}
	static class UHathoraProcessesV2GetProcessInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraProcessesV2GetProcessInfo>();
	}
};
DUMPER7_ASSERTS_UHathoraProcessesV2GetProcessInfo;

// Class HathoraSDK.HathoraProcessesV2StopProcess
// 0x0028 (0x0058 - 0x0030)
class UHathoraProcessesV2StopProcess final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraStopProcessResult& Result)> OnComplete;       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKProcessesV2*                 HathoraSDKProcessesV2;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraProcessesV2StopProcess* StopProcess(class UHathoraSDKProcessesV2* HathoraSDKProcessesV2_0, class UObject* WorldContextObject, const class FString& ProcessId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraProcessesV2StopProcess")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraProcessesV2StopProcess")
	}
	static class UHathoraProcessesV2StopProcess* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraProcessesV2StopProcess>();
	}
};
DUMPER7_ASSERTS_UHathoraProcessesV2StopProcess;

// Class HathoraSDK.HathoraRoomV2CreateRoom
// 0x0040 (0x0070 - 0x0030)
class UHathoraRoomV2CreateRoom final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraRoomConnectionInfoResult& Result)> OnComplete; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2;                                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x28];                                      // 0x0048(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraRoomV2CreateRoom* CreateRoom(class UHathoraSDKRoomV2* HathoraSDKRoomV2_0, class UObject* WorldContextObject, EHathoraCloudRegion Region, const class FString& RoomConfig, const class FString& RoomId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraRoomV2CreateRoom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraRoomV2CreateRoom")
	}
	static class UHathoraRoomV2CreateRoom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraRoomV2CreateRoom>();
	}
};
DUMPER7_ASSERTS_UHathoraRoomV2CreateRoom;

// Class HathoraSDK.HathoraRoomV2DestroyRoom
// 0x0028 (0x0058 - 0x0030)
class UHathoraRoomV2DestroyRoom final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraDestroyRoomResult& Result)> OnComplete;       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2;                                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraRoomV2DestroyRoom* DestroyRoom(class UHathoraSDKRoomV2* HathoraSDKRoomV2_0, class UObject* WorldContextObject, const class FString& RoomId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraRoomV2DestroyRoom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraRoomV2DestroyRoom")
	}
	static class UHathoraRoomV2DestroyRoom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraRoomV2DestroyRoom>();
	}
};
DUMPER7_ASSERTS_UHathoraRoomV2DestroyRoom;

// Class HathoraSDK.HathoraRoomV2GetActiveRoomsForProcess
// 0x0028 (0x0058 - 0x0030)
class UHathoraRoomV2GetActiveRoomsForProcess final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraGetRoomsForProcessResult& Result)> OnComplete; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2;                                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraRoomV2GetActiveRoomsForProcess* GetActiveRoomsForProcess(class UHathoraSDKRoomV2* HathoraSDKRoomV2_0, class UObject* WorldContextObject, const class FString& ProcessId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraRoomV2GetActiveRoomsForProcess")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraRoomV2GetActiveRoomsForProcess")
	}
	static class UHathoraRoomV2GetActiveRoomsForProcess* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraRoomV2GetActiveRoomsForProcess>();
	}
};
DUMPER7_ASSERTS_UHathoraRoomV2GetActiveRoomsForProcess;

// Class HathoraSDK.HathoraRoomV2GetConnectionInfo
// 0x0028 (0x0058 - 0x0030)
class UHathoraRoomV2GetConnectionInfo final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraRoomConnectionInfoResult& Result)> OnComplete; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2;                                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraRoomV2GetConnectionInfo* GetConnectionInfo(class UHathoraSDKRoomV2* HathoraSDKRoomV2_0, class UObject* WorldContextObject, const class FString& RoomId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraRoomV2GetConnectionInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraRoomV2GetConnectionInfo")
	}
	static class UHathoraRoomV2GetConnectionInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraRoomV2GetConnectionInfo>();
	}
};
DUMPER7_ASSERTS_UHathoraRoomV2GetConnectionInfo;

// Class HathoraSDK.HathoraRoomV2GetInactiveRoomsForProcess
// 0x0028 (0x0058 - 0x0030)
class UHathoraRoomV2GetInactiveRoomsForProcess final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraGetRoomsForProcessResult& Result)> OnComplete; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2;                                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraRoomV2GetInactiveRoomsForProcess* GetInactiveRoomsForProcess(class UHathoraSDKRoomV2* HathoraSDKRoomV2_0, class UObject* WorldContextObject, const class FString& ProcessId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraRoomV2GetInactiveRoomsForProcess")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraRoomV2GetInactiveRoomsForProcess")
	}
	static class UHathoraRoomV2GetInactiveRoomsForProcess* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraRoomV2GetInactiveRoomsForProcess>();
	}
};
DUMPER7_ASSERTS_UHathoraRoomV2GetInactiveRoomsForProcess;

// Class HathoraSDK.HathoraRoomV2GetRoomInfo
// 0x0028 (0x0058 - 0x0030)
class UHathoraRoomV2GetRoomInfo final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraGetRoomInfoResult& Result)> OnComplete;       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2;                                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraRoomV2GetRoomInfo* GetRoomInfo(class UHathoraSDKRoomV2* HathoraSDKRoomV2_0, class UObject* WorldContextObject, const class FString& RoomId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraRoomV2GetRoomInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraRoomV2GetRoomInfo")
	}
	static class UHathoraRoomV2GetRoomInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraRoomV2GetRoomInfo>();
	}
};
DUMPER7_ASSERTS_UHathoraRoomV2GetRoomInfo;

// Class HathoraSDK.HathoraRoomV2SuspendRoom
// 0x0028 (0x0058 - 0x0030)
class UHathoraRoomV2SuspendRoom final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraSuspendRoomResult& Result)> OnComplete;       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2;                                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraRoomV2SuspendRoom* SuspendRoom(class UHathoraSDKRoomV2* HathoraSDKRoomV2_0, class UObject* WorldContextObject, const class FString& RoomId);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraRoomV2SuspendRoom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraRoomV2SuspendRoom")
	}
	static class UHathoraRoomV2SuspendRoom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraRoomV2SuspendRoom>();
	}
};
DUMPER7_ASSERTS_UHathoraRoomV2SuspendRoom;

// Class HathoraSDK.HathoraRoomV2UpdateRoomConfig
// 0x0038 (0x0068 - 0x0030)
class UHathoraRoomV2UpdateRoomConfig final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FHathoraUpdateRoomConfigResult& Result)> OnComplete;  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UHathoraSDKRoomV2*                      HathoraSDKRoomV2;                                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x20];                                      // 0x0048(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UHathoraRoomV2UpdateRoomConfig* UpdateRoomConfig(class UHathoraSDKRoomV2* HathoraSDKRoomV2_0, class UObject* WorldContextObject, const class FString& RoomId, const class FString& RoomConfig);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraRoomV2UpdateRoomConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraRoomV2UpdateRoomConfig")
	}
	static class UHathoraRoomV2UpdateRoomConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraRoomV2UpdateRoomConfig>();
	}
};
DUMPER7_ASSERTS_UHathoraRoomV2UpdateRoomConfig;

// Class HathoraSDK.HathoraSDK
// 0x0028 (0x0050 - 0x0028)
class UHathoraSDK final : public UBlueprintFunctionLibrary
{
public:
	class UHathoraSDKAuthV1*                      AuthV1;                                            // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraSDKDiscoveryV1*                 DiscoveryV1;                                       // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraSDKLobbyV3*                     LobbyV3;                                           // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraSDKProcessesV2*                 ProcessesV2;                                       // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHathoraSDKRoomV2*                      RoomV2;                                            // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UHathoraSDK* CreateHathoraSDK();
	static class FString GetRegionString(EHathoraCloudRegion Region);
	static struct FHathoraServerEnvironment GetServerEnvironment();
	static class FString ParseErrorMessage(const class FString& Content);
	static EHathoraCloudRegion ParseRegion(const class FString& RegionString);

	bool IsLoggedIn();
	void SetAuthToken(const class FString& Token);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraSDK")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraSDK")
	}
	static class UHathoraSDK* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraSDK>();
	}
};
DUMPER7_ASSERTS_UHathoraSDK;

// Class HathoraSDK.HathoraSDKAPI
// 0x0028 (0x0050 - 0x0028)
class UHathoraSDKAPI : public UBlueprintFunctionLibrary
{
public:
	uint8                                         Pad_28[0x28];                                      // 0x0028(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnWorldRemoved(class ULevel* Level, class UWorld* World);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraSDKAPI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraSDKAPI")
	}
	static class UHathoraSDKAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraSDKAPI>();
	}
};
DUMPER7_ASSERTS_UHathoraSDKAPI;

// Class HathoraSDK.HathoraSDKAuthV1
// 0x0000 (0x0050 - 0x0050)
class UHathoraSDKAuthV1 final : public UHathoraSDKAPI
{
public:
	bool IsLoggedIn();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraSDKAuthV1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraSDKAuthV1")
	}
	static class UHathoraSDKAuthV1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraSDKAuthV1>();
	}
};
DUMPER7_ASSERTS_UHathoraSDKAuthV1;

// Class HathoraSDK.HathoraSDKConfig
// 0x0038 (0x0070 - 0x0038)
class UHathoraSDKConfig final : public UDeveloperSettings
{
public:
	class FString                                 BaseUrl;                                           // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         PingTimeoutSeconds;                                // 0x0048(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AppId;                                             // 0x0050(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 DevToken;                                          // 0x0060(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraSDKConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraSDKConfig")
	}
	static class UHathoraSDKConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraSDKConfig>();
	}
};
DUMPER7_ASSERTS_UHathoraSDKConfig;

// Class HathoraSDK.HathoraSDKDiscoveryV1
// 0x0038 (0x0088 - 0x0050)
class UHathoraSDKDiscoveryV1 final : public UHathoraSDKAPI
{
public:
	uint8                                         Pad_50[0x38];                                      // 0x0050(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraSDKDiscoveryV1")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraSDKDiscoveryV1")
	}
	static class UHathoraSDKDiscoveryV1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraSDKDiscoveryV1>();
	}
};
DUMPER7_ASSERTS_UHathoraSDKDiscoveryV1;

// Class HathoraSDK.HathoraSDKLobbyV3
// 0x0000 (0x0050 - 0x0050)
class UHathoraSDKLobbyV3 final : public UHathoraSDKAPI
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HathoraSDKLobbyV3")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HathoraSDKLobbyV3")
	}
	static class UHathoraSDKLobbyV3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHathoraSDKLobbyV3>();
	}
};
DUMPER7_ASSERTS_UHathoraSDKLobbyV3;

// Class HathoraSDK.HathoraSDKProcessesV2
// 0x0000 (0x0050 - 0x0050)
