#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LatencyChecker

#include "Basic.hpp"


namespace SDK::Params
{

// Function LatencyChecker.LatencyCheckerLibrary.PingHttp
// 0x0028 (0x0028 - 0x0000)
struct LatencyCheckerLibrary_PingHttp final
{
public:
	class FString                                 TargetAddress;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Timeout;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& TargetAddress, float RTT)> ResultDelegate;                   // 0x0014(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LatencyCheckerLibrary_PingHttp;

// Function LatencyChecker.LatencyCheckerLibrary.PingIcmp
// 0x0028 (0x0028 - 0x0000)
struct LatencyCheckerLibrary_PingIcmp final
{
public:
	class FString                                 TargetAddress;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Timeout;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& TargetAddress, float RTT)> ResultDelegate;                   // 0x0014(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LatencyCheckerLibrary_PingIcmp;

// Function LatencyChecker.LatencyCheckerLibrary.PingWebSockets
// 0x0028 (0x0028 - 0x0000)
struct LatencyCheckerLibrary_PingWebSockets final
{
public:
	class FString                                 TargetAddress;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Timeout;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Attempts;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& TargetAddress, float RTT)> ResultDelegate;                   // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LatencyCheckerLibrary_PingWebSockets;

}

