#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LootLockerSDK

#include "Basic.hpp"


namespace SDK
{

// Enum LootLockerSDK.ELootLockerWalletHolderTypes
// NumValues: 0x0003
enum class ELootLockerWalletHolderTypes : uint8
{
	character                                = 0,
	player                                   = 1,
	ELootLockerWalletHolderTypes_MAX         = 2,
};

// Enum LootLockerSDK.ELootLockerCatalogEntryEntityKind
// NumValues: 0x0006
enum class ELootLockerCatalogEntryEntityKind : uint8
{
	Asset                                    = 0,
	Currency                                 = 1,
	Progression_Points                       = 2,
	Progression_Reset                        = 3,
	Group                                    = 4,
	ELootLockerCatalogEntryEntityKind_MAX    = 5,
};

// Enum LootLockerSDK.ELootLockerAccountProvider
// NumValues: 0x0004
enum class ELootLockerAccountProvider : uint8
{
	Guest                                    = 0,
	Google                                   = 1,
	Apple                                    = 2,
	ELootLockerAccountProvider_MAX           = 3,
};

// Enum LootLockerSDK.ELootLockerEntitlementHistoryListingType
// NumValues: 0x0005
enum class ELootLockerEntitlementHistoryListingType : uint8
{
	Undefined                                = 0,
	One_time_purchase                        = 1,
	Leaderboard_reward                       = 2,
	Subscription                             = 3,
	ELootLockerEntitlementHistoryListingType_MAX = 4,
};

// Enum LootLockerSDK.ELootLockerEntitlementHistoryListingStore
// NumValues: 0x0008
enum class ELootLockerEntitlementHistoryListingStore : uint8
{
	None                                     = 0,
	Apple_app_store                          = 1,
	Google_play_store                        = 2,
	Steam_store                              = 3,
	Playstation_network                      = 4,
	Nintendo_eshop                           = 5,
	Lootlocker                               = 6,
	ELootLockerEntitlementHistoryListingStore_MAX = 7,
};

// Enum LootLockerSDK.ELootLockerEntitlementHistoryListingStatus
// NumValues: 0x0007
enum class ELootLockerEntitlementHistoryListingStatus : uint8
{
	None                                     = 0,
	Active                                   = 1,
	Pending                                  = 2,
	Expired                                  = 3,
	Canceled                                 = 4,
	Refunded                                 = 5,
	ELootLockerEntitlementHistoryListingStatus_MAX = 6,
};

// Enum LootLockerSDK.ELootLockerFeedbackType
// NumValues: 0x0004
enum class ELootLockerFeedbackType : uint8
{
	Player                                   = 0,
	Game                                     = 1,
	Ugc                                      = 2,
	ELootLockerFeedbackType_MAX              = 3,
};

// Enum LootLockerSDK.ELootLockerLeaderboardRewardEntityKind
// NumValues: 0x0006
enum class ELootLockerLeaderboardRewardEntityKind : uint8
{
	Asset                                    = 0,
	Currency                                 = 1,
	Progression_Points                       = 2,
	Progression_Reset                        = 3,
	Group                                    = 4,
	ELootLockerLeaderboardRewardEntityKind_MAX = 5,
};

// Enum LootLockerSDK.ELootLockerSteamPurchaseRedemptionStatus
// NumValues: 0x000A
enum class ELootLockerSteamPurchaseRedemptionStatus : uint8
{
	Init                                     = 0,
	Approved                                 = 1,
	Succeeded                                = 2,
	Failed                                   = 3,
	Refunded                                 = 4,
	PartialRefund                            = 5,
	ChargedBack                              = 6,
	RefundedSuspectedFraud                   = 7,
	RefundedFriendlyFraud                    = 8,
	ELootLockerSteamPurchaseRedemptionStatus_MAX = 9,
};

// Enum LootLockerSDK.ELootLockerRemoteSessionLeaseStatus
// NumValues: 0x0008
enum class ELootLockerRemoteSessionLeaseStatus : uint8
{
	Created                                  = 0,
	Claimed                                  = 1,
	Verified                                 = 2,
	Authorized                               = 3,
	Cancelled                                = 4,
	Timed_out                                = 5,
	Failed                                   = 6,
	ELootLockerRemoteSessionLeaseStatus_MAX  = 7,
};

// Enum LootLockerSDK.ELootLockerAssetFilter
// NumValues: 0x0008
enum class ELootLockerAssetFilter : uint8
{
	None                                     = 0,
	Purchasable                              = 1,
	NonPurchasable                           = 2,
	Rentable                                 = 3,
	NonRentable                              = 4,
	Popular                                  = 5,
	UnPopular                                = 6,
	ELootLockerAssetFilter_MAX               = 7,
};

// Enum LootLockerSDK.ELootLockerGoogleClientPlatform
// NumValues: 0x0005
enum class ELootLockerGoogleClientPlatform : uint8
{
	Web                                      = 0,
	Android                                  = 1,
	Ios                                      = 2,
	Desktop                                  = 3,
	ELootLockerGoogleClientPlatform_MAX      = 4,
};

// Enum LootLockerSDK.EGoogleAccountProviderPlatform
// NumValues: 0x0005
enum class EGoogleAccountProviderPlatform : uint8
{
	web                                      = 0,
	android                                  = 1,
	ios                                      = 2,
	desktop                                  = 4,
	EGoogleAccountProviderPlatform_MAX       = 5,
};

// Enum LootLockerSDK.ELootLockerHTTPMethod
// NumValues: 0x000A
enum class ELootLockerHTTPMethod : uint8
{
	GET                                      = 0,
	POST                                     = 1,
	DEL                                      = 2,
	PUT                                      = 3,
	HEAD                                     = 4,
	CREATE                                   = 5,
	OPTIONS                                  = 6,
	PATCH                                    = 7,
	UPLOAD                                   = 8,
	ELootLockerHTTPMethod_MAX                = 9,
};

// Enum LootLockerSDK.ELootLockerPlatform
// NumValues: 0x0011
enum class ELootLockerPlatform : uint8
{
	None                                     = 0,
	Guest                                    = 1,
	WhiteLabel                               = 2,
	Steam                                    = 3,
	PlayStationNetwork                       = 4,
	Xbox                                     = 5,
	NintendoSwitch                           = 6,
	AmazonLuna                               = 7,
	AppleSignIn                              = 8,
	Android                                  = 9,
	Google                                   = 10,
	Epic                                     = 11,
	AppleGameCenter                          = 12,
	Meta                                     = 13,
	Remote                                   = 14,
	LastValue                                = 15,
	ELootLockerPlatform_MAX                  = 16,
};

// Enum LootLockerSDK.ELootLockerAssetFilePurpose
// NumValues: 0x0004
enum class ELootLockerAssetFilePurpose : uint8
{
	PRIMARY_THUMBNAIL                        = 0,
	THUMBNAIL                                = 1,
	FILE                                     = 2,
	ELootLockerAssetFilePurpose_MAX          = 3,
};

// ScriptStruct LootLockerSDK.LootLockerGetAllMemberRanksRequest
// 0x0018 (0x0018 - 0x0000)
struct FLootLockerGetAllMemberRanksRequest final
{
public:
	class FString                                 member_id;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         after;                                             // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerGetAllMemberRanksRequest;

// ScriptStruct LootLockerSDK.LootLockerCurrency
// 0x0058 (0x0058 - 0x0000)
struct FLootLockerCurrency final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Code;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Game_api_writes_enabled;                           // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 created_at;                                        // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Published_at;                                      // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerCurrency;

// ScriptStruct LootLockerSDK.LootLockerErrorData
// 0x0058 (0x0058 - 0x0000)
struct FLootLockerErrorData final
{
public:
	class FString                                 Code;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Doc_url;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Request_id;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Trace_id;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Retry_after_seconds;                               // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerErrorData;

// ScriptStruct LootLockerSDK.LootLockerResponse
// 0x0070 (0x0070 - 0x0000)
struct FLootLockerResponse
{
public:
	bool                                          success;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StatusCode;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FullTextFromServer;                                // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLootLockerErrorData                   ErrorData;                                         // 0x0018(0x0058)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerResponse;

// ScriptStruct LootLockerSDK.LootLockerListCurrenciesResponse
// 0x0010 (0x0080 - 0x0070)
struct FLootLockerListCurrenciesResponse final : public FLootLockerResponse
{
public:
	TArray<struct FLootLockerCurrency>            Currencies;                                        // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerListCurrenciesResponse;

// ScriptStruct LootLockerSDK.LootLockerAssetInstanceStorageItem
// 0x0020 (0x0020 - 0x0000)
struct FLootLockerAssetInstanceStorageItem
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerAssetInstanceStorageItem;

// ScriptStruct LootLockerSDK.LootLockerAssetInstanceStorageResponseItem
// 0x0008 (0x0028 - 0x0020)
struct FLootLockerAssetInstanceStorageResponseItem final : public FLootLockerAssetInstanceStorageItem
{
public:
	int32                                         ID;                                                // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerAssetInstanceStorageResponseItem;

// ScriptStruct LootLockerSDK.LootLockerRarity
// 0x0030 (0x0030 - 0x0000)
struct FLootLockerRarity final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 short_name;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Color;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerRarity;

// ScriptStruct LootLockerSDK.LootLockerRentalOption
// 0x0080 (0x0080 - 0x0000)
struct FLootLockerRentalOption final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Duration;                                          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         price;                                             // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 sales_price;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            links;                                             // 0x0030(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerRentalOption;

// ScriptStruct LootLockerSDK.LootLockerPsn
// 0x0018 (0x0018 - 0x0000)
struct FLootLockerPsn final
{
public:
	class FString                                 entitlement_id;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         service_label;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerPsn;

// ScriptStruct LootLockerSDK.LootLockerApple
// 0x0010 (0x0010 - 0x0000)
struct FLootLockerApple final
{
public:
	class FString                                 product_id;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerApple;

// ScriptStruct LootLockerSDK.LootLockerGoogle
// 0x0010 (0x0010 - 0x0000)
struct FLootLockerGoogle final
{
public:
	class FString                                 product_id;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerGoogle;

// ScriptStruct LootLockerSDK.LootLockerExternalIdentifiers
// 0x0038 (0x0038 - 0x0000)
struct FLootLockerExternalIdentifiers final
{
public:
	struct FLootLockerPsn                         psn;                                               // 0x0000(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLootLockerApple                       apple_app_store;                                   // 0x0018(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLootLockerGoogle                      google_play;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerExternalIdentifiers;

// ScriptStruct LootLockerSDK.LootLockerFilter
// 0x0020 (0x0020 - 0x0000)
struct FLootLockerFilter final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerFilter;

// ScriptStruct LootLockerSDK.LootLockerPersistentStorageItem
// 0x0028 (0x0028 - 0x0000)
struct FLootLockerPersistentStorageItem final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          is_public;                                         // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         order;                                             // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerPersistentStorageItem;

// ScriptStruct LootLockerSDK.LootLockerHasKeyValueStorage
// 0x0010 (0x0010 - 0x0000)
struct FLootLockerHasKeyValueStorage
{
public:
	TArray<struct FLootLockerPersistentStorageItem> storage;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerHasKeyValueStorage;

// ScriptStruct LootLockerSDK.LootLockerVariation
// 0x0088 (0x0088 - 0x0000)
struct FLootLockerVariation final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 primary_color;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 secondary_color;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            links;                                             // 0x0038(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerVariation;

// ScriptStruct LootLockerSDK.LootLockerFile
// 0x0020 (0x0020 - 0x0000)
struct FLootLockerFile final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Tags;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerFile;

// ScriptStruct LootLockerSDK.LootLockerAssetCandidate
// 0x0018 (0x0018 - 0x0000)
struct FLootLockerAssetCandidate final
{
public:
	int32                                         created_by_player_id;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 created_by_player_uid;                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerAssetCandidate;

// ScriptStruct LootLockerSDK.LootLockerAsset
// 0x0298 (0x02A8 - 0x0010)
struct FLootLockerAsset final : public FLootLockerHasKeyValueStorage
{
public:
	int32                                         ID;                                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UUID;                                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ulid;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Active;                                            // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          purchasable;                                       // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Type;                                              // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         price;                                             // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 sales_price;                                       // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 display_price;                                     // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Context;                                           // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         context_id;                                        // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 unlocks_context;                                   // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          detachable;                                        // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 updated;                                           // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 marked_new;                                        // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         default_variation_id;                              // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Description;                                       // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            links;                                             // 0x00F0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLootLockerRarity                      rarity;                                            // 0x0140(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          popular;                                           // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         popularity_score;                                  // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          unique_instance;                                   // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLootLockerRentalOption>        rental_options;                                    // 0x0180(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerFilter>              filters;                                           // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerVariation>           variations;                                        // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          featured;                                          // 0x01B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          context_locked;                                    // 0x01B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          initially_purchasable;                             // 0x01B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B3[0x5];                                      // 0x01B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLootLockerFile>                files;                                             // 0x01B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FLootLockerAssetCandidate              asset_candidate;                                   // 0x01C8(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class FString>                         data_entities;                                     // 0x01E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 character_classes;                                 // 0x01F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 shop_thumbnail;                                    // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, bool>                     default_loadouts;                                  // 0x0210(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLootLockerExternalIdentifiers         external_identifiers;                              // 0x0260(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 drop_table_max_picks;                              // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerAsset;

// ScriptStruct LootLockerSDK.LootLockerCollectableReward
// 0x02B0 (0x02B0 - 0x0000)
struct FLootLockerCollectableReward final
{
public:
	struct FLootLockerAsset                       Asset;                                             // 0x0000(0x02A8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         asset_variation_id;                                // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         asset_rental_option_id;                            // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerCollectableReward;

// ScriptStruct LootLockerSDK.LootLockerCollectableItem
// 0x0030 (0x0030 - 0x0000)
struct FLootLockerCollectableItem final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          collected;                                         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLootLockerCollectableReward>   rewards;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          grants_all_rewards;                                // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          just_collected;                                    // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerCollectableItem;

// ScriptStruct LootLockerSDK.LootLockerCollectableItemGroup
// 0x0040 (0x0040 - 0x0000)
struct FLootLockerCollectableItemGroup final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         completion_percentage;                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLootLockerCollectableItem>     Items;                                             // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerCollectableReward>   rewards;                                           // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          grants_all_rewards;                                // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerCollectableItemGroup;

// ScriptStruct LootLockerSDK.LootLockerLoginRequest
// 0x0020 (0x0020 - 0x0000)
struct FLootLockerLoginRequest
{
public:
	class FString                                 email;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Password;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerLoginRequest;

// ScriptStruct LootLockerSDK.LootLockerCharacter
// 0x0030 (0x0030 - 0x0000)
struct FLootLockerCharacter final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Type;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ulid;                                              // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          is_default;                                        // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerCharacter;

// ScriptStruct LootLockerSDK.LootLockerAssetInstanceStorageItemsResponse
// 0x0010 (0x0080 - 0x0070)
struct FLootLockerAssetInstanceStorageItemsResponse final : public FLootLockerResponse
{
public:
	TArray<struct FLootLockerAssetInstanceStorageResponseItem> storage;                              // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerAssetInstanceStorageItemsResponse;

// ScriptStruct LootLockerSDK.LootLockerAssetInstanceStorageItemResponse
// 0x0028 (0x0098 - 0x0070)
struct FLootLockerAssetInstanceStorageItemResponse final : public FLootLockerResponse
{
public:
	struct FLootLockerAssetInstanceStorageResponseItem storage;                                      // 0x0070(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerAssetInstanceStorageItemResponse;

// ScriptStruct LootLockerSDK.LootLockerAssetInstanceStorageItems
// 0x0010 (0x0010 - 0x0000)
struct FLootLockerAssetInstanceStorageItems final
{
public:
	TArray<struct FLootLockerAssetInstanceStorageItem> storage;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerAssetInstanceStorageItems;

// ScriptStruct LootLockerSDK.LootLockerDenomination
// 0x0048 (0x0048 - 0x0000)
struct FLootLockerDenomination final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Currency;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 created_at;                                        // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerDenomination;

// ScriptStruct LootLockerSDK.LootLockerLootBoxItem
// 0x0010 (0x0010 - 0x0000)
struct FLootLockerLootBoxItem final
{
public:
	int32                                         asset_id;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         asset_variation_id;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         asset_rental_option_id;                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         weight;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerLootBoxItem;

// ScriptStruct LootLockerSDK.LootLockerLootBoxContentResponse
// 0x0010 (0x0080 - 0x0070)
struct FLootLockerLootBoxContentResponse final : public FLootLockerResponse
{
public:
	TArray<struct FLootLockerLootBoxItem>         contents;                                          // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerLootBoxContentResponse;

// ScriptStruct LootLockerSDK.LootLockerBalance
// 0x0088 (0x0088 - 0x0000)
struct FLootLockerBalance final
{
public:
	class FString                                 Amount;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLootLockerCurrency                    Currency;                                          // 0x0010(0x0058)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 Wallet_id;                                         // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 created_at;                                        // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerBalance;

// ScriptStruct LootLockerSDK.LootLockerOpenLootBoxResponse
// 0x0008 (0x0078 - 0x0070)
struct FLootLockerOpenLootBoxResponse final : public FLootLockerResponse
{
public:
	bool                                          check_grant_notifications;                         // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerOpenLootBoxResponse;

// ScriptStruct LootLockerSDK.LootLockerGetWalletResponse
// 0x0028 (0x0098 - 0x0070)
struct FLootLockerGetWalletResponse final : public FLootLockerResponse
{
public:
	class FString                                 Holder_id;                                         // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELootLockerWalletHolderTypes                  Type;                                              // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerGetWalletResponse;

// ScriptStruct LootLockerSDK.LootLockerEndPoints
// 0x0018 (0x0018 - 0x0000)
struct FLootLockerEndPoints final
{
public:
	class FString                                 endpoint;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELootLockerHTTPMethod                         requestMethod;                                     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerEndPoints;

// ScriptStruct LootLockerSDK.LootLockerDeleteAssetInstanceResponse
// 0x0000 (0x0070 - 0x0070)
struct FLootLockerDeleteAssetInstanceResponse final : public FLootLockerResponse
{
};
DUMPER7_ASSERTS_FLootLockerDeleteAssetInstanceResponse;

// ScriptStruct LootLockerSDK.LootLockerPersistentStorageItemsResponse
// 0x0060 (0x00D0 - 0x0070)
struct FLootLockerPersistentStorageItemsResponse final : public FLootLockerResponse
{
public:
	TArray<struct FLootLockerPersistentStorageItem> Payload;                                         // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x50];                                      // 0x0080(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerPersistentStorageItemsResponse;

// ScriptStruct LootLockerSDK.LootLockerCreditWalletResponse
// 0x0088 (0x00F8 - 0x0070)
struct FLootLockerCreditWalletResponse final : public FLootLockerResponse
{
public:
	class FString                                 Amount;                                            // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLootLockerCurrency                    Currency;                                          // 0x0080(0x0058)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 Wallet_id;                                         // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 created_at;                                        // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerCreditWalletResponse;

// ScriptStruct LootLockerSDK.LootLockerConnectGoogleProviderToAccountRequest
// 0x0010 (0x0010 - 0x0000)
struct FLootLockerConnectGoogleProviderToAccountRequest final
{
public:
	class FString                                 id_token;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerConnectGoogleProviderToAccountRequest;

// ScriptStruct LootLockerSDK.LootLockerDebitWalletResponse
// 0x0088 (0x00F8 - 0x0070)
struct FLootLockerDebitWalletResponse final : public FLootLockerResponse
{
public:
	class FString                                 Amount;                                            // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLootLockerCurrency                    Currency;                                          // 0x0080(0x0058)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 Wallet_id;                                         // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 created_at;                                        // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerDebitWalletResponse;

// ScriptStruct LootLockerSDK.LootLockerPersistentStorageItemResponse
// 0x0028 (0x0098 - 0x0070)
struct FLootLockerPersistentStorageItemResponse final : public FLootLockerResponse
{
public:
	struct FLootLockerPersistentStorageItem       Payload;                                           // 0x0070(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerPersistentStorageItemResponse;

// ScriptStruct LootLockerSDK.LootLockerCreateWalletResponse
// 0x0010 (0x0080 - 0x0070)
struct FLootLockerCreateWalletResponse final : public FLootLockerResponse
{
public:
	class FString                                 Wallet_id;                                         // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerCreateWalletResponse;

// ScriptStruct LootLockerSDK.LootLockerContext
// 0x0040 (0x0040 - 0x0000)
struct FLootLockerContext final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UUID;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 friendly_name;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          detachable;                                        // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          user_facing;                                       // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         dependent_asset_id;                                // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerContext;

// ScriptStruct LootLockerSDK.LootLockerGetContextResponse
// 0x0010 (0x0080 - 0x0070)
struct FLootLockerGetContextResponse final : public FLootLockerResponse
{
public:
	TArray<struct FLootLockerContext>             contexts;                                          // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerGetContextResponse;

// ScriptStruct LootLockerSDK.LootLockerIndexBasedPagination
// 0x000C (0x000C - 0x0000)
struct FLootLockerIndexBasedPagination final
{
public:
	int32                                         Total;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Next_Cursor;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Previous_Cursor;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerIndexBasedPagination;

// ScriptStruct LootLockerSDK.LootLockerProgressionPointsReward
// 0x0028 (0x0028 - 0x0000)
struct FLootLockerProgressionPointsReward final
{
public:
	class FString                                 Progression_Key;                                   // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Progression_Name;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerProgressionPointsReward;

// ScriptStruct LootLockerSDK.LootLockerProgressionResetReward
// 0x0030 (0x0030 - 0x0000)
struct FLootLockerProgressionResetReward final
{
public:
	class FString                                 progression_id;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Progression_Key;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Progression_Name;                                  // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerProgressionResetReward;

// ScriptStruct LootLockerSDK.LootLockerAssetReward
// 0x000C (0x000C - 0x0000)
struct FLootLockerAssetReward final
{
public:
	int32                                         asset_id;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         asset_variation_id;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         asset_rental_option_id;                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerAssetReward;

// ScriptStruct LootLockerSDK.LootLockerCurrencyReward
// 0x0030 (0x0030 - 0x0000)
struct FLootLockerCurrencyReward final
{
public:
	class FString                                 Currency_name;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Currency_code;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Amount;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerCurrencyReward;

// ScriptStruct LootLockerSDK.LootLockerRewards
// 0x0040 (0x0040 - 0x0000)
struct FLootLockerRewards final
{
public:
	TArray<struct FLootLockerProgressionPointsReward> Progression_Points_Rewards;                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerProgressionResetReward> Progression_Reset_Rewards;                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerAssetReward>         Asset_Rewards;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerCurrencyReward>      Currency_Rewards;                                  // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerRewards;

// ScriptStruct LootLockerSDK.LootLockerProgressionTier
