#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LootLockerSDK

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum LootLockerSDK.ELootLockerAccountProvider
// NumValues: 0x000C
enum class ELootLockerAccountProvider : uint8
{
	Guest                                    = 0,
	Google                                   = 1,
	Apple                                    = 2,
	Steam                                    = 3,
	Epic_games                               = 4,
	Credentials                              = 5,
	Nintendo                                 = 6,
	Xbox                                     = 7,
	Playstation                              = 8,
	Twitch                                   = 9,
	Discord                                  = 10,
	ELootLockerAccountProvider_MAX           = 11,
};

// Enum LootLockerSDK.ELootLockerRemoteSessionLeaseIntent
// NumValues: 0x0003
enum class ELootLockerRemoteSessionLeaseIntent : uint8
{
	login                                    = 0,
	link                                     = 1,
	ELootLockerRemoteSessionLeaseIntent_MAX  = 2,
};

// Enum LootLockerSDK.ELootLockerRemoteSessionLeaseStatus
// NumValues: 0x0008
enum class ELootLockerRemoteSessionLeaseStatus : uint8
{
	Created                                  = 0,
	Claimed                                  = 1,
	Verified                                 = 2,
	Authorized                               = 3,
	Cancelled                                = 4,
	Timed_out                                = 5,
	Failed                                   = 6,
	ELootLockerRemoteSessionLeaseStatus_MAX  = 7,
};

// Enum LootLockerSDK.ELootLockerMetadataTypes
// NumValues: 0x0006
enum class ELootLockerMetadataTypes : uint8
{
	String                                   = 0,
	Number                                   = 1,
	Bool                                     = 2,
	Json                                     = 3,
	Base64                                   = 4,
	ELootLockerMetadataTypes_MAX             = 5,
};

// Enum LootLockerSDK.ELootLockerAssetFilePurpose
// NumValues: 0x0004
enum class ELootLockerAssetFilePurpose : uint8
{
	PRIMARY_THUMBNAIL                        = 0,
	THUMBNAIL                                = 1,
	FILE                                     = 2,
	ELootLockerAssetFilePurpose_MAX          = 3,
};

// Enum LootLockerSDK.ELootLockerSteamPurchaseRedemptionStatus
// NumValues: 0x000A
enum class ELootLockerSteamPurchaseRedemptionStatus : uint8
{
	Init                                     = 0,
	Approved                                 = 1,
	Succeeded                                = 2,
	Failed                                   = 3,
	Refunded                                 = 4,
	PartialRefund                            = 5,
	ChargedBack                              = 6,
	RefundedSuspectedFraud                   = 7,
	RefundedFriendlyFraud                    = 8,
	ELootLockerSteamPurchaseRedemptionStatus_MAX = 9,
};

// Enum LootLockerSDK.ELootLockerTriggerFailureReasons
// NumValues: 0x0004
enum class ELootLockerTriggerFailureReasons : uint8
{
	Trigger_limit_reached                    = 0,
	Key_not_found                            = 1,
	Reward_not_found                         = 2,
	ELootLockerTriggerFailureReasons_MAX     = 3,
};

// Enum LootLockerSDK.ELootLockerNotificationContentBodyType
// NumValues: 0x0010
enum class ELootLockerNotificationContentBodyType : uint8
{
	none                                     = 0,
	null                                     = 1,
	reward                                   = 2,
	json_string                              = 3,
	json_integer                             = 4,
	json_decimal                             = 5,
	json_bool                                = 6,
	json_object                              = 7,
	json_array                               = 8,
	json_array_string                        = 9,
	json_array_integer                       = 10,
	json_array_decimal                       = 11,
	json_array_bool                          = 12,
	json_array_object                        = 13,
	unknown                                  = 14,
	ELootLockerNotificationContentBodyType_MAX = 15,
};

// Enum LootLockerSDK.ELootLockerNotificationSource
// NumValues: 0x000A
enum class ELootLockerNotificationSource : uint8
{
	triggers                                 = 0,
	purchasing_steam_store                   = 1,
	purchasing_apple_app_store               = 2,
	purchasing_google_play_store             = 3,
	purchasing_lootlocker_store              = 4,
	twitch_drop                              = 5,
	lootlocker_console                       = 6,
	lootlocker_server_api                    = 7,
	lootlocker_admin_api                     = 8,
	ELootLockerNotificationSource_MAX        = 9,
};

// Enum LootLockerSDK.ELootLockerNotificationPriority
// NumValues: 0x0005
enum class ELootLockerNotificationPriority : uint8
{
	low                                      = 0,
	medium                                   = 1,
	high                                     = 2,
	emergency                                = 3,
	ELootLockerNotificationPriority_MAX      = 4,
};

// Enum LootLockerSDK.ELootLockerLeaderboardRewardEntityKind
// NumValues: 0x0006
enum class ELootLockerLeaderboardRewardEntityKind : uint8
{
	Asset                                    = 0,
	Currency                                 = 1,
	Progression_Points                       = 2,
	Progression_Reset                        = 3,
	Group                                    = 4,
	ELootLockerLeaderboardRewardEntityKind_MAX = 5,
};

// Enum LootLockerSDK.ELootLockerWalletHolderTypes
// NumValues: 0x0003
enum class ELootLockerWalletHolderTypes : uint8
{
	character                                = 0,
	player                                   = 1,
	ELootLockerWalletHolderTypes_MAX         = 2,
};

// Enum LootLockerSDK.ELootLockerCatalogEntryEntityKind
// NumValues: 0x0006
enum class ELootLockerCatalogEntryEntityKind : uint8
{
	Asset                                    = 0,
	Currency                                 = 1,
	Progression_Points                       = 2,
	Progression_Reset                        = 3,
	Group                                    = 4,
	ELootLockerCatalogEntryEntityKind_MAX    = 5,
};

// Enum LootLockerSDK.ELootLockerEntitlementHistoryListingType
// NumValues: 0x0005
enum class ELootLockerEntitlementHistoryListingType : uint8
{
	Undefined                                = 0,
	One_time_purchase                        = 1,
	Leaderboard_reward                       = 2,
	Subscription                             = 3,
	ELootLockerEntitlementHistoryListingType_MAX = 4,
};

// Enum LootLockerSDK.ELootLockerEntitlementHistoryListingStore
// NumValues: 0x0008
enum class ELootLockerEntitlementHistoryListingStore : uint8
{
	None                                     = 0,
	Apple_app_store                          = 1,
	Google_play_store                        = 2,
	Steam_store                              = 3,
	Playstation_network                      = 4,
	Nintendo_eshop                           = 5,
	Lootlocker                               = 6,
	ELootLockerEntitlementHistoryListingStore_MAX = 7,
};

// Enum LootLockerSDK.ELootLockerEntitlementHistoryListingStatus
// NumValues: 0x0007
enum class ELootLockerEntitlementHistoryListingStatus : uint8
{
	None                                     = 0,
	Active                                   = 1,
	Pending                                  = 2,
	Expired                                  = 3,
	Canceled                                 = 4,
	Refunded                                 = 5,
	ELootLockerEntitlementHistoryListingStatus_MAX = 6,
};

// Enum LootLockerSDK.ELootLockerFeedbackType
// NumValues: 0x0004
enum class ELootLockerFeedbackType : uint8
{
	Player                                   = 0,
	Game                                     = 1,
	Ugc                                      = 2,
	ELootLockerFeedbackType_MAX              = 3,
};

// Enum LootLockerSDK.ELootLockerMetadataSources
// NumValues: 0x0009
enum class ELootLockerMetadataSources : uint8
{
	reward                                   = 0,
	leaderboard                              = 1,
	catalog_item                             = 2,
	progression                              = 3,
	currency                                 = 4,
	player                                   = 5,
	self                                     = 6,
	asset                                    = 7,
	ELootLockerMetadataSources_MAX           = 8,
};

// Enum LootLockerSDK.ELootLockerMetadataActions
// NumValues: 0x0006
enum class ELootLockerMetadataActions : uint8
{
	Create                                   = 0,
	Update                                   = 1,
	Delete                                   = 2,
	Create_or_Update                         = 3,
	Upsert                                   = 4,
	ELootLockerMetadataActions_MAX           = 5,
};

// Enum LootLockerSDK.ELootLockerOrderAssetListDirection
// NumValues: 0x0004
enum class ELootLockerOrderAssetListDirection : uint8
{
	None                                     = 0,
	Asc                                      = 1,
	Desc                                     = 2,
	ELootLockerOrderAssetListDirection_MAX   = 3,
};

// Enum LootLockerSDK.ELootLockerOrderAssetListBy
// NumValues: 0x0006
enum class ELootLockerOrderAssetListBy : uint8
{
	None                                     = 0,
	Id                                       = 1,
	Name                                     = 2,
	Created_at                               = 3,
	Updated_at                               = 4,
	ELootLockerOrderAssetListBy_MAX          = 5,
};

// Enum LootLockerSDK.ELootLockerAssetFilter
// NumValues: 0x0008
enum class ELootLockerAssetFilter : uint8
{
	None                                     = 0,
	Purchasable                              = 1,
	NonPurchasable                           = 2,
	Rentable                                 = 3,
	NonRentable                              = 4,
	Popular                                  = 5,
	UnPopular                                = 6,
	ELootLockerAssetFilter_MAX               = 7,
};

// Enum LootLockerSDK.ELootLockerGoogleClientPlatform
// NumValues: 0x0005
enum class ELootLockerGoogleClientPlatform : uint8
{
	Web                                      = 0,
	Android                                  = 1,
	Ios                                      = 2,
	Desktop                                  = 3,
	ELootLockerGoogleClientPlatform_MAX      = 4,
};

// Enum LootLockerSDK.EGoogleAccountProviderPlatform
// NumValues: 0x0005
enum class EGoogleAccountProviderPlatform : uint8
{
	web                                      = 0,
	android                                  = 1,
	ios                                      = 2,
	desktop                                  = 4,
	EGoogleAccountProviderPlatform_MAX       = 5,
};

// Enum LootLockerSDK.ELootLockerApiType
// NumValues: 0x0004
enum class ELootLockerApiType : uint8
{
	LL_GAME                                  = 0,
	LL_WHITELABEL                            = 1,
	LL_WEBSOCKET                             = 2,
	LL_MAX                                   = 3,
};

// Enum LootLockerSDK.ELootLockerHTTPMethod
// NumValues: 0x000A
enum class ELootLockerHTTPMethod : uint8
{
	GET                                      = 0,
	POST                                     = 1,
	DELETE_0                                 = 2,
	PUT                                      = 3,
	HEAD                                     = 4,
	CREATE                                   = 5,
	OPTIONS                                  = 6,
	PATCH                                    = 7,
	UPLOAD                                   = 8,
	ELootLockerHTTPMethod_MAX                = 9,
};

// Enum LootLockerSDK.ELootLockerLogLevel
// NumValues: 0x0009
enum class ELootLockerLogLevel : uint8
{
	NoLogging                                = 0,
	Fatal                                    = 1,
	Error                                    = 2,
	Warning                                  = 3,
	Display                                  = 4,
	Log                                      = 5,
	Verbose                                  = 6,
	VeryVerbose                              = 7,
	ELootLockerLogLevel_MAX                  = 8,
};

// Enum LootLockerSDK.ELootLockerMetadataParserOutputTypes
// NumValues: 0x0009
enum class ELootLockerMetadataParserOutputTypes : uint8
{
	OnString                                 = 0,
	OnInteger                                = 1,
	OnFloat                                  = 2,
	OnNumber                                 = 3,
	OnBool                                   = 4,
	OnJson                                   = 5,
	OnBase64                                 = 6,
	OnError                                  = 7,
	ELootLockerMetadataParserOutputTypes_MAX = 8,
};

// Enum LootLockerSDK.ELootLockerCustomNotificationFiltering
// NumValues: 0x0004
enum class ELootLockerCustomNotificationFiltering : uint8
{
	All                                      = 0,
	Custom_only                              = 1,
	LootLocker_only                          = 2,
	ELootLockerCustomNotificationFiltering_MAX = 3,
};

// Enum LootLockerSDK.ELootLockerNotificationContentRewardKind
// NumValues: 0x0006
enum class ELootLockerNotificationContentRewardKind : uint8
{
	group                                    = 0,
	currency                                 = 1,
	asset                                    = 2,
	progression_reset                        = 3,
	progression_points                       = 4,
	ELootLockerNotificationContentRewardKind_MAX = 5,
};

// Enum LootLockerSDK.ELootLockerPlatform
// NumValues: 0x0014
enum class ELootLockerPlatform : uint8
{
	None                                     = 0,
	Guest                                    = 1,
	WhiteLabel                               = 2,
	Steam                                    = 3,
	PlayStationNetwork                       = 4,
	Xbox                                     = 5,
	NintendoSwitch                           = 6,
	AmazonLuna                               = 7,
	AppleSignIn                              = 8,
	Android                                  = 9,
	Google                                   = 10,
	Epic                                     = 11,
	AppleGameCenter                          = 12,
	Meta                                     = 13,
	Remote                                   = 14,
	Server                                   = 15,
	GooglePlayGames                          = 16,
	Discord                                  = 17,
	LastValue                                = 18,
	ELootLockerPlatform_MAX                  = 19,
};

// Enum LootLockerSDK.ELootLockerPlayerDataLookupIdType
// NumValues: 0x000B
enum class ELootLockerPlayerDataLookupIdType : uint8
{
	Player_id                                = 0,
	Player_public_uid                        = 1,
	Player_guest_login_id                    = 2,
	Steam_id                                 = 3,
	Psn_id                                   = 4,
	Xbox_id                                  = 5,
	Player_ulid                              = 6,
	Player_name                              = 7,
	Epic_games_id                            = 8,
	Google_play_games_id                     = 9,
	ELootLockerPlayerDataLookupIdType_MAX    = 10,
};

// Enum LootLockerSDK.ELootLockerPresenceConnectionState
// NumValues: 0x000A
enum class ELootLockerPresenceConnectionState : uint8
{
	Disconnected                             = 0,
	Initializing                             = 1,
	Connecting                               = 2,
	Connected                                = 3,
	Authenticating                           = 4,
	Active                                   = 5,
	Reconnecting                             = 6,
	Failed                                   = 7,
	Destroyed                                = 8,
	ELootLockerPresenceConnectionState_MAX   = 9,
};

// ScriptStruct LootLockerSDK.LootLockerRarity
// 0x0030 (0x0030 - 0x0000)
struct FLootLockerRarity final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 short_name;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Color;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerRarity;

// ScriptStruct LootLockerSDK.LootLockerRentalOption
// 0x0080 (0x0080 - 0x0000)
struct FLootLockerRentalOption final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Duration;                                          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         price;                                             // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 sales_price;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            links;                                             // 0x0030(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerRentalOption;

// ScriptStruct LootLockerSDK.LootLockerPsn
// 0x0018 (0x0018 - 0x0000)
struct FLootLockerPsn final
{
public:
	class FString                                 entitlement_id;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         service_label;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerPsn;

// ScriptStruct LootLockerSDK.LootLockerApple
// 0x0010 (0x0010 - 0x0000)
struct FLootLockerApple final
{
public:
	class FString                                 product_id;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerApple;

// ScriptStruct LootLockerSDK.LootLockerGoogle
// 0x0010 (0x0010 - 0x0000)
struct FLootLockerGoogle final
{
public:
	class FString                                 product_id;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerGoogle;

// ScriptStruct LootLockerSDK.LootLockerExternalIdentifiers
// 0x0038 (0x0038 - 0x0000)
struct FLootLockerExternalIdentifiers final
{
public:
	struct FLootLockerPsn                         psn;                                               // 0x0000(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLootLockerApple                       apple_app_store;                                   // 0x0018(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLootLockerGoogle                      google_play;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerExternalIdentifiers;

// ScriptStruct LootLockerSDK.LootLockerFilter
// 0x0020 (0x0020 - 0x0000)
struct FLootLockerFilter final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerFilter;

// ScriptStruct LootLockerSDK.LootLockerVariation
// 0x0088 (0x0088 - 0x0000)
struct FLootLockerVariation final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 primary_color;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 secondary_color;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            links;                                             // 0x0038(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerVariation;

// ScriptStruct LootLockerSDK.LootLockerPersistentStorageItem
// 0x0028 (0x0028 - 0x0000)
struct FLootLockerPersistentStorageItem final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          is_public;                                         // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         order;                                             // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerPersistentStorageItem;

// ScriptStruct LootLockerSDK.LootLockerHasKeyValueStorage
// 0x0010 (0x0010 - 0x0000)
struct FLootLockerHasKeyValueStorage
{
public:
	TArray<struct FLootLockerPersistentStorageItem> storage;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerHasKeyValueStorage;

// ScriptStruct LootLockerSDK.LootLockerFile
// 0x0020 (0x0020 - 0x0000)
struct FLootLockerFile final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Tags;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerFile;

// ScriptStruct LootLockerSDK.LootLockerAssetCandidate
// 0x0018 (0x0018 - 0x0000)
struct FLootLockerAssetCandidate final
{
public:
	int32                                         created_by_player_id;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 created_by_player_uid;                             // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerAssetCandidate;

// ScriptStruct LootLockerSDK.LootLockerAsset
// 0x0298 (0x02A8 - 0x0010)
struct FLootLockerAsset final : public FLootLockerHasKeyValueStorage
{
public:
	int32                                         ID;                                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UUID;                                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ulid;                                              // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Active;                                            // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          purchasable;                                       // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Type;                                              // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         price;                                             // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 sales_price;                                       // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 display_price;                                     // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Context;                                           // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         context_id;                                        // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 unlocks_context;                                   // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          detachable;                                        // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 updated;                                           // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 marked_new;                                        // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         default_variation_id;                              // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Description;                                       // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            links;                                             // 0x00F0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLootLockerRarity                      rarity;                                            // 0x0140(0x0030)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          popular;                                           // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         popularity_score;                                  // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          unique_instance;                                   // 0x0178(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLootLockerRentalOption>        rental_options;                                    // 0x0180(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerFilter>              filters;                                           // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerVariation>           variations;                                        // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          featured;                                          // 0x01B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          context_locked;                                    // 0x01B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          initially_purchasable;                             // 0x01B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B3[0x5];                                      // 0x01B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLootLockerFile>                files;                                             // 0x01B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FLootLockerAssetCandidate              asset_candidate;                                   // 0x01C8(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class FString>                         data_entities;                                     // 0x01E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 character_classes;                                 // 0x01F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 shop_thumbnail;                                    // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, bool>                     default_loadouts;                                  // 0x0210(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLootLockerExternalIdentifiers         external_identifiers;                              // 0x0260(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 drop_table_max_picks;                              // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerAsset;

// ScriptStruct LootLockerSDK.LootLockerDebitRequest
// 0x0030 (0x0030 - 0x0000)
struct FLootLockerDebitRequest final
{
public:
	class FString                                 Amount;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 currency_id;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 wallet_id;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerDebitRequest;

// ScriptStruct LootLockerSDK.LootLockerEntitlementHistoryItem
// 0x0058 (0x0058 - 0x0000)
struct FLootLockerEntitlementHistoryItem final
{
public:
	class FString                                 created_at;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 reward_kind;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 reward_id;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Catalog_id;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerEntitlementHistoryItem;

// ScriptStruct LootLockerSDK.LootLockerEntitlementHistoryReward
// 0x0030 (0x0030 - 0x0000)
struct FLootLockerEntitlementHistoryReward final
{
public:
	class FString                                 created_at;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 entitlement_id;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerEntitlementHistoryReward;

// ScriptStruct LootLockerSDK.LootLockerEntitlementHistoryMetadata
// 0x0020 (0x0020 - 0x0000)
struct FLootLockerEntitlementHistoryMetadata final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerEntitlementHistoryMetadata;

// ScriptStruct LootLockerSDK.LootLockerEntitlementListing
// 0x0058 (0x0058 - 0x0000)
struct FLootLockerEntitlementListing final
{
public:
	class FString                                 created_at;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerEntitlementHistoryItem> Items;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerEntitlementHistoryReward> Rewards;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerEntitlementHistoryMetadata> MetaData;                                   // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	ELootLockerEntitlementHistoryListingStatus    Status;                                            // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELootLockerEntitlementHistoryListingStore     Store;                                             // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELootLockerEntitlementHistoryListingType      Type;                                              // 0x0052(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerEntitlementListing;

// ScriptStruct LootLockerSDK.LootLockerKeyBasedPagination
// 0x0028 (0x0028 - 0x0000)
struct FLootLockerKeyBasedPagination final
{
public:
	int32                                         Total;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Next_Cursor;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Previous_Cursor;                                   // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerKeyBasedPagination;

// ScriptStruct LootLockerSDK.LootLockerErrorData
// 0x0058 (0x0058 - 0x0000)
struct FLootLockerErrorData final
{
public:
	class FString                                 Code;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Doc_url;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Request_id;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Trace_id;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Retry_after_seconds;                               // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Message;                                           // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerErrorData;

// ScriptStruct LootLockerSDK.LootLockerRequestContext
// 0x0060 (0x0060 - 0x0000)
struct FLootLockerRequestContext final
{
public:
	class FString                                 PlayerUlid;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RequestTime;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RequestId;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RequestURL;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RequestMethod;                                     // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RequestParametersJsonString;                       // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerRequestContext;

// ScriptStruct LootLockerSDK.LootLockerResponse
// 0x00D0 (0x00D0 - 0x0000)
struct FLootLockerResponse
{
public:
	bool                                          success;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         StatusCode;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FullTextFromServer;                                // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLootLockerErrorData                   ErrorData;                                         // 0x0018(0x0058)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLootLockerRequestContext              Context;                                           // 0x0070(0x0060)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerResponse;

// ScriptStruct LootLockerSDK.LootLockerEntitlementHistoryResponse
// 0x0038 (0x0108 - 0x00D0)
struct FLootLockerEntitlementHistoryResponse final : public FLootLockerResponse
{
public:
	TArray<struct FLootLockerEntitlementListing>  Listings;                                          // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FLootLockerKeyBasedPagination          Pagination;                                        // 0x00E0(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerEntitlementHistoryResponse;

// ScriptStruct LootLockerSDK.LootLockerCatalogSteamStoreListingPrice
// 0x0018 (0x0018 - 0x0000)
struct FLootLockerCatalogSteamStoreListingPrice final
{
public:
	class FString                                 currency;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerCatalogSteamStoreListingPrice;

// ScriptStruct LootLockerSDK.LootLockerPagination
// 0x0008 (0x0008 - 0x0000)
struct FLootLockerPagination final
{
public:
	int32                                         Total;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Next_Cursor;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerPagination;

// ScriptStruct LootLockerSDK.LootLockerContext
// 0x0048 (0x0048 - 0x0000)
struct FLootLockerContext final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UUID;                                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 friendly_name;                                     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          detachable;                                        // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          user_facing;                                       // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         dependent_asset_id;                                // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         max_equip_count;                                   // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerContext;

// ScriptStruct LootLockerSDK.LootLockerGetContextResponse
// 0x0010 (0x00E0 - 0x00D0)
struct FLootLockerGetContextResponse final : public FLootLockerResponse
{
public:
	TArray<struct FLootLockerContext>             contexts;                                          // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerGetContextResponse;

// ScriptStruct LootLockerSDK.LootLockerFinalizeSteamPurchaseRedemptionRequest
// 0x0010 (0x0010 - 0x0000)
struct FLootLockerFinalizeSteamPurchaseRedemptionRequest final
{
public:
	class FString                                 entitlement_id;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerFinalizeSteamPurchaseRedemptionRequest;

// ScriptStruct LootLockerSDK.LootLockerSimpleAssetFilter
// 0x0020 (0x0020 - 0x0000)
struct FLootLockerSimpleAssetFilter final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         Values;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerSimpleAssetFilter;

// ScriptStruct LootLockerSDK.LootLockerSimpleAssetFilters
// 0x0028 (0x0028 - 0x0000)
struct FLootLockerSimpleAssetFilters final
{
public:
	bool                                          ugc_only;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 asset_ids;                                         // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerSimpleAssetFilter>   asset_filters;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerSimpleAssetFilters;

// ScriptStruct LootLockerSDK.LootLockerLevelThresholds
// 0x0010 (0x0010 - 0x0000)
struct FLootLockerLevelThresholds final
{
public:
	int32                                         Current;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          current_is_prestige;                               // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Next;                                              // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          next_is_prestige;                                  // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FLootLockerLevelThresholds;

// ScriptStruct LootLockerSDK.LootLockerRemoteSessionPlayerData
// 0x0088 (0x0088 - 0x0000)
struct FLootLockerRemoteSessionPlayerData final
{
public:
	class FString                                 player_name;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         player_id;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 public_uid;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 player_ulid;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          seen_before;                                       // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          check_grant_notifications;                         // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          check_deactivation_notifications;                  // 0x003A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         XP;                                                // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLootLockerLevelThresholds             level_thresholds;                                  // 0x0044(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         account_balance;                                   // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 player_identifier;                                 // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 player_created_at;                                 // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 wallet_id;                                         // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerRemoteSessionPlayerData;

// ScriptStruct LootLockerSDK.LootLockerBaseAuthRequest
// 0x0020 (0x0020 - 0x0000)
struct FLootLockerBaseAuthRequest
{
public:
	class FString                                 game_api_key;                                      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 game_version;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerBaseAuthRequest;

// ScriptStruct LootLockerSDK.LootLockerSteamSessionRequest
// 0x0010 (0x0030 - 0x0020)
struct FLootLockerSteamSessionRequest : public FLootLockerBaseAuthRequest
{
public:
	class FString                                 steam_ticket;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLootLockerSteamSessionRequest;

// ScriptStruct LootLockerSDK.LootLockerSteamSessionWithAppIdRequest
// 0x0010 (0x0040 - 0x0030)
