#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LootLockerSDK

#include "Basic.hpp"

#include "LootLockerSDK_structs.hpp"


namespace SDK::Params
{

// Function LootLockerSDK.LootLockerConfig.IsSemverString
// 0x0018 (0x0018 - 0x0000)
struct LootLockerConfig_IsSemverString final
{
public:
	class FString                                 str;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LootLockerConfig_IsSemverString;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.GetIDToken
// 0x0018 (0x0018 - 0x0000)
struct LootLockerGoogleSubsystemHelper_GetIDToken final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_GetIDToken;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.HasGoogleOnlineSubsystem
// 0x0001 (0x0001 - 0x0000)
struct LootLockerGoogleSubsystemHelper_HasGoogleOnlineSubsystem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_HasGoogleOnlineSubsystem;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.HasGooglePlayOnlineSubsystem
// 0x0001 (0x0001 - 0x0000)
struct LootLockerGoogleSubsystemHelper_HasGooglePlayOnlineSubsystem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_HasGooglePlayOnlineSubsystem;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.PurchaseOffer
// 0x0030 (0x0030 - 0x0000)
struct LootLockerGoogleSubsystemHelper_PurchaseOffer final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OfferId;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsConsumable;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool success, int32 LocalUserNumber, const class FString& ErrorMsg, const class FString& ReceiptOfferID, const class FString& ReceiptPurchaseToken)> Callback; // 0x001C(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_PurchaseOffer;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.ReadOfferInformation
// 0x0028 (0x0028 - 0x0000)
struct LootLockerGoogleSubsystemHelper_ReadOfferInformation final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OfferId;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool success, int32 LocalUserNumber, const class FString& ErrorMsg, const struct FLootLockerGoogleSubsystemStoreOffer& OfferInformation)> Callback; // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_ReadOfferInformation;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.SignInWithGoogle
// 0x0014 (0x0014 - 0x0000)
struct LootLockerGoogleSubsystemHelper_SignInWithGoogle final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool success, int32 LocalUserNumber, const class FString& ErrorMsg, const class FString& IDToken)> Callback; // 0x0004(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_SignInWithGoogle;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.SignInWithGooglePlay
// 0x0014 (0x0014 - 0x0000)
struct LootLockerGoogleSubsystemHelper_SignInWithGooglePlay final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool success, int32 LocalUserNumber, const class FString& ErrorMsg)> Callback;    // 0x0004(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_SignInWithGooglePlay;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.SignOutWithGoogle
// 0x0014 (0x0014 - 0x0000)
struct LootLockerGoogleSubsystemHelper_SignOutWithGoogle final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool success, int32 LocalUserNumber, const class FString& ErrorMsg)> Callback;    // 0x0004(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_SignOutWithGoogle;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.SignOutWithGooglePlay
// 0x0014 (0x0014 - 0x0000)
struct LootLockerGoogleSubsystemHelper_SignOutWithGooglePlay final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool success, int32 LocalUserNumber, const class FString& ErrorMsg)> Callback;    // 0x0004(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_SignOutWithGooglePlay;

// Function LootLockerSDK.LootLockerManager.ActivateRentalAsset
// 0x0014 (0x0014 - 0x0000)
struct LootLockerManager_ActivateRentalAsset final
{
public:
	int32                                         AssetInstanceId;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerActivateRentalAssetResponse& Response)> OnActivateRentalAssetCompleted; // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ActivateRentalAsset;

// Function LootLockerSDK.LootLockerManager.AddAssetToFavourites
// 0x0014 (0x0014 - 0x0000)
struct LootLockerManager_AddAssetToFavourites final
{
public:
	int32                                         AssetId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerGetFavouriteAssetIndicesResponse& FavouriteAssetIndicesResponse)> OnAddAssetToFavouritesRequestCompleted; // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddAssetToFavourites;

// Function LootLockerSDK.LootLockerManager.AddAssetToHeroLoadout
// 0x0018 (0x0018 - 0x0000)
struct LootLockerManager_AddAssetToHeroLoadout final
{
public:
	int32                                         HeroID;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetInstanceId;                                   // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerHeroLoadoutResponse& Response)> OnCompleteBP;             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddAssetToHeroLoadout;

// Function LootLockerSDK.LootLockerManager.AddFileToAssetCandidate
// 0x0030 (0x0030 - 0x0000)
struct LootLockerManager_AddFileToAssetCandidate final
{
public:
	int32                                         AssetCandidateId;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELootLockerAssetFilePurpose                   FilePurpose;                                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FLootLockerResponse& Response)> OnAddFileToAssetCandidateCompleted;  // 0x001C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LootLockerManager_AddFileToAssetCandidate;

// Function LootLockerSDK.LootLockerManager.AddGlobalAssetToHeroLoadout
// 0x0018 (0x0018 - 0x0000)
struct LootLockerManager_AddGlobalAssetToHeroLoadout final
{
public:
	int32                                         HeroID;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetId;                                           // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerHeroLoadoutResponse& Response)> OnCompleteBP;             // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddGlobalAssetToHeroLoadout;

// Function LootLockerSDK.LootLockerManager.AddGlobalAssetVariationToHeroLoadout
// 0x001C (0x001C - 0x0000)
struct LootLockerManager_AddGlobalAssetVariationToHeroLoadout final
{
public:
	int32                                         HeroID;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetId;                                           // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetVariationID;                                  // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerHeroLoadoutResponse& Response)> OnCompleteBP;             // 0x000C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddGlobalAssetVariationToHeroLoadout;

// Function LootLockerSDK.LootLockerManager.AddItemsToPersistentStorage
// 0x0020 (0x0020 - 0x0000)
struct LootLockerManager_AddItemsToPersistentStorage final
{
public:
	struct FLootLockerPersistentStorageItems      Items;                                             // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerPersistentStorageItemsResponse& Response)> OnPersistentStorageItemsAddRequestCompleted; // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddItemsToPersistentStorage;

// Function LootLockerSDK.LootLockerManager.AddItemToPersistentStorage
// 0x0038 (0x0038 - 0x0000)
struct LootLockerManager_AddItemToPersistentStorage final
{
public:
	struct FLootLockerPersistentStorageItem       Item;                                              // 0x0000(0x0028)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerPersistentStorageItemResponse& Response)> OnPersistentStorageItemAddRequestCompleted; // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddItemToPersistentStorage;

// Function LootLockerSDK.LootLockerManager.AddPointsToCharacterProgression
// 0x0030 (0x0030 - 0x0000)
struct LootLockerManager_AddPointsToCharacterProgression final
{
public:
	int32                                         CharacterId;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProgressionKey;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0018(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerCharacterProgressionWithRewardsResponse& Response)> OnCompletedRequest; // 0x001C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LootLockerManager_AddPointsToCharacterProgression;

// Function LootLockerSDK.LootLockerManager.AddPointsToInstanceProgression
// 0x0030 (0x0030 - 0x0000)
struct LootLockerManager_AddPointsToInstanceProgression final
{
public:
	int32                                         AssetInstanceId;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProgressionKey;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerInstanceProgressionWithRewardsResponse& Response)> OnCompletedRequestBP; // 0x001C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LootLockerManager_AddPointsToInstanceProgression;

// Function LootLockerSDK.LootLockerManager.AddPointsToPlayerProgression
// 0x0028 (0x0028 - 0x0000)
struct LootLockerManager_AddPointsToPlayerProgression final
{
public:
	class FString                                 ProgressionKey;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0010(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerPlayerProgressionWithRewardsResponse& Response)> OnCompletedRequest; // 0x0014(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LootLockerManager_AddPointsToPlayerProgression;

// Function LootLockerSDK.LootLockerManager.BeginSteamPurchaseRedemption
// 0x0050 (0x0050 - 0x0000)
struct LootLockerManager_BeginSteamPurchaseRedemption final
{
public:
	class FString                                 steamID;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Currency;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CatalogItemId;                                     // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerBeginSteamPurchaseRedemptionResponse& Response)> OnCompletedRequest; // 0x0040(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_BeginSteamPurchaseRedemption;

// Function LootLockerSDK.LootLockerManager.BeginSteamPurchaseRedemptionForClass
// 0x0058 (0x0058 - 0x0000)
struct LootLockerManager_BeginSteamPurchaseRedemptionForClass final
{
public:
	int32                                         ClassId;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 steamID;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Currency;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CatalogItemId;                                     // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerBeginSteamPurchaseRedemptionResponse& Response)> OnCompletedRequest; // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_BeginSteamPurchaseRedemptionForClass;

// Function LootLockerSDK.LootLockerManager.CancelRemoteSessionProcess
// 0x0010 (0x0010 - 0x0000)
struct LootLockerManager_CancelRemoteSessionProcess final
{
public:
	class FString                                 ProcessId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CancelRemoteSessionProcess;

// Function LootLockerSDK.LootLockerManager.CheckPlayerAssetActivationNotification
// 0x0010 (0x0010 - 0x0000)
struct LootLockerManager_CheckPlayerAssetActivationNotification final
{
public:
	TDelegate<void(const struct FLootLockerPlayerAssetNotificationResponse& Value)> OnCheckPlayerAssetDeactivationNotificationRequestCompleted; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CheckPlayerAssetActivationNotification;

// Function LootLockerSDK.LootLockerManager.CollectItem
// 0x0020 (0x0020 - 0x0000)
struct LootLockerManager_CollectItem final
{
public:
	struct FLootLockerCollectItemPayload          Item;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerCollectablesResponse& Response)> OnCollectItemCompleted;  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CollectItem;

// Function LootLockerSDK.LootLockerManager.ComputeAndLockDropTable
// 0x0014 (0x0014 - 0x0000)
struct LootLockerManager_ComputeAndLockDropTable final
{
public:
	int32                                         TableId;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerComputeAndLockDropTableResponse& Response)> OnCompletedRequestBP; // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ComputeAndLockDropTable;

// Function LootLockerSDK.LootLockerManager.ConnectAppleAccountByRestSignIn
// 0x0020 (0x0020 - 0x0000)
struct LootLockerManager_ConnectAppleAccountByRestSignIn final
{
public:
	class FString                                 AuthorizationCode;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAccountConnectedResponse& Response)> OnCompleteBP;        // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ConnectAppleAccountByRestSignIn;

// Function LootLockerSDK.LootLockerManager.ConnectGoogleAccount
// 0x0020 (0x0020 - 0x0000)
struct LootLockerManager_ConnectGoogleAccount final
{
public:
	class FString                                 IDToken;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAccountConnectedResponse& Response)> OnCompleteBP;        // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ConnectGoogleAccount;

// Function LootLockerSDK.LootLockerManager.ConnectGoogleAccountWithPlatform
// 0x0028 (0x0028 - 0x0000)
struct LootLockerManager_ConnectGoogleAccountWithPlatform final
{
public:
	class FString                                 IDToken;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGoogleAccountProviderPlatform                Platform;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FLootLockerAccountConnectedResponse& Response)> OnCompleteBP;        // 0x0014(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LootLockerManager_ConnectGoogleAccountWithPlatform;

// Function LootLockerSDK.LootLockerManager.ConvertCatalogToInlineItems
// 0x0298 (0x0298 - 0x0000)
struct LootLockerManager_ConvertCatalogToInlineItems final
{
public:
	struct FLootLockerListCatalogPricesResponse   Catalog;                                           // 0x0000(0x0288)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerInlinedCatalogEntry> ReturnValue;                                       // 0x0288(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ConvertCatalogToInlineItems;

// Function LootLockerSDK.LootLockerManager.CreateAKeyValuePairForAssetInstance
// 0x0038 (0x0038 - 0x0000)
struct LootLockerManager_CreateAKeyValuePairForAssetInstance final
{
public:
	int32                                         AssetInstanceId;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLootLockerAssetInstanceStorageItem    Item;                                              // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAssetInstanceStorageItemsResponse& Response)> OnCreateAKeyValuePairForAssetInstanceCompleted; // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CreateAKeyValuePairForAssetInstance;

// Function LootLockerSDK.LootLockerManager.CreateAssetCandidate
// 0x0058 (0x0058 - 0x0000)
struct LootLockerManager_CreateAssetCandidate final
{
public:
	struct FLootLockerCreateAssetCandidateData    AssetCandidateData;                                // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerCreateAssetCandidateResponse& Response)> OnCreateAssetCandidateCompleted; // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CreateAssetCandidate;

// Function LootLockerSDK.LootLockerManager.CreateCharacter
// 0x0038 (0x0038 - 0x0000)
struct LootLockerManager_CreateCharacter final
{
public:
	bool                                          IsDefault;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CharacterName;                                     // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CharacterTypeId;                                   // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerCharacterLoadoutResponse& Var)> OnCompletedRequestBP;     // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CreateCharacter;

// Function LootLockerSDK.LootLockerManager.CreateHero
// 0x0030 (0x0030 - 0x0000)
struct LootLockerManager_CreateHero final
{
public:
	struct FLootLockerCreateHeroRequest           Request;                                           // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerPlayerHeroResponse& Response)> OnCompleteBP;              // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CreateHero;

// Function LootLockerSDK.LootLockerManager.CreateHeroWithVariation
// 0x0030 (0x0030 - 0x0000)
struct LootLockerManager_CreateHeroWithVariation final
{
public:
	struct FLootLockerCreateHeroWithVariationRequest Request;                                        // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerPlayerHeroResponse& Response)> OnCompleteBP;              // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CreateHeroWithVariation;

// Function LootLockerSDK.LootLockerManager.CreditBalanceToWallet
// 0x0040 (0x0040 - 0x0000)
struct LootLockerManager_CreditBalanceToWallet final
{
public:
	class FString                                 WalletID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrencyID;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Amount;                                            // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerCreditWalletResponse& Response)> OnComplete;              // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CreditBalanceToWallet;

// Function LootLockerSDK.LootLockerManager.DebitBalanceToWallet
// 0x0040 (0x0040 - 0x0000)
struct LootLockerManager_DebitBalanceToWallet final
{
public:
	class FString                                 WalletID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrencyID;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Amount;                                            // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerDebitWalletResponse& Response)> OnComplete;               // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_DebitBalanceToWallet;

// Function LootLockerSDK.LootLockerManager.DeleteAKeyValuePairByIdForAssetInstance
// 0x0018 (0x0018 - 0x0000)
struct LootLockerManager_DeleteAKeyValuePairByIdForAssetInstance final
{
public:
	int32                                         AssetInstanceId;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StorageItemId;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAssetInstanceStorageItemsResponse& Response)> OnDeleteAKeyValuePairByIdForAssetInstanceCompleted; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_DeleteAKeyValuePairByIdForAssetInstance;

// Function LootLockerSDK.LootLockerManager.DeleteAssetCandidate
// 0x0014 (0x0014 - 0x0000)
struct LootLockerManager_DeleteAssetCandidate final
{
public:
	int32                                         AssetCandidateId;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerResponse& Response)> OnDeleteAssetCandidateCompleted;     // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_DeleteAssetCandidate;

// Function LootLockerSDK.LootLockerManager.DeleteAssetInstanceFromPlayerInventory
// 0x0014 (0x0014 - 0x0000)
struct LootLockerManager_DeleteAssetInstanceFromPlayerInventory final
{
public:
	int32                                         AssetInstanceId;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerDeleteAssetInstanceResponse& Response)> OnCompleted;      // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_DeleteAssetInstanceFromPlayerInventory;

// Function LootLockerSDK.LootLockerManager.DeleteCharacterProgression
// 0x0028 (0x0028 - 0x0000)
struct LootLockerManager_DeleteCharacterProgression final
{
public:
	int32                                         CharacterId;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProgressionKey;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerResponse& Response)> OnCompletedRequest;                  // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_DeleteCharacterProgression;

// Function LootLockerSDK.LootLockerManager.DeleteFileFromAssetCandidate
// 0x0018 (0x0018 - 0x0000)
struct LootLockerManager_DeleteFileFromAssetCandidate final
{
public:
	int32                                         AssetCandidateId;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FileId;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerResponse& Response)> OnDeleteFileFromAssetCandidateCompleted; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_DeleteFileFromAssetCandidate;

// Function LootLockerSDK.LootLockerManager.DeleteHero
// 0x0014 (0x0014 - 0x0000)
struct LootLockerManager_DeleteHero final
{
public:
	int32                                         HeroID;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerResponse& Response)> OnCompleteBP;                        // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_DeleteHero;

// Function LootLockerSDK.LootLockerManager.DeleteInstanceProgression
// 0x0028 (0x0028 - 0x0000)
struct LootLockerManager_DeleteInstanceProgression final
{
public:
	int32                                         AssetInstanceId;                                   // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProgressionKey;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerResponse& Response)> OnCompletedRequestBP;                // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_DeleteInstanceProgression;

// Function LootLockerSDK.LootLockerManager.DeleteItemFromPersistentStorage
// 0x0020 (0x0020 - 0x0000)
struct LootLockerManager_DeleteItemFromPersistentStorage final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerPersistentStorageItemsResponse& Response)> OnPersistentStorageItemDeleteRequestCompleted; // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_DeleteItemFromPersistentStorage;

// Function LootLockerSDK.LootLockerManager.DeletePlayer
// 0x0010 (0x0010 - 0x0000)
struct LootLockerManager_DeletePlayer final
{
public:
	TDelegate<void(const struct FLootLockerResponse& Var)> OnCompletedRequest;                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_DeletePlayer;

// Function LootLockerSDK.LootLockerManager.DeletePlayerFile
// 0x0014 (0x0014 - 0x0000)
struct LootLockerManager_DeletePlayerFile final
{
public:
	int32                                         FileId;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerResponse& Response)> OnComplete;                          // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_DeletePlayerFile;

// Function LootLockerSDK.LootLockerManager.DeletePlayerProgression
// 0x0020 (0x0020 - 0x0000)
struct LootLockerManager_DeletePlayerProgression final
{
public:
	class FString                                 ProgressionKey;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerResponse& Response)> OnCompletedRequest;                  // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_DeletePlayerProgression;

// Function LootLockerSDK.LootLockerManager.DisconnectAccount
// 0x0014 (0x0014 - 0x0000)
struct LootLockerManager_DisconnectAccount final
{
public:
	ELootLockerAccountProvider                    AccountToDisconnect;                               // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FLootLockerResponse& Var)> OnCompleteBP;                             // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_DisconnectAccount;

// Function LootLockerSDK.LootLockerManager.EndSession
// 0x0010 (0x0010 - 0x0000)
struct LootLockerManager_EndSession final
{
public:
	TDelegate<void(const struct FLootLockerResponse& Var)> OnEndSessionRequestCompleted;             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_EndSession;

// Function LootLockerSDK.LootLockerManager.EquipAssetToCharacterById
// 0x001C (0x001C - 0x0000)
struct LootLockerManager_EquipAssetToCharacterById final
{
public:
	int32                                         CharacterId;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetId;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetVariationID;                                  // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerResponse& Var)> OnEquipAssetToCharacterByIdRequestCompleted; // 0x000C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_EquipAssetToCharacterById;

// Function LootLockerSDK.LootLockerManager.EquipAssetToCharacterByIdAndInstance
// 0x0018 (0x0018 - 0x0000)
struct LootLockerManager_EquipAssetToCharacterByIdAndInstance final
{
public:
	int32                                         CharacterId;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InstanceId;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerResponse& Var)> OnEquipAssetToCharacterByIdRequestCompleted; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_EquipAssetToCharacterByIdAndInstance;

// Function LootLockerSDK.LootLockerManager.EquipAssetToDefaultCharacter
// 0x0014 (0x0014 - 0x0000)
struct LootLockerManager_EquipAssetToDefaultCharacter final
{
public:
	int32                                         InstanceId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerResponse& Var)> OnEquipAssetToDefaultCharacterRequestCompleted; // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_EquipAssetToDefaultCharacter;

// Function LootLockerSDK.LootLockerManager.FinalizeSteamPurchaseRedemption
// 0x0020 (0x0020 - 0x0000)
struct LootLockerManager_FinalizeSteamPurchaseRedemption final
{
public:
	class FString                                 EntitlementId;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerResponse& Var)> OnCompletedRequest;                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_FinalizeSteamPurchaseRedemption;

// Function LootLockerSDK.LootLockerManager.FinishMission
// 0x0058 (0x0058 - 0x0000)
struct LootLockerManager_FinishMission final
{
public:
	int32                                         MissionId;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLootLockerFinishMissionData           MissionData;                                       // 0x0008(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerFinishMissionResponse& Response)> OnFinishMissionCompleted; // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_FinishMission;

// Function LootLockerSDK.LootLockerManager.GetAKeyValuePairByIdForAssetInstance
// 0x0018 (0x0018 - 0x0000)
struct LootLockerManager_GetAKeyValuePairByIdForAssetInstance final
{
public:
	int32                                         AssetInstanceId;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StorageItemId;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAssetInstanceStorageItemResponse& Response)> OnGetAKeyValuePairByIdForAssetInstanceCompleted; // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_GetAKeyValuePairByIdForAssetInstance;

// Function LootLockerSDK.LootLockerManager.GetAllAssetCandidates
// 0x0010 (0x0010 - 0x0000)
struct LootLockerManager_GetAllAssetCandidates final
{
public:
	TDelegate<void(const struct FLootLockerAssetCandidatesResponse& Response)> OnGetAllAssetCandidatesCompleted; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_GetAllAssetCandidates;

// Function LootLockerSDK.LootLockerManager.GetAllCollectables
// 0x0010 (0x0010 - 0x0000)
struct LootLockerManager_GetAllCollectables final
{
public:
	TDelegate<void(const struct FLootLockerCollectablesResponse& Response)> OnGetAllCollectablesCompleted; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_GetAllCollectables;

// Function LootLockerSDK.LootLockerManager.GetAllKeyValuePairsForAssetInstance
// 0x0014 (0x0014 - 0x0000)
struct LootLockerManager_GetAllKeyValuePairsForAssetInstance final
{
public:
	int32                                         AssetInstanceId;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAssetInstanceStorageItemsResponse& Response)> OnGetAllKeyValuePairsForAssetInstanceCompleted; // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_GetAllKeyValuePairsForAssetInstance;

// Function LootLockerSDK.LootLockerManager.GetAllMemberRanks
// 0x0028 (0x0028 - 0x0000)
struct LootLockerManager_GetAllMemberRanks final
{
public:
	class FString                                 MemberId;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         after;                                             // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerGetAllMemberRanksResponse& Response)> OnCompletedRequestBP; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_GetAllMemberRanks;

// Function LootLockerSDK.LootLockerManager.GetAllMissions
// 0x0010 (0x0010 - 0x0000)
struct LootLockerManager_GetAllMissions final
{
public:
	TDelegate<void(const struct FLootLockerMissionsResponse& Response)> OnGetAllMissionsCompleted;   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_GetAllMissions;

// Function LootLockerSDK.LootLockerManager.GetAssetBones
// 0x0010 (0x0010 - 0x0000)
struct LootLockerManager_GetAssetBones final
{
public:
	TDelegate<void(const struct FLootLockerGetAssetBonesResponse& AssetBonesResponse)> OnGetAssetBonesRequestCompleted; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_GetAssetBones;

// Function LootLockerSDK.LootLockerManager.GetAssetCandidate
// 0x0014 (0x0014 - 0x0000)
struct LootLockerManager_GetAssetCandidate final
{
public:
	int32                                         AssetCandidateId;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAssetCandidateResponse& Response)> OnGetAssetCandidateCompleted; // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_GetAssetCandidate;

// Function LootLockerSDK.LootLockerManager.GetAssets
// 0x0024 (0x0024 - 0x0000)
struct LootLockerManager_GetAssets final
{
public:
	TDelegate<void(const struct FLootLockerGetAssetsResponse& AssetsResponse)> OnGetAssetsRequestCompleted; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         StartFromIndex;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemsCount;                                        // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELootLockerAssetFilter                        AssetFilter;                                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Context;                                           // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeUGC;                                        // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LootLockerManager_GetAssets;

// Function LootLockerSDK.LootLockerManager.GetAssetsByIds
// 0x0020 (0x0020 - 0x0000)
struct LootLockerManager_GetAssetsByIds final
{
public:
	TArray<int32>                                 AssetIds;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerGetAssetsResponse& AssetsResponse)> OnGetAssetsByIdsRequestCompleted; // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_GetAssetsByIds;

// Function LootLockerSDK.LootLockerManager.GetByListOfMembers
// 0x0030 (0x0030 - 0x0000)
struct LootLockerManager_GetByListOfMembers final
{
public:
	TArray<class FString>                         members;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 LeaderboardKey;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerGetByListOfMembersResponse& Response)> OnCompletedRequestBP; // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_GetByListOfMembers;

// Function LootLockerSDK.LootLockerManager.GetCharacterLoadout
// 0x0010 (0x0010 - 0x0000)
struct LootLockerManager_GetCharacterLoadout final
{
public:
	TDelegate<void(const struct FLootLockerCharacterLoadoutResponse& Var)> OnGetCharacterLoadoutRequestCompleted; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_GetCharacterLoadout;

// Function LootLockerSDK.LootLockerManager.GetCharacterProgression
// 0x0028 (0x0028 - 0x0000)
struct LootLockerManager_GetCharacterProgression final
{
public:
	int32                                         CharacterId;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProgressionKey;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerCharacterProgressionResponse& Response)> OnCompletedRequest; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_GetCharacterProgression;

// Function LootLockerSDK.LootLockerManager.GetCharacterProgressions
// 0x0028 (0x0028 - 0x0000)
struct LootLockerManager_GetCharacterProgressions final
{
public:
	int32                                         CharacterId;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 after;                                             // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerPaginatedCharacterProgressionResponse& Response)> OnCompletedRequest; // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_GetCharacterProgressions;

// Function LootLockerSDK.LootLockerManager.GetContexts
// 0x0010 (0x0010 - 0x0000)
struct LootLockerManager_GetContexts final
{
public:
	TDelegate<void(const struct FLootLockerGetContextResponse& ContextsResponse)> OnGetContextsRequestCompleted; // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_GetContexts;

// Function LootLockerSDK.LootLockerManager.GetCurrencyBalance
// 0x0010 (0x0010 - 0x0000)
struct LootLockerManager_GetCurrencyBalance final
{
public:
