#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LootLockerSDK

#include "Basic.hpp"

#include "LootLockerSDK_structs.hpp"


namespace SDK::Params
{

// Function LootLockerSDK.LootLockerConfig.EnableFileLogging
// 0x0010 (0x0010 - 0x0000)
struct LootLockerConfig_EnableFileLogging final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerConfig_EnableFileLogging;

// Function LootLockerSDK.LootLockerConfig.GetLogFilePath
// 0x0010 (0x0010 - 0x0000)
struct LootLockerConfig_GetLogFilePath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerConfig_GetLogFilePath;

// Function LootLockerSDK.LootLockerConfig.GetRuntimeLogLevel
// 0x0001 (0x0001 - 0x0000)
struct LootLockerConfig_GetRuntimeLogLevel final
{
public:
	ELootLockerLogLevel                           ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerConfig_GetRuntimeLogLevel;

// Function LootLockerSDK.LootLockerConfig.IsFileLoggingEnabled
// 0x0001 (0x0001 - 0x0000)
struct LootLockerConfig_IsFileLoggingEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerConfig_IsFileLoggingEnabled;

// Function LootLockerSDK.LootLockerConfig.IsPresenceAutoConnectEnabled
// 0x0001 (0x0001 - 0x0000)
struct LootLockerConfig_IsPresenceAutoConnectEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerConfig_IsPresenceAutoConnectEnabled;

// Function LootLockerSDK.LootLockerConfig.IsPresenceAutoDisconnectOnFocusChangeEnabled
// 0x0001 (0x0001 - 0x0000)
struct LootLockerConfig_IsPresenceAutoDisconnectOnFocusChangeEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerConfig_IsPresenceAutoDisconnectOnFocusChangeEnabled;

// Function LootLockerSDK.LootLockerConfig.IsPresenceEnabled
// 0x0001 (0x0001 - 0x0000)
struct LootLockerConfig_IsPresenceEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerConfig_IsPresenceEnabled;

// Function LootLockerSDK.LootLockerConfig.IsPresenceEnabledInEditor
// 0x0001 (0x0001 - 0x0000)
struct LootLockerConfig_IsPresenceEnabledInEditor final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerConfig_IsPresenceEnabledInEditor;

// Function LootLockerSDK.LootLockerConfig.IsSemverString
// 0x0018 (0x0018 - 0x0000)
struct LootLockerConfig_IsSemverString final
{
public:
	class FString                                 str;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LootLockerConfig_IsSemverString;

// Function LootLockerSDK.LootLockerConfig.SetRuntimeLogLevel
// 0x0001 (0x0001 - 0x0000)
struct LootLockerConfig_SetRuntimeLogLevel final
{
public:
	ELootLockerLogLevel                           NewLevel;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerConfig_SetRuntimeLogLevel;

// Function LootLockerSDK.LootLockerConfig.ShouldLog
// 0x0001 (0x0001 - 0x0000)
struct LootLockerConfig_ShouldLog final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerConfig_ShouldLog;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.GetAuthCode
// 0x0018 (0x0018 - 0x0000)
struct LootLockerGoogleSubsystemHelper_GetAuthCode final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_GetAuthCode;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.GetIDToken
// 0x0018 (0x0018 - 0x0000)
struct LootLockerGoogleSubsystemHelper_GetIDToken final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_GetIDToken;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.HasGoogleOnlineSubsystem
// 0x0001 (0x0001 - 0x0000)
struct LootLockerGoogleSubsystemHelper_HasGoogleOnlineSubsystem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_HasGoogleOnlineSubsystem;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.HasGooglePlayOnlineSubsystem
// 0x0001 (0x0001 - 0x0000)
struct LootLockerGoogleSubsystemHelper_HasGooglePlayOnlineSubsystem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_HasGooglePlayOnlineSubsystem;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.PurchaseOffer
// 0x0030 (0x0030 - 0x0000)
struct LootLockerGoogleSubsystemHelper_PurchaseOffer final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OfferId;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsConsumable;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool success, int32 LocalUserNumber, const class FString& ErrorMsg, const class FString& ReceiptOfferID, const class FString& ReceiptPurchaseToken)> Callback; // 0x001C(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_PurchaseOffer;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.ReadOfferInformation
// 0x0028 (0x0028 - 0x0000)
struct LootLockerGoogleSubsystemHelper_ReadOfferInformation final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OfferId;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool success, int32 LocalUserNumber, const class FString& ErrorMsg, const struct FLootLockerGoogleSubsystemStoreOffer& OfferInformation)> Callback; // 0x0018(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_ReadOfferInformation;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.SignInWithGoogle
// 0x0014 (0x0014 - 0x0000)
struct LootLockerGoogleSubsystemHelper_SignInWithGoogle final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool success, int32 LocalUserNumber, const class FString& ErrorMsg, const class FString& IDToken)> Callback; // 0x0004(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_SignInWithGoogle;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.SignInWithGooglePlay
// 0x0014 (0x0014 - 0x0000)
struct LootLockerGoogleSubsystemHelper_SignInWithGooglePlay final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool success, int32 LocalUserNumber, const class FString& ErrorMsg, const class FString& AuthCode)> Callback; // 0x0004(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_SignInWithGooglePlay;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.SignOutWithGoogle
// 0x0014 (0x0014 - 0x0000)
struct LootLockerGoogleSubsystemHelper_SignOutWithGoogle final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool success, int32 LocalUserNumber, const class FString& ErrorMsg)> Callback;    // 0x0004(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_SignOutWithGoogle;

// Function LootLockerSDK.LootLockerGoogleSubsystemHelper.SignOutWithGooglePlay
// 0x0014 (0x0014 - 0x0000)
struct LootLockerGoogleSubsystemHelper_SignOutWithGooglePlay final
{
public:
	int32                                         LocalUserNumber;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(bool success, int32 LocalUserNumber, const class FString& ErrorMsg)> Callback;    // 0x0004(0x0010)(ConstParm, Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerGoogleSubsystemHelper_SignOutWithGooglePlay;

// Function LootLockerSDK.LootLockerLifeCycleManager.GetInstance
// 0x0008 (0x0008 - 0x0000)
struct LootLockerLifeCycleManager_GetInstance final
{
public:
	class ULootLockerLifeCycleManager*            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerLifeCycleManager_GetInstance;

// Function LootLockerSDK.LootLockerManager.AcceptIncomingFriendRequest
// 0x0040 (0x0040 - 0x0000)
struct LootLockerManager_AcceptIncomingFriendRequest final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlayerUlid;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerFriendActionResponse& Response)> OnResponseCompletedBP;   // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AcceptIncomingFriendRequest;

// Function LootLockerSDK.LootLockerManager.ActivateRentalAsset
// 0x0038 (0x0038 - 0x0000)
struct LootLockerManager_ActivateRentalAsset final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetInstanceId;                                   // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerActivateRentalAssetResponse& Response)> OnActivateRentalAssetCompleted; // 0x0014(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ActivateRentalAsset;

// Function LootLockerSDK.LootLockerManager.AddAssetToFavourites
// 0x0038 (0x0038 - 0x0000)
struct LootLockerManager_AddAssetToFavourites final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetId;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerGetFavouriteAssetIndicesResponse& FavouriteAssetIndicesResponse)> OnAddAssetToFavouritesRequestCompleted; // 0x0014(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddAssetToFavourites;

// Function LootLockerSDK.LootLockerManager.AddAssetToHeroLoadout
// 0x0038 (0x0038 - 0x0000)
struct LootLockerManager_AddAssetToHeroLoadout final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeroID;                                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetInstanceId;                                   // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerHeroLoadoutResponse& Response)> OnCompleteBP;             // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddAssetToHeroLoadout;

// Function LootLockerSDK.LootLockerManager.AddFileToAssetCandidate
// 0x0050 (0x0050 - 0x0000)
struct LootLockerManager_AddFileToAssetCandidate final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetCandidateId;                                  // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FilePath;                                          // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELootLockerAssetFilePurpose                   FilePurpose;                                       // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FLootLockerAssetCandidateResponse& Response)> OnAddFileToAssetCandidateCompleted; // 0x002C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddFileToAssetCandidate;

// Function LootLockerSDK.LootLockerManager.AddGlobalAssetToHeroLoadout
// 0x0038 (0x0038 - 0x0000)
struct LootLockerManager_AddGlobalAssetToHeroLoadout final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeroID;                                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetId;                                           // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerHeroLoadoutResponse& Response)> OnCompleteBP;             // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddGlobalAssetToHeroLoadout;

// Function LootLockerSDK.LootLockerManager.AddGlobalAssetVariationToHeroLoadout
// 0x0040 (0x0040 - 0x0000)
struct LootLockerManager_AddGlobalAssetVariationToHeroLoadout final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeroID;                                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetId;                                           // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetVariationID;                                  // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerHeroLoadoutResponse& Response)> OnCompleteBP;             // 0x001C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddGlobalAssetVariationToHeroLoadout;

// Function LootLockerSDK.LootLockerManager.AddItemsToPersistentStorage
// 0x0040 (0x0040 - 0x0000)
struct LootLockerManager_AddItemsToPersistentStorage final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLootLockerPersistentStorageItems      Items;                                             // 0x0010(0x0010)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerPersistentStorageItemsResponse& Response)> OnPersistentStorageItemsAddRequestCompleted; // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddItemsToPersistentStorage;

// Function LootLockerSDK.LootLockerManager.AddItemToPersistentStorage
// 0x0058 (0x0058 - 0x0000)
struct LootLockerManager_AddItemToPersistentStorage final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLootLockerPersistentStorageItem       Item;                                              // 0x0010(0x0028)(Parm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerPersistentStorageItemResponse& Response)> OnPersistentStorageItemAddRequestCompleted; // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddItemToPersistentStorage;

// Function LootLockerSDK.LootLockerManager.AddPointsToCharacterProgression
// 0x0050 (0x0050 - 0x0000)
struct LootLockerManager_AddPointsToCharacterProgression final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CharacterId;                                       // 0x0010(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProgressionKey;                                    // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0028(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerCharacterProgressionWithRewardsResponse& Response)> OnCompletedRequest; // 0x002C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddPointsToCharacterProgression;

// Function LootLockerSDK.LootLockerManager.AddPointsToInstanceProgression
// 0x0050 (0x0050 - 0x0000)
struct LootLockerManager_AddPointsToInstanceProgression final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetInstanceId;                                   // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProgressionKey;                                    // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0028(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerInstanceProgressionWithRewardsResponse& Response)> OnCompletedRequestBP; // 0x002C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddPointsToInstanceProgression;

// Function LootLockerSDK.LootLockerManager.AddPointsToPlayerProgression
// 0x0048 (0x0048 - 0x0000)
struct LootLockerManager_AddPointsToPlayerProgression final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProgressionKey;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Amount;                                            // 0x0020(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerPlayerProgressionWithRewardsResponse& Response)> OnCompletedRequest; // 0x0024(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_AddPointsToPlayerProgression;

// Function LootLockerSDK.LootLockerManager.BeginSteamPurchaseRedemption
// 0x0070 (0x0070 - 0x0000)
struct LootLockerManager_BeginSteamPurchaseRedemption final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 steamID;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 currency;                                          // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CatalogItemId;                                     // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerBeginSteamPurchaseRedemptionResponse& Response)> OnCompletedRequest; // 0x0050(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0060(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_BeginSteamPurchaseRedemption;

// Function LootLockerSDK.LootLockerManager.BeginSteamPurchaseRedemptionForClass
// 0x0078 (0x0078 - 0x0000)
struct LootLockerManager_BeginSteamPurchaseRedemptionForClass final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ClassId;                                           // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 steamID;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 currency;                                          // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Language;                                          // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CatalogItemId;                                     // 0x0048(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerBeginSteamPurchaseRedemptionResponse& Response)> OnCompletedRequest; // 0x0058(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0068(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_BeginSteamPurchaseRedemptionForClass;

// Function LootLockerSDK.LootLockerManager.BlockPlayer
// 0x0040 (0x0040 - 0x0000)
struct LootLockerManager_BlockPlayer final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlayerUlid;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerFriendActionResponse& Response)> OnResponseCompletedBP;   // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_BlockPlayer;

// Function LootLockerSDK.LootLockerManager.CancelOutgoingFriendRequest
// 0x0040 (0x0040 - 0x0000)
struct LootLockerManager_CancelOutgoingFriendRequest final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlayerUlid;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerFriendActionResponse& Response)> OnResponseCompletedBP;   // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CancelOutgoingFriendRequest;

// Function LootLockerSDK.LootLockerManager.CancelRemoteSessionProcess
// 0x0010 (0x0010 - 0x0000)
struct LootLockerManager_CancelRemoteSessionProcess final
{
public:
	class FString                                 ProcessId;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CancelRemoteSessionProcess;

// Function LootLockerSDK.LootLockerManager.CheckPlayerAssetActivationNotification
// 0x0030 (0x0030 - 0x0000)
struct LootLockerManager_CheckPlayerAssetActivationNotification final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerPlayerAssetNotificationResponse& Value)> OnCheckPlayerAssetDeactivationNotificationRequestCompleted; // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CheckPlayerAssetActivationNotification;

// Function LootLockerSDK.LootLockerManager.ClearAllPlayerCachesExceptForPlayer
// 0x0010 (0x0010 - 0x0000)
struct LootLockerManager_ClearAllPlayerCachesExceptForPlayer final
{
public:
	class FString                                 PlayerUlid;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ClearAllPlayerCachesExceptForPlayer;

// Function LootLockerSDK.LootLockerManager.ClearCacheForPlayer
// 0x0010 (0x0010 - 0x0000)
struct LootLockerManager_ClearCacheForPlayer final
{
public:
	class FString                                 PlayerUlid;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ClearCacheForPlayer;

// Function LootLockerSDK.LootLockerManager.CollectItem
// 0x0040 (0x0040 - 0x0000)
struct LootLockerManager_CollectItem final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLootLockerCollectItemPayload          Item;                                              // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerCollectablesResponse& Response)> OnCollectItemCompleted;  // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CollectItem;

// Function LootLockerSDK.LootLockerManager.ComputeAndLockDropTable
// 0x0038 (0x0038 - 0x0000)
struct LootLockerManager_ComputeAndLockDropTable final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TableId;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerComputeAndLockDropTableResponse& Response)> OnCompletedRequestBP; // 0x0014(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ComputeAndLockDropTable;

// Function LootLockerSDK.LootLockerManager.ConnectAppleAccountByRestSignIn
// 0x0040 (0x0040 - 0x0000)
struct LootLockerManager_ConnectAppleAccountByRestSignIn final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AuthorizationCode;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAccountConnectedResponse& Response)> OnCompleteBP;        // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ConnectAppleAccountByRestSignIn;

// Function LootLockerSDK.LootLockerManager.ConnectDiscordAccount
// 0x0040 (0x0040 - 0x0000)
struct LootLockerManager_ConnectDiscordAccount final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAccountConnectedResponse& Response)> OnCompleteBP;        // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ConnectDiscordAccount;

// Function LootLockerSDK.LootLockerManager.ConnectEpicAccount
// 0x0040 (0x0040 - 0x0000)
struct LootLockerManager_ConnectEpicAccount final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Token;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAccountConnectedResponse& Response)> OnCompleteBP;        // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ConnectEpicAccount;

// Function LootLockerSDK.LootLockerManager.ConnectGoogleAccount
// 0x0040 (0x0040 - 0x0000)
struct LootLockerManager_ConnectGoogleAccount final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IDToken;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAccountConnectedResponse& Response)> OnCompleteBP;        // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ConnectGoogleAccount;

// Function LootLockerSDK.LootLockerManager.ConnectGoogleAccountWithPlatform
// 0x0048 (0x0048 - 0x0000)
struct LootLockerManager_ConnectGoogleAccountWithPlatform final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IDToken;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGoogleAccountProviderPlatform                Platform;                                          // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FLootLockerAccountConnectedResponse& Response)> OnCompleteBP;        // 0x0024(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ConnectGoogleAccountWithPlatform;

// Function LootLockerSDK.LootLockerManager.ConnectPlaystationAccount
// 0x0050 (0x0050 - 0x0000)
struct LootLockerManager_ConnectPlaystationAccount final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Environment;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Code;                                              // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAccountConnectedResponse& Response)> OnCompleteBP;        // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ConnectPlaystationAccount;

// Function LootLockerSDK.LootLockerManager.ConnectRemoteSessionAccount
// 0x0050 (0x0050 - 0x0000)
struct LootLockerManager_ConnectRemoteSessionAccount final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Code;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Nonce;                                             // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAccountConnectedResponse& Response)> OnCompleteBP;        // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ConnectRemoteSessionAccount;

// Function LootLockerSDK.LootLockerManager.ConnectTwitchAccount
// 0x0040 (0x0040 - 0x0000)
struct LootLockerManager_ConnectTwitchAccount final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AuthorizationCode;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAccountConnectedResponse& Response)> OnCompleteBP;        // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ConnectTwitchAccount;

// Function LootLockerSDK.LootLockerManager.ConvertCatalogToInlineItems
// 0x0348 (0x0348 - 0x0000)
struct LootLockerManager_ConvertCatalogToInlineItems final
{
public:
	struct FLootLockerListCatalogPricesResponse   Catalog;                                           // 0x0000(0x0338)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerInlinedCatalogEntry> ReturnValue;                                       // 0x0338(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ConvertCatalogToInlineItems;

// Function LootLockerSDK.LootLockerManager.ConvertCatalogV2ToInlineItems
// 0x0368 (0x0368 - 0x0000)
struct LootLockerManager_ConvertCatalogV2ToInlineItems final
{
public:
	struct FLootLockerListCatalogPricesV2Response Catalog;                                           // 0x0000(0x0358)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FLootLockerInlinedCatalogEntry> ReturnValue;                                       // 0x0358(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_ConvertCatalogV2ToInlineItems;

// Function LootLockerSDK.LootLockerManager.CreateAKeyValuePairForAssetInstance
// 0x0058 (0x0058 - 0x0000)
struct LootLockerManager_CreateAKeyValuePairForAssetInstance final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetInstanceId;                                   // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLootLockerAssetInstanceStorageItem    Item;                                              // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerAssetInstanceStorageItemsResponse& Response)> OnCreateAKeyValuePairForAssetInstanceCompleted; // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CreateAKeyValuePairForAssetInstance;

// Function LootLockerSDK.LootLockerManager.CreateAssetCandidate
// 0x0078 (0x0078 - 0x0000)
struct LootLockerManager_CreateAssetCandidate final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLootLockerCreateAssetCandidateData    AssetCandidateData;                                // 0x0010(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerCreateAssetCandidateResponse& Response)> OnCreateAssetCandidateCompleted; // 0x0058(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0068(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CreateAssetCandidate;

// Function LootLockerSDK.LootLockerManager.CreateAssetCandidateAndMarkComplete
// 0x0078 (0x0078 - 0x0000)
struct LootLockerManager_CreateAssetCandidateAndMarkComplete final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLootLockerCreateAssetCandidateData    AssetCandidateData;                                // 0x0010(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerCreateAssetCandidateResponse& Response)> OnCreateAssetCandidateCompleted; // 0x0058(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0068(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CreateAssetCandidateAndMarkComplete;

// Function LootLockerSDK.LootLockerManager.CreateCharacter
// 0x0050 (0x0050 - 0x0000)
struct LootLockerManager_CreateCharacter final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDefault;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CharacterName;                                     // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CharacterTypeId;                                   // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerCharacterLoadoutResponse& Var)> OnCompletedRequestBP;     // 0x002C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CreateCharacter;

// Function LootLockerSDK.LootLockerManager.CreateHero
// 0x0050 (0x0050 - 0x0000)
struct LootLockerManager_CreateHero final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLootLockerCreateHeroRequest           Request;                                           // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerPlayerHeroResponse& Response)> OnCompleteBP;              // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LootLockerManager_CreateHero;

// Function LootLockerSDK.LootLockerManager.CreateHeroWithVariation
// 0x0050 (0x0050 - 0x0000)
struct LootLockerManager_CreateHeroWithVariation final
{
public:
	class FString                                 ForPlayerWithUlid;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLootLockerCreateHeroWithVariationRequest Request;                                        // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FLootLockerPlayerHeroResponse& Response)> OnCompleteBP;              // 0x0030(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
