#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MainMenu3.MainMenu3_C
// 0x0050 (0x0280 - 0x0230)
class AMainMenu3_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FName>                           BackgroundLevels;                                  // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         LevelIndex;                                        // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Authenticating_C*                  AuthWidget;                                        // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameInstance*                        MAGameInstance;                                    // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasLoaded;                                         // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACameraActor*                           CameraActor_0_ExecuteUbergraph_MainMenu3_RefProperty; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainMenu_CharacterPreview_C*           MainMenu_CharacterPreview_0_ExecuteUbergraph_MainMenu3_RefProperty; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TRFlagGoal_C*                       BP_TRFlagGoal_0_ExecuteUbergraph_MainMenu3_RefProperty; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu3(int32 EntryPoint);
	void GoToPressStart();
	void Load_Next_Level();
	void ReceiveBeginPlay();
	void HorribleLoadoutsSaveHack();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MainMenu3_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MainMenu3_C")
	}
	static class AMainMenu3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMainMenu3_C>();
	}
};
DUMPER7_ASSERTS_AMainMenu3_C;

}

