#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_CharacterPreview

#include "Basic.hpp"

#include "Midair2_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MainMenu_CharacterPreview.MainMenu_CharacterPreview_C
// 0x0028 (0x02D0 - 0x02A8)
class AMainMenu_CharacterPreview_C final : public ALoadoutPreview
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               JetTrailMain;                                      // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SKM_DefaultMale;                                   // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AParticleConfiguration*                 JetConfig;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_CharacterPreview(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UpdateTrail(class AParticleConfiguration* NewTrail);
	void HideTrail();
	void IsTrailAcitive(bool* Active);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MainMenu_CharacterPreview_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MainMenu_CharacterPreview_C")
	}
	static class AMainMenu_CharacterPreview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMainMenu_CharacterPreview_C>();
	}
};
DUMPER7_ASSERTS_AMainMenu_CharacterPreview_C;

}

