#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaFrameworkUtilities

#include "Basic.hpp"

#include "OpenCVLensDistortion_structs.hpp"


namespace SDK::Params
{

// Function MediaFrameworkUtilities.MediaBundle.GetLensDisplacementTexture
// 0x0008 (0x0008 - 0x0000)
struct MediaBundle_GetLensDisplacementTexture final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaBundle_GetLensDisplacementTexture;

// Function MediaFrameworkUtilities.MediaBundle.GetMaterial
// 0x0008 (0x0008 - 0x0000)
struct MediaBundle_GetMaterial final
{
public:
	class UMaterialInterface*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaBundle_GetMaterial;

// Function MediaFrameworkUtilities.MediaBundle.GetMediaPlayer
// 0x0008 (0x0008 - 0x0000)
struct MediaBundle_GetMediaPlayer final
{
public:
	class UMediaPlayer*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaBundle_GetMediaPlayer;

// Function MediaFrameworkUtilities.MediaBundle.GetMediaSource
// 0x0008 (0x0008 - 0x0000)
struct MediaBundle_GetMediaSource final
{
public:
	class UMediaSource*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaBundle_GetMediaSource;

// Function MediaFrameworkUtilities.MediaBundle.GetMediaTexture
// 0x0008 (0x0008 - 0x0000)
struct MediaBundle_GetMediaTexture final
{
public:
	class UMediaTexture*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaBundle_GetMediaTexture;

// Function MediaFrameworkUtilities.MediaBundle.GetUndistortedCameraViewInfo
// 0x000C (0x000C - 0x0000)
struct MediaBundle_GetUndistortedCameraViewInfo final
{
public:
	struct FOpenCVCameraViewInfo                  ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaBundle_GetUndistortedCameraViewInfo;

// Function MediaFrameworkUtilities.MediaBundle.OnMediaOpenFailed
// 0x0010 (0x0010 - 0x0000)
struct MediaBundle_OnMediaOpenFailed final
{
public:
	class FString                                 DeviceUrl;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaBundle_OnMediaOpenFailed;

// Function MediaFrameworkUtilities.MediaBundle.OnMediaOpenOpened
// 0x0010 (0x0010 - 0x0000)
struct MediaBundle_OnMediaOpenOpened final
{
public:
	class FString                                 DeviceUrl;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaBundle_OnMediaOpenOpened;

// Function MediaFrameworkUtilities.MediaBundleActorBase.GetMediaBundle
// 0x0008 (0x0008 - 0x0000)
struct MediaBundleActorBase_GetMediaBundle final
{
public:
	class UMediaBundle*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaBundleActorBase_GetMediaBundle;

// Function MediaFrameworkUtilities.MediaBundleActorBase.RequestOpenMediaSource
// 0x0001 (0x0001 - 0x0000)
struct MediaBundleActorBase_RequestOpenMediaSource final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaBundleActorBase_RequestOpenMediaSource;

// Function MediaFrameworkUtilities.MediaBundleActorBase.SetComponent
// 0x0010 (0x0010 - 0x0000)
struct MediaBundleActorBase_SetComponent final
{
public:
	class UPrimitiveComponent*                    InPrimitive;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaSoundComponent*                   InMediaSound;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaBundleActorBase_SetComponent;

// Function MediaFrameworkUtilities.MediaProfileBlueprintLibrary.GetAllMediaOutputProxy
// 0x0010 (0x0010 - 0x0000)
struct MediaProfileBlueprintLibrary_GetAllMediaOutputProxy final
{
public:
	TArray<class UProxyMediaOutput*>              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaProfileBlueprintLibrary_GetAllMediaOutputProxy;

// Function MediaFrameworkUtilities.MediaProfileBlueprintLibrary.GetAllMediaSourceProxy
// 0x0010 (0x0010 - 0x0000)
struct MediaProfileBlueprintLibrary_GetAllMediaSourceProxy final
{
public:
	TArray<class UProxyMediaSource*>              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaProfileBlueprintLibrary_GetAllMediaSourceProxy;

// Function MediaFrameworkUtilities.MediaProfileBlueprintLibrary.GetMediaProfile
// 0x0008 (0x0008 - 0x0000)
struct MediaProfileBlueprintLibrary_GetMediaProfile final
{
public:
	class UMediaProfile*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaProfileBlueprintLibrary_GetMediaProfile;

// Function MediaFrameworkUtilities.MediaProfileBlueprintLibrary.SetMediaProfile
// 0x0008 (0x0008 - 0x0000)
struct MediaProfileBlueprintLibrary_SetMediaProfile final
{
public:
	class UMediaProfile*                          MediaProfile;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaProfileBlueprintLibrary_SetMediaProfile;

// Function MediaFrameworkUtilities.ProxyMediaOutput.IsProxyValid
// 0x0001 (0x0001 - 0x0000)
struct ProxyMediaOutput_IsProxyValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ProxyMediaOutput_IsProxyValid;

// Function MediaFrameworkUtilities.ProxyMediaSource.IsProxyValid
// 0x0001 (0x0001 - 0x0000)
struct ProxyMediaSource_IsProxyValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ProxyMediaSource_IsProxyValid;

}

