#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaIOCore

#include "Basic.hpp"

#include "MediaIOCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MediaIOCore.MediaOutput.CreateMediaCapture
// 0x0008 (0x0008 - 0x0000)
struct MediaOutput_CreateMediaCapture final
{
public:
	class UMediaCapture*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaOutput_CreateMediaCapture;

// Function MediaIOCore.MediaOutput.Validate
// 0x0018 (0x0018 - 0x0000)
struct MediaOutput_Validate final
{
public:
	class FString                                 OutFailureReason;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaOutput_Validate;

// Function MediaIOCore.MediaCapture.CaptureActiveSceneViewport
// 0x0014 (0x0014 - 0x0000)
struct MediaCapture_CaptureActiveSceneViewport final
{
public:
	struct FMediaCaptureOptions                   CaptureOptions;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaCapture_CaptureActiveSceneViewport;

// Function MediaIOCore.MediaCapture.CaptureTextureRenderTarget2D
// 0x0020 (0x0020 - 0x0000)
struct MediaCapture_CaptureTextureRenderTarget2D final
{
public:
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMediaCaptureOptions                   CaptureOptions;                                    // 0x0008(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaCapture_CaptureTextureRenderTarget2D;

// Function MediaIOCore.MediaCapture.SetMediaOutput
// 0x0008 (0x0008 - 0x0000)
struct MediaCapture_SetMediaOutput final
{
public:
	class UMediaOutput*                           InMediaOutput;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaCapture_SetMediaOutput;

// Function MediaIOCore.MediaCapture.StopCapture
// 0x0001 (0x0001 - 0x0000)
struct MediaCapture_StopCapture final
{
public:
	bool                                          bAllowPendingFrameToBeProcess;                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaCapture_StopCapture;

// Function MediaIOCore.MediaCapture.UpdateTextureRenderTarget2D
// 0x0010 (0x0010 - 0x0000)
struct MediaCapture_UpdateTextureRenderTarget2D final
{
public:
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MediaCapture_UpdateTextureRenderTarget2D;

// Function MediaIOCore.MediaCapture.GetDesiredPixelFormat
// 0x0001 (0x0001 - 0x0000)
struct MediaCapture_GetDesiredPixelFormat final
{
public:
	EPixelFormat                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaCapture_GetDesiredPixelFormat;

// Function MediaIOCore.MediaCapture.GetDesiredSize
// 0x0008 (0x0008 - 0x0000)
struct MediaCapture_GetDesiredSize final
{
public:
	struct FIntPoint                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaCapture_GetDesiredSize;

// Function MediaIOCore.MediaCapture.GetState
// 0x0001 (0x0001 - 0x0000)
struct MediaCapture_GetState final
{
public:
	EMediaCaptureState                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MediaCapture_GetState;

}

