#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Midair2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// Enum Midair2.EVoiceChatResultMA
// NumValues: 0x0010
enum class EVoiceChatResultMA : uint8
{
	Success                                  = 0,
	InvalidState                             = 1,
	NotInitialized                           = 2,
	NotConnected                             = 3,
	NotLoggedIn                              = 4,
	NotPermitted                             = 5,
	Throttled                                = 6,
	InvalidArgument                          = 7,
	CredentialsInvalid                       = 8,
	CredentialsExpired                       = 9,
	ClientTimeout                            = 10,
	ServerTimeout                            = 11,
	DnsFailure                               = 12,
	ConnectionFailure                        = 13,
	ImplementationError                      = 14,
	EVoiceChatResultMA_MAX                   = 15,
};

// Enum Midair2.EMAMatchmakingStatus
// NumValues: 0x0009
enum class EMAMatchmakingStatus : uint8
{
	Started                                  = 0,
	Searching                                = 1,
	TeamFound                                = 2,
	MatchFound                               = 3,
	MatchAssigned                            = 4,
	Cancelled                                = 5,
	Errored                                  = 6,
	NotStarted                               = 7,
	EMAMatchmakingStatus_MAX                 = 8,
};

// Enum Midair2.EMAMidairBranch
// NumValues: 0x0005
enum class EMAMidairBranch : uint8
{
	Live                                     = 0,
	LiveTest                                 = 1,
	Playtest                                 = 2,
	PlaytestTest                             = 3,
	EMAMidairBranch_MAX                      = 4,
};

// Enum Midair2.EPlayerRecordableInputTypes
// NumValues: 0x0016
enum class EPlayerRecordableInputTypes : uint8
{
	Jet                                      = 0,
	Skii                                     = 1,
	Forward                                  = 2,
	Backwards                                = 3,
	Left                                     = 4,
	Right                                    = 5,
	Fire                                     = 6,
	Yaw                                      = 7,
	FlagToss                                 = 8,
	WeaponSlot1                              = 9,
	WeaponSlot2                              = 10,
	WeaponSlot3                              = 11,
	NextWeapon                               = 12,
	PreviousWeapon                           = 13,
	ThrowGrenade                             = 14,
	PlaceBeacon                              = 15,
	StopJet                                  = 16,
	StopSkii                                 = 17,
	StopFire                                 = 18,
	SetPitch                                 = 19,
	SetYaw                                   = 20,
	EPlayerRecordableInputTypes_MAX          = 21,
};

// Enum Midair2.ERouteTrailDifficulty
// NumValues: 0x0005
enum class ERouteTrailDifficulty : uint8
{
	Easy                                     = 0,
	Medium                                   = 1,
	Hard                                     = 2,
	All                                      = 3,
	ERouteTrailDifficulty_MAX                = 4,
};

// Enum Midair2.EDrillBotSpawnType
// NumValues: 0x0004
enum class EDrillBotSpawnType : uint8
{
	Immediate                                = 0,
	SecondsBeforeGrab                        = 1,
	SecondsIntoRoute                         = 2,
	EDrillBotSpawnType_MAX                   = 3,
};

// Enum Midair2.EDrillVictoryType
// NumValues: 0x000A
enum class EDrillVictoryType : uint8
{
	NoFlagCarrier                            = 0,
	FlagCaught                               = 1,
	HitShot                                  = 2,
	TotalKills                               = 3,
	TotalMidairs                             = 4,
	FlagGrabbed                              = 5,
	NoGrab                                   = 6,
	Location                                 = 7,
	MovementSpeed                            = 8,
	EDrillVictoryType_MAX                    = 9,
};

// Enum Midair2.EBotTypes
// NumValues: 0x0007
enum class EBotTypes : uint8
{
	RouteRunner                              = 0,
	StationaryDefense                        = 1,
	Chase                                    = 2,
	StayAtHome                               = 3,
	Offense                                  = 4,
	LO                                       = 5,
	EBotTypes_MAX                            = 6,
};

// Enum Midair2.EBotAccuracyLevels
// NumValues: 0x0004
enum class EBotAccuracyLevels : uint8
{
	Horrible                                 = 0,
	Decent                                   = 1,
	Good                                     = 2,
	Max                                      = 3,
};

// Enum Midair2.EPartyChatType
// NumValues: 0x0003
enum class EPartyChatType : uint8
{
	Global                                   = 0,
	Whisper                                  = 1,
	EPartyChatType_MAX                       = 2,
};

// Enum Midair2.EStatCmp
// NumValues: 0x0006
enum class EStatCmp : uint8
{
	GreaterEqual                             = 0,
	Greater                                  = 1,
	Equal                                    = 2,
	LessEqual                                = 3,
	Less                                     = 4,
	EStatCmp_MAX                             = 5,
};

// Enum Midair2.EMAWidgetInputMode
// NumValues: 0x0005
enum class EMAWidgetInputMode : uint8
{
	Default                                  = 0,
	GameAndMenu                              = 1,
	Game                                     = 2,
	Menu                                     = 3,
	EMAWidgetInputMode_MAX                   = 4,
};

// Enum Midair2.EDeployableUsageState
// NumValues: 0x0004
enum class EDeployableUsageState : uint8
{
	None                                     = 0,
	Added                                    = 1,
	Removed                                  = 2,
	EDeployableUsageState_MAX                = 3,
};

// Enum Midair2.EAugmentType
// NumValues: 0x0004
enum class EAugmentType : uint8
{
	Passive                                  = 0,
	Toggleable                               = 1,
	Triggerable                              = 2,
	EAugmentType_MAX                         = 3,
};

// Enum Midair2.EPresenceTypes
// NumValues: 0x0004
enum class EPresenceTypes : uint8
{
	None                                     = 0,
	Online                                   = 1,
	InGame                                   = 2,
	EPresenceTypes_MAX                       = 3,
};

// Enum Midair2.EVoiceChatTransmitModeMA
// NumValues: 0x0004
enum class EVoiceChatTransmitModeMA : uint8
{
	None                                     = 0,
	All                                      = 1,
	Channel                                  = 2,
	EVoiceChatTransmitModeMA_MAX             = 3,
};

// Enum Midair2.EVoiceChatAttenuationModelMA
// NumValues: 0x0005
enum class EVoiceChatAttenuationModelMA : uint8
{
	None                                     = 0,
	InverseByDistance                        = 1,
	LinearByDistance                         = 2,
	ExponentialByDistance                    = 3,
	EVoiceChatAttenuationModelMA_MAX         = 4,
};

// Enum Midair2.EVoiceChatChannelTypeMA
// NumValues: 0x0004
enum class EVoiceChatChannelTypeMA : uint8
{
	NonPositional                            = 0,
	Positional                               = 1,
	Echo                                     = 2,
	EVoiceChatChannelTypeMA_MAX              = 3,
};

// Enum Midair2.EFindSessionsSortMethod
// NumValues: 0x0008
enum class EFindSessionsSortMethod : uint8
{
	None                                     = 0,
	Default                                  = 1,
	PingAscending                            = 2,
	PlayerCountDescending                    = 3,
	NameAscending                            = 4,
	NameDescending                           = 5,
	SmartPingAndPlayers                      = 6,
	EFindSessionsSortMethod_MAX              = 7,
};

// Enum Midair2.ELeagueMessage
// NumValues: 0x0008
enum class ELeagueMessage : uint8
{
	EpicPass                                 = 0,
	ExcellentPass                            = 1,
	LLamaPass                                = 2,
	LegenendaryPass                          = 3,
	MediocrePass                             = 4,
	SelfPassTimeout                          = 5,
	FlagSlapped                              = 6,
	ELeagueMessage_MAX                       = 7,
};

// Enum Midair2.EPRMessage
// NumValues: 0x0008
enum class EPRMessage : uint8
{
	Respawning                               = 0,
	Evacuating                               = 1,
	KilledSomething                          = 2,
	Progressed                               = 3,
	ProgressedWithTP                         = 4,
	SkippedToLesson                          = 5,
	Finished                                 = 6,
	EPRMessage_MAX                           = 7,
};

// Enum Midair2.ERBMessage
// NumValues: 0x0006
enum class ERBMessage : uint8
{
	CarrotDropped                            = 0,
	CarrotReset                              = 1,
	CarrotTaken                              = 2,
	RabbitKilled                             = 3,
	SelfPassTimeout                          = 4,
	ERBMessage_MAX                           = 5,
};

// Enum Midair2.EPowerupMessage
// NumValues: 0x0003
enum class EPowerupMessage : uint8
{
	PickedUp                                 = 0,
	Expired                                  = 1,
	EPowerupMessage_MAX                      = 2,
};

// Enum Midair2.ETDMMessage
// NumValues: 0x0004
enum class ETDMMessage : uint8
{
	FlagDropped                              = 0,
	FlagPickedup                             = 1,
	RabbitKilled                             = 2,
	ETDMMessage_MAX                          = 3,
};

// Enum Midair2.EGameMessage
// NumValues: 0x001F
enum class EGameMessage : uint8
{
	YouJoinedBlue                            = 0,
	YouJoinedRed                             = 1,
	GameStart                                = 2,
	GameOver                                 = 3,
	GameOverSingle                           = 4,
	RoundOver                                = 5,
	RoundOverDuel                            = 6,
	NoTeamLivesLeft                          = 7,
	LastLiveLeft                             = 8,
	LastManStanding                          = 9,
	MaxDeployables                           = 10,
	VoteStarted                              = 11,
	RebalanceSoon                            = 12,
	RebalanceStarted                         = 13,
	RebalanceEnded                           = 14,
	FlagHeldTooLong                          = 15,
	HasRabbitFlag                            = 16,
	PositionSaved                            = 17,
	PositionLoaded                           = 18,
	FlagReset                                = 19,
	FlagReturned                             = 20,
	FlagDropped                              = 21,
	FlagTaken                                = 22,
	LeagueFlagTaken                          = 23,
	FlagCarrierKilled                        = 24,
	FlagCaptured                             = 25,
	StartOvertime                            = 26,
	GoalScored                               = 27,
	MatchEnds60                              = 28,
	MatchEnds10                              = 29,
	EGameMessage_MAX                         = 30,
};

// Enum Midair2.ESortMatchHistoryPlayersMethod
// NumValues: 0x0010
enum class ESortMatchHistoryPlayersMethod : uint8
{
	None                                     = 0,
	Score                                    = 1,
	Midairs                                  = 2,
	Caps                                     = 3,
	Kills                                    = 4,
	Returns                                  = 5,
	Damage                                   = 6,
	Deaths                                   = 7,
	Assists                                  = 8,
	Evacs                                    = 9,
	Teamkills                                = 10,
	DamageTaken                              = 11,
	FlagHeldTime                             = 12,
	CarrierKills                             = 13,
	FastestGrab                              = 14,
	ESortMatchHistoryPlayersMethod_MAX       = 15,
};

// Enum Midair2.EMAAudioClasses
// NumValues: 0x0006
enum class EMAAudioClasses : uint8
{
	Master                                   = 0,
	Effects                                  = 1,
	Music                                    = 2,
	GameEvents                               = 3,
	Voice                                    = 4,
	EMAAudioClasses_MAX                      = 5,
};

// Enum Midair2.EMACrosshairDotShape
// NumValues: 0x0003
enum class EMACrosshairDotShape : uint8
{
	Circle                                   = 0,
	Square                                   = 1,
	EMACrosshairDotShape_MAX                 = 2,
};

// Enum Midair2.EMappingPriority
// NumValues: 0x0005
enum class EMappingPriority : uint8
{
	None                                     = 0,
	Primary                                  = 1,
	Secondary                                = 2,
	All                                      = 3,
	EMappingPriority_MAX                     = 4,
};

// Enum Midair2.EMappingConflictResolution
// NumValues: 0x0005
enum class EMappingConflictResolution : uint8
{
	KeepOriginal                             = 0,
	KeepNew                                  = 1,
	DiscardBoth                              = 2,
	KeepBoth                                 = 3,
	EMappingConflictResolution_MAX           = 4,
};

// Enum Midair2.FLoadoutItemButtonType
// NumValues: 0x0004
enum class EFLoadoutItemButtonType : uint8
{
	none                                     = 0,
	weapon                                   = 1,
	grenade                                  = 2,
	FLoadoutItemButtonType_MAX               = 3,
};

// Enum Midair2.FCosmeticConfigClass
// NumValues: 0x0006
enum class EFCosmeticConfigClass : uint8
{
	none                                     = 0,
	voice                                    = 1,
	spray                                    = 2,
	weapon                                   = 3,
	armor                                    = 4,
	FCosmeticConfigClass_MAX                 = 5,
};

// Enum Midair2.EMALobbyMatchStatus
// NumValues: 0x0006
enum class EMALobbyMatchStatus : uint8
{
	Initialized                              = 0,
	ReadyCheck                               = 1,
	ServerReady                              = 2,
	Started                                  = 3,
	Completed                                = 4,
	EMALobbyMatchStatus_MAX                  = 5,
};

// Enum Midair2.EMAFramePacingMode
// NumValues: 0x0004
enum class EMAFramePacingMode : uint8
{
	DesktopStyle                             = 0,
	ConsoleStyle                             = 1,
	MobileStyle                              = 2,
	EMAFramePacingMode_MAX                   = 3,
};

// Enum Midair2.EMADisplayablePerformanceStat
// NumValues: 0x0014
enum class EMADisplayablePerformanceStat : uint8
{
	ClientFPS                                = 0,
	ServerFPS                                = 1,
	IdleTime                                 = 2,
	FrameTime                                = 3,
	FrameTime_GameThread                     = 4,
	FrameTime_RenderThread                   = 5,
	FrameTime_RHIThread                      = 6,
	FrameTime_GPU                            = 7,
	Ping                                     = 8,
	PacketLoss_Incoming                      = 9,
	PacketLoss_Outgoing                      = 10,
	PacketRate_Incoming                      = 11,
	PacketRate_Outgoing                      = 12,
	PacketSize_Incoming                      = 13,
	PacketSize_Outgoing                      = 14,
	Latency_Total                            = 15,
	Latency_Game                             = 16,
	Latency_Render                           = 17,
	Count                                    = 18,
	EMADisplayablePerformanceStat_MAX        = 19,
};

// Enum Midair2.EMAStatDisplayMode
// NumValues: 0x0005
enum class EMAStatDisplayMode : uint8
{
	Hidden                                   = 0,
	TextOnly                                 = 1,
	GraphOnly                                = 2,
	TextAndGraph                             = 3,
	EMAStatDisplayMode_MAX                   = 4,
};

// Enum Midair2.ESpectateMode
// NumValues: 0x0003
enum class ESpectateMode : uint32
{
	FreeCam                                  = 0,
	FollowPlayer                             = 1,
	ESpectateMode_MAX                        = 2,
};

// Enum Midair2.RarityType
// NumValues: 0x000C
enum class ERarityType : uint8
{
	Default                                  = 0,
	OwnedLegendary                           = 1,
	OwnedRare                                = 2,
	OwnedUncommon                            = 3,
	OwnedCommon                              = 4,
	Legendary                                = 5,
	Rare                                     = 6,
	Uncommon                                 = 7,
	Common                                   = 8,
	OwnedEpic                                = 9,
	Epic                                     = 10,
	RarityType_MAX                           = 11,
};

// Enum Midair2.EFuzeMode
// NumValues: 0x0004
enum class EFuzeMode : uint8
{
	Timed                                    = 0,
	Impact                                   = 1,
	Proximity                                = 2,
	EFuzeMode_MAX                            = 3,
};

// Enum Midair2.EMAServiceState
// NumValues: 0x0007
enum class EMAServiceState : uint8
{
	None                                     = 0,
	Authenticating                           = 1,
	Authenticated                            = 2,
	Retrying                                 = 3,
	FailedOSS                                = 4,
	FailedService                            = 5,
	EMAServiceState_MAX                      = 6,
};

// Enum Midair2.EMAMatchResultType
// NumValues: 0x0004
enum class EMAMatchResultType : uint8
{
	Lose                                     = 0,
	Win                                      = 1,
	Draw                                     = 2,
	EMAMatchResultType_MAX                   = 3,
};

// Enum Midair2.EMAUserRole
// NumValues: 0x0005
enum class EMAUserRole : uint8
{
	Developer                                = 0,
	Admin                                    = 1,
	Moderator                                = 2,
	Player                                   = 3,
	EMAUserRole_MAX                          = 4,
};

// Enum Midair2.EMASocketRole
// NumValues: 0x0003
enum class EMASocketRole : uint8
{
	Client                                   = 0,
	Server                                   = 1,
	EMASocketRole_MAX                        = 2,
};

// Enum Midair2.ERHIBackend
// NumValues: 0x0004
enum class ERHIBackend : uint8
{
	DX11                                     = 0,
	DX12                                     = 1,
	Vulkan                                   = 2,
	ERHIBackend_MAX                          = 3,
};

// Enum Midair2.EMACrosshairType
// NumValues: 0x0009
enum class EMACrosshairType : uint8
{
	Default                                  = 0,
	Default_No_Outline                       = 1,
	EDot                                     = 2,
	Dot_No_Outline                           = 3,
	Cross                                    = 4,
	Cross_No_Outline                         = 5,
	Circle                                   = 6,
	Bracket                                  = 7,
	EMACrosshairType_MAX                     = 8,
};

// Enum Midair2.EMAGamepadSensitivity
// NumValues: 0x000C
enum class EMAGamepadSensitivity : uint8
{
	Invalid                                  = 0,
	Slow                                     = 1,
	SlowPlus                                 = 2,
	SlowPlusPlus                             = 3,
	Normal                                   = 4,
	NormalPlus                               = 5,
	NormalPlusPlus                           = 6,
	Fast                                     = 7,
	FastPlus                                 = 8,
	FastPlusPlus                             = 9,
	Insane                                   = 10,
	MAX                                      = 11,
};

// Enum Midair2.EMAAllowBackgroundAudioSetting
// NumValues: 0x0004
enum class EMAAllowBackgroundAudioSetting : uint8
{
	Off                                      = 0,
	AllSounds                                = 1,
	Num                                      = 2,
	EMAAllowBackgroundAudioSetting_MAX       = 3,
};

// Enum Midair2.EColorBlindMode
// NumValues: 0x0005
enum class EColorBlindMode : uint8
{
	Off                                      = 0,
	Deuteranope                              = 1,
	Protanope                                = 2,
	Tritanope                                = 3,
	EColorBlindMode_MAX                      = 4,
};

// Enum Midair2.EMAStatsType
// NumValues: 0x0008
enum class EMAStatsType : uint8
{
	BaseStats                                = 0,
	WeaponStats                              = 1,
	GameModeStats                            = 2,
	CTFStats                                 = 3,
	TDMStats                                 = 4,
	RabbitStats                              = 5,
	DuelStats                                = 6,
	EMAStatsType_MAX                         = 7,
};

// Enum Midair2.EDroneMoveMode
// NumValues: 0x0005
enum class EDroneMoveMode : uint8
{
	RandomPatrol                             = 0,
	LinePatrol                               = 1,
	VerticalRand                             = 2,
	Hover                                    = 3,
	EDroneMoveMode_MAX                       = 4,
};

// Enum Midair2.ETargetDroneBaseVariant
// NumValues: 0x0004
enum class ETargetDroneBaseVariant : uint8
{
	Default                                  = 0,
	Blue                                     = 1,
	Pink                                     = 2,
	ETargetDroneBaseVariant_MAX              = 3,
};

// Enum Midair2.ETargetDroneVariant
// NumValues: 0x0004
enum class ETargetDroneVariant : uint8
{
	Default                                  = 0,
	Red                                      = 1,
	BlackAndGold                             = 2,
	ETargetDroneVariant_MAX                  = 3,
};

// Enum Midair2.EPattern
// NumValues: 0x0007
enum class EPattern : uint8
{
	Stay                                     = 0,
	Offset                                   = 1,
	None                                     = 2,
	Up                                       = 3,
	Down                                     = 4,
	Random                                   = 5,
	EPattern_MAX                             = 6,
};

// Enum Midair2.EAIFlagStates
// NumValues: 0x0005
enum class EAIFlagStates : uint8
{
	BothFlagsHome                            = 0,
	EnemyFlagTakenFriendlySafe               = 1,
	FriendlyTakenEnemyHome                   = 2,
	Standoff                                 = 3,
	EAIFlagStates_MAX                        = 4,
};

// Enum Midair2.EAIMoveTargetTypes
// NumValues: 0x0008
enum class EAIMoveTargetTypes : uint8
{
	EnemyFlag                                = 0,
	FriendlyFlag                             = 1,
	EnemyTarget                              = 2,
	EnemyStand                               = 3,
	FriendlyStand                            = 4,
	RouteStart                               = 5,
	SpecificLocation                         = 6,
	EAIMoveTargetTypes_MAX                   = 7,
};

// Enum Midair2.EAIRouteState
// NumValues: 0x0006
enum class EAIRouteState : uint8
{
	NoRouteSelected                          = 0,
	MovingToRouteStart                       = 1,
	RunningRoute                             = 2,
	AbandonedRoute                           = 3,
	RouteFinished                            = 4,
	EAIRouteState_MAX                        = 5,
};

// Enum Midair2.EAIStates
// NumValues: 0x0008
enum class EAIStates : uint8
{
	LookingForEnemy                          = 0,
	ShootAtTarget                            = 1,
	WaitForBetterShot                        = 2,
	ChangeTarget                             = 3,
	MoveToTarget                             = 4,
	RunningRoute                             = 5,
	RouteRunner                              = 6,
	EAIStates_MAX                            = 7,
};

// Enum Midair2.EPracticeRouteTrailHitDifficulty
// NumValues: 0x0004
enum class EPracticeRouteTrailHitDifficulty : uint8
{
	Easy                                     = 0,
	Medium                                   = 1,
	Expert                                   = 2,
	EPracticeRouteTrailHitDifficulty_MAX     = 3,
};

// Enum Midair2.EPracticeMenuDataTypes
// NumValues: 0x0013
enum class EPracticeMenuDataTypes : uint8
{
	RouteNames                               = 0,
	RouteName                                = 1,
	RouteDescription                         = 2,
	GrabTime                                 = 3,
	CaptureTime                              = 4,
	TotalTime                                = 5,
	GrabSpeed                                = 6,
	CaptureSpeed                             = 7,
	MaxSpeed                                 = 8,
	AverageSpeed                             = 9,
	TotalMarkers                             = 10,
	HitMarkers                               = 11,
	TimeToGrab                               = 12,
	DrillName                                = 13,
	DrillDescription                         = 14,
	DrillNumberBots                          = 15,
	DrillLength                              = 16,
	DrillSpawnDelay                          = 17,
	EPracticeMenuDataTypes_MAX               = 18,
};

// Enum Midair2.EMAWeaponActivity
// NumValues: 0x0011
enum class EMAWeaponActivity : uint8
{
	WEAP_None                                = 0,
	WEAP_TakeOut                             = 1,
	WEAP_PowerUp                             = 2,
	WEAP_Idle                                = 3,
	WEAP_DryFire                             = 4,
	WEAP_Firing                              = 5,
	WEAP_Overheated                          = 6,
	WEAP_Reloading                           = 7,
	WEAP_Charging                            = 8,
	WEAP_Overcharged                         = 9,
	WEAP_Overloaded                          = 10,
	WEAP_Fizzle                              = 11,
	WEAP_Custom1                             = 12,
	WEAP_Custom2                             = 13,
	WEAP_Custom3                             = 14,
	WEAP_Custom4                             = 15,
	WEAP_MAX                                 = 16,
};

// Enum Midair2.ESliderPresentationStyle
// NumValues: 0x0004
enum class ESliderPresentationStyle : uint8
{
	DoNotDisplay                             = 0,
	DisplayAsInt                             = 1,
	DisplayAsFloat                           = 2,
	ESliderPresentationStyle_MAX             = 3,
};

// Enum Midair2.EObjectiveUpdateType
// NumValues: 0x0009
enum class EObjectiveUpdateType : uint8
{
	Nothing                                  = 0,
	ClearAll                                 = 1,
	ReplaceAll                               = 2,
	CompleteObjective                        = 3,
	CompleteObjectiveWithText                = 4,
	Append                                   = 5,
	RemoveLine                               = 6,
	Replace                                  = 7,
	EObjectiveUpdateType_MAX                 = 8,
};

// Enum Midair2.EArmorSize
// NumValues: 0x0004
enum class EArmorSize : uint8
{
	Light                                    = 0,
	Medium                                   = 1,
	Heavy                                    = 2,
	Max                                      = 3,
};

// Enum Midair2.ESensorResolutionStrength
// NumValues: 0x0005
enum class ESensorResolutionStrength : uint8
{
	None                                     = 0,
	Low                                      = 1,
	Medium                                   = 2,
	High                                     = 3,
	ESensorResolutionStrength_MAX            = 4,
};

// Enum Midair2.ESensorTrackingType
// NumValues: 0x0004
enum class ESensorTrackingType : uint8
{
	None                                     = 0,
	Radar                                    = 1,
	Motion                                   = 2,
	ESensorTrackingType_MAX                  = 3,
};

// Enum Midair2.EMapVoteOption
// NumValues: 0x000C
enum class EMapVoteOption : uint8
{
	Map1                                     = 0,
	Map2                                     = 1,
	Map3                                     = 2,
	Map4                                     = 3,
	Map5                                     = 4,
	Random                                   = 5,
	Mode1                                    = 6,
	Mode2                                    = 7,
	Mode3                                    = 8,
	Refresh                                  = 9,
	Discard                                  = 10,
	EMapVoteOption_MAX                       = 11,
};

// Enum Midair2.EMapVoteStage
// NumValues: 0x0005
enum class EMapVoteStage : uint8
{
	NotVoting                                = 0,
	FirstRound                               = 1,
	SecondRound                              = 2,
	Taken                                    = 3,
	EMapVoteStage_MAX                        = 4,
};

// Enum Midair2.ESimpleVote
// NumValues: 0x0004
enum class ESimpleVote : uint8
{
	Abstain                                  = 0,
	Yes                                      = 1,
	No                                       = 2,
	ESimpleVote_MAX                          = 3,
};

// Enum Midair2.EPlayerVoiceState
// NumValues: 0x0004
enum class EPlayerVoiceState : uint8
{
	Silent                                   = 0,
	Talking                                  = 1,
	Muted                                    = 2,
	EPlayerVoiceState_MAX                    = 3,
};

// Enum Midair2.EPowerupSize
// NumValues: 0x0004
enum class EPowerupSize : uint8
{
	PWSIZE_SMALL                             = 0,
	PWSIZE_MEDIUM                            = 1,
	PWSIZE_LARGE                             = 2,
	PWSIZE_MAX                               = 3,
};

// Enum Midair2.EPowerupTypes
// NumValues: 0x000C
enum class EPowerupTypes : uint8
{
	PWER_NONE                                = 0,
	PWER_HEALTHSMALL                         = 1,
	PWER_HEALTH                              = 2,
	PWER_HEALTHLARGE                         = 3,
	PWER_AMMO                                = 4,
	PWER_IMPULSE                             = 5,
	PWER_ENERGY                              = 6,
	PWER_HOT                                 = 7,
	PWER_DAMAGE                              = 8,
	PWER_SHOTGUN                             = 9,
	PWER_RANDOM                              = 10,
	PWER_MAX                                 = 11,
};

// Enum Midair2.ECameraMode
// NumValues: 0x0006
enum class ECameraMode : uint8
{
	None                                     = 0,
	FirstPerson                              = 1,
	ShoulderCamera                           = 2,
	OrbitCamera                              = 3,
	Freelook                                 = 4,
	ECameraMode_MAX                          = 5,
};

// Enum Midair2.ELockState
// NumValues: 0x0005
enum class ELockState : uint8
{
	Unlocked                                 = 0,
	Locking                                  = 1,
	Locked                                   = 2,
	Tracking                                 = 3,
	ELockState_MAX                           = 4,
};

// Enum Midair2.EDetectedState
// NumValues: 0x0005
enum class EDetectedState : uint8
{
	Undetected                               = 0,
	Jamming                                  = 1,
	Sensed                                   = 2,
	Detected                                 = 3,
	EDetectedState_MAX                       = 4,
};

// Enum Midair2.ETeamAllegiance
// NumValues: 0x0004
enum class ETeamAllegiance : uint8
{
	Neutral                                  = 0,
	Friendly                                 = 1,
	Enemy                                    = 2,
	ETeamAllegiance_MAX                      = 3,
};

// Enum Midair2.EDefinedItemType
// NumValues: 0x0009
enum class EDefinedItemType : uint8
{
	Invalid                                  = 0,
	Gameplay                                 = 1,
	ArmorSkins                               = 2,
	WeaponSkins                              = 3,
	VoicePacks                               = 4,
	JetTrails                                = 5,
	GoalEffects                              = 6,
	Sprays                                   = 7,
	EDefinedItemType_MAX                     = 8,
};

// Enum Midair2.EPunishType
// NumValues: 0x0003
enum class EPunishType : uint8
{
	Kick                                     = 0,
	Ban                                      = 1,
	EPunishType_MAX                          = 2,
};

// Enum Midair2.ETeamId
// NumValues: 0x0004
enum class ETeamId : uint8
{
	Manatech                                 = 0,
	Arcturus                                 = 1,
	Spectator                                = 255,
	ETeamId_MAX                              = 256,
};

// Enum Midair2.EShieldType
// NumValues: 0x0003
enum class EShieldType : uint8
{
	Subtractive                              = 0,
	Overshield                               = 1,
	EShieldType_MAX                          = 2,
};

// Enum Midair2.ENetDeathType
// NumValues: 0x0004
enum class ENetDeathType : uint8
{
	TearOff                                  = 0,
	Revivable                                = 1,
	None                                     = 2,
	ENetDeathType_MAX                        = 3,
};

// Enum Midair2.ELevelSymmetryMode
// NumValues: 0x0005
enum class ELevelSymmetryMode : uint8
{
	None                                     = 0,
	MirrorX                                  = 1,
	MirrorY                                  = 2,
	Rotate                                   = 3,
	ELevelSymmetryMode_MAX                   = 4,
};

// Enum Midair2.ESplineFinishAction
// NumValues: 0x0003
enum class ESplineFinishAction : uint8
{
	DestroyActor                             = 0,
	SwitchDirection                          = 1,
	ESplineFinishAction_MAX                  = 2,
};

// Enum Midair2.EFunctionSuccess
// NumValues: 0x0003
enum class EFunctionSuccess : uint8
{
	Success                                  = 0,
	Fail                                     = 1,
	EFunctionSuccess_MAX                     = 2,
};

// Enum Midair2.ELessonWinCondition
// NumValues: 0x0005
enum class ELessonWinCondition : uint8
{
	Kills                                    = 0,
	Score                                    = 1,
	MidairHits                               = 2,
	ReachedActor                             = 3,
	ELessonWinCondition_MAX                  = 4,
};

// Enum Midair2.ELessonEndAction
// NumValues: 0x0006
enum class ELessonEndAction : uint8
{
	None                                     = 0,
	MovePlayerToLessonStart                  = 1,
	MovePlayerToNextLesson                   = 2,
	MovePlayerToCustomLesson                 = 3,
	EndSection                               = 4,
	ELessonEndAction_MAX                     = 5,
};

// Enum Midair2.EDialougeStackingRules
// NumValues: 0x0005
enum class EDialougeStackingRules : uint8
{
	DontStack                                = 0,
	Replace_leq_Priority                     = 1,
	ReplaceAll                               = 2,
	Enqueue                                  = 3,
	EDialougeStackingRules_MAX               = 4,
};

// Enum Midair2.EComplexStatusBarFillType
// NumValues: 0x0003
enum class EComplexStatusBarFillType : uint8
{
	AdditionalValue                          = 0,
	SubValue                                 = 1,
	EComplexStatusBarFillType_MAX            = 2,
};

// Enum Midair2.EStatsType
// NumValues: 0x0003
enum class EStatsType : uint8
{
	Int32                                    = 0,
	Float                                    = 1,
	EStatsType_MAX                           = 2,
};

// Enum Midair2.EEdgeLockBehavior
// NumValues: 0x0004
enum class EEdgeLockBehavior : uint8
{
	Never                                    = 0,
	Always                                   = 1,
	Timed                                    = 2,
	EEdgeLockBehavior_MAX                    = 3,
};

// Enum Midair2.ETargetPlacement
// NumValues: 0x0004
enum class ETargetPlacement : uint8
{
	Above                                    = 0,
	Centered                                 = 1,
	Below                                    = 2,
	ETargetPlacement_MAX                     = 3,
};

// Enum Midair2.EAttachPerspective
// NumValues: 0x0004
enum class EAttachPerspective : uint8
{
	Both                                     = 0,
	FirstPerson                              = 1,
	ThirdPerson                              = 2,
	EAttachPerspective_MAX                   = 3,
};

// ScriptStruct Midair2.MA_PortStruct
// 0x0018 (0x0018 - 0x0000)
struct FMA_PortStruct final
{
public:
	int32                                         InternalPort;                                      // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExternalPort;                                      // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 protocol;                                          // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMA_PortStruct;

// ScriptStruct Midair2.MA_LocationStruct
// 0x0050 (0x0050 - 0x0000)
struct FMA_LocationStruct final
{
public:
	class FString                                 City;                                              // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Country;                                           // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Continent;                                         // 0x0020(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdministrativeDivision;                            // 0x0030(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Timezone;                                          // 0x0040(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMA_LocationStruct;

// ScriptStruct Midair2.MA_AssignmentStruct
// 0x00C0 (0x00C0 - 0x0000)
struct FMA_AssignmentStruct final
{
public:
	bool                                          bIsNullOrEmpty;                                    // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FQDN;                                              // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PublicIP;                                          // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMA_PortStruct                         GamePort;                                          // 0x0028(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMA_PortStruct                         QueryPort;                                         // 0x0040(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMA_PortStruct                         SteamPort;                                         // 0x0058(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMA_LocationStruct                     Location;                                          // 0x0070(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMA_AssignmentStruct;

// ScriptStruct Midair2.HitMarkerInfo
// 0x0018 (0x0018 - 0x0000)
struct FHitMarkerInfo final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Damage;                                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCriticalHit : 1;                                  // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTeamHit : 1;                                      // 0x0008(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlive : 1;                                        // 0x0008(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MaterialInstance;                                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHitMarkerInfo;

// ScriptStruct Midair2.TakeHitInfo
// 0x0020 (0x0020 - 0x0000)
struct FTakeHitInfo final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         RelHitDirectionPitch;                              // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         RelHitDirectionYaw;                                // 0x0005(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RelHitLocationDist;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bShielded : 1;                                     // 0x000C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFatal : 1;                                        // 0x000C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UDamageType>                DamageTypeClass;                                   // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         EnsureReplicationByte;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTakeHitInfo;

// ScriptStruct Midair2.MAHathoraServerPort
// 0x0038 (0x0038 - 0x0000)
struct FMAHathoraServerPort final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TransportType;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Host;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMAHathoraServerPort;

// ScriptStruct Midair2.MAHathoraServerConfig
// 0x0030 (0x0030 - 0x0000)
struct FMAHathoraServerConfig final
{
public:
	class FString                                 GameMode;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Map;                                               // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Admin;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMAHathoraServerConfig;

// ScriptStruct Midair2.MAHathoraServer
// 0x00A0 (0x00A0 - 0x0000)
struct FMAHathoraServer final
{
public:
	class FString                                 RoomId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMAMidairBranch                               Branch;                                            // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ProcessId;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Status;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMAHathoraServerPort                   ExposedPort;                                       // 0x0038(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FMAHathoraServerConfig                 config;                                            // 0x0070(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMAHathoraServer;

// ScriptStruct Midair2.MatchWeaponStats
// 0x0014 (0x0014 - 0x0000)
struct FMatchWeaponStats final
{
public:
	int32                                         deaths;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         kills;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         shotsFired;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         shotsHit;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         accuracy;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMatchWeaponStats;

// ScriptStruct Midair2.MatchResults_Player
// 0x0128 (0x0128 - 0x0000)
struct FMatchResults_Player final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Time;                                              // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         score;                                             // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Team;                                              // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         kills;                                             // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         deaths;                                            // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         assists;                                           // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         evacuations;                                       // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         teamKills;                                         // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         damageTaken;                                       // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         damageDealt;                                       // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         midairHits;                                        // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         midairsHitBy;                                      // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         midairKills;                                       // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x24];                                      // 0x0054(0x0024)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMatchWeaponStats>              blasterStats;                                      // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FMatchWeaponStats>              chaingunStats;                                     // 0x0088(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FMatchWeaponStats>              grenadeLauncherStats;                              // 0x0098(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FMatchWeaponStats>              plasmaGunStats;                                    // 0x00A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FMatchWeaponStats>              railGunStats;                                      // 0x00B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FMatchWeaponStats>              tempestStats;                                      // 0x00C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         flagCaptures;                                      // 0x00D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         flagCaptureAssists;                                // 0x00DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         flagReturns;                                       // 0x00E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         flagGrabs;                                         // 0x00E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         flagPasses;                                        // 0x00E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         flagsCaught;                                       // 0x00EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         flagInterceptionReturns;                           // 0x00F0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         flagInterceptionThrows;                            // 0x00F4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         flagSlidingReturns;                                // 0x00F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         flagPickups;                                       // 0x00FC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         flagHeldTime;                                      // 0x0100(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         carrierKills;                                      // 0x0104(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
