#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Midair2

#include "Basic.hpp"

#include "LootLockerSDK_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Midair2_structs.hpp"
#include "AIModule_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "DeveloperSettings_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CommonUI_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "CommonGame_classes.hpp"
#include "ModularGameplay_classes.hpp"
#include "SimpleUGC_classes.hpp"
#include "GameSettings_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class Midair2.GetCurrentLadderPlayerAsyncTask
// 0x0020 (0x0050 - 0x0030)
class UGetCurrentLadderPlayerAsyncTask final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FMALadderPlayer& LadderPlayer)> OnSuccess;            // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FMALadderPlayer& LadderPlayer)> OnFail;               // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UGetCurrentLadderPlayerAsyncTask* GetCurrentLadderPlayer();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GetCurrentLadderPlayerAsyncTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GetCurrentLadderPlayerAsyncTask")
	}
	static class UGetCurrentLadderPlayerAsyncTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGetCurrentLadderPlayerAsyncTask>();
	}
};
DUMPER7_ASSERTS_UGetCurrentLadderPlayerAsyncTask;

// Class Midair2.MACharacterMovement
// 0x0130 (0x0C30 - 0x0B00)
class UMACharacterMovement final : public UCharacterMovementComponent
{
public:
	float                                         JetAcceleration;                                   // 0x0B00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkateAcceleration;                                 // 0x0B04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSkateAccelerationSpeed;                         // 0x0B08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxJetLateralSpeed;                                // 0x0B0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxJetLateralPercent;                              // 0x0B10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B14[0x4];                                      // 0x0B14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            LateralJetCurve;                                   // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxJetVerticalSpeedStart;                          // 0x0B20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxJetVerticalSpeedEnd;                            // 0x0B24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpwardJetBonusMaxSpeed;                            // 0x0B28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxUpwardJetBonus;                                 // 0x0B2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpwardJetBonusRegenRate;                           // 0x0B30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpwardJetBonusWalkingBonusRegenRate;               // 0x0B34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpwardJetBonusRegenWaitTime;                       // 0x0B38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpwardJetBonusBurnRate;                            // 0x0B3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpwardJetBurnPower;                                // 0x0B40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B44[0x4];                                      // 0x0B44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            UpwardJetBonusModifierCurve;                       // 0x0B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSeparateSkateJumpVelocity;                        // 0x0B50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B51[0x3];                                      // 0x0B51(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SkateJumpZVelocity;                                // 0x0B54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         JetModifier;                                       // 0x0B58(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                JetBonus;                                          // 0x0B5C(0x000C)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxFallingLateralSpeed;                            // 0x0B68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpwardsDamping;                                    // 0x0B6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpwardsDampingSpeed;                               // 0x0B70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxUpwardsSpeed;                                   // 0x0B74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B78[0x10];                                     // 0x0B78(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AMACharacter*                           MACharacterOwner;                                  // 0x0B88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B90[0x4];                                      // 0x0B90(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UpwardJetBonusEnergy;                              // 0x0B94(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeSinceLastUpwardJetBonus;                       // 0x0B98(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B9C[0x94];                                     // 0x0B9C(0x0094)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MAClientAdjustEnergy(float Energy);
	void MAServerMove(const struct FMAPackedMoveBundle& Bundle);

	bool IsSkatingOnGround() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MACharacterMovement")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MACharacterMovement")
	}
	static class UMACharacterMovement* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMACharacterMovement>();
	}
};
DUMPER7_ASSERTS_UMACharacterMovement;

// Class Midair2.ActivatableObject
// 0x0000 (0x0000 - 0x0000)
class IActivatableObject final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActivatableObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActivatableObject")
	}
	static class IActivatableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IActivatableObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IActivatableObject;

// Class Midair2.MAPlatformEmulationSettings
// 0x0058 (0x0090 - 0x0038)
class UMAPlatformEmulationSettings final : public UDeveloperSettingsBackedByCVars
{
public:
	struct FGameplayTagContainer                  AdditionalPlatformTraitsToEnable;                  // 0x0038(0x0020)(Edit, Config, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                  AdditionalPlatformTraitsToSuppress;                // 0x0058(0x0020)(Edit, Config, NativeAccessSpecifierPrivate)
	class FName                                   PretendPlatform;                                   // 0x0078(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   PretendBaseDeviceProfile;                          // 0x0080(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bApplyFrameRateSettingsInPIE;                      // 0x0088(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bApplyFrontEndPerformanceOptionsInPIE;             // 0x0089(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bApplyDeviceProfilesInPIE;                         // 0x008A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FName> GetKnownDeviceProfiles() const;
	TArray<class FName> GetKnownPlatformIds() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MAPlatformEmulationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MAPlatformEmulationSettings")
	}
	static class UMAPlatformEmulationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMAPlatformEmulationSettings>();
	}
};
DUMPER7_ASSERTS_UMAPlatformEmulationSettings;

// Class Midair2.AIPlayerController
// 0x02F8 (0x0628 - 0x0330)
class AAIPlayerController : public AAIController
{
public:
	uint8                                         Pad_330[0x8];                                      // 0x0330(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMABotConfig                           BC;                                                // 0x0338(0x0168)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UMABotAIComponent*                      BotAIComponent;                                    // 0x04A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A8[0x168];                                    // 0x04A8(0x0168)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAPracticeComponent*                   PracticeComponent;                                 // 0x0610(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMACharacter*                           ControlledCharacter;                               // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_620[0x8];                                      // 0x0620(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PlayRecordedCameraInput(float Pitch, float Yaw);
	void PlayRecordedInput(EPlayerRecordableInputTypes InputType);
	void ServerEvacuate();
	void ServerRespawnBot();

	class AMACharacter* GetControlledCharacter() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AIPlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AIPlayerController")
	}
	static class AAIPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIPlayerController>();
	}
};
DUMPER7_ASSERTS_AAIPlayerController;

// Class Midair2.DrillVictoryLocation
// 0x0048 (0x0270 - 0x0228)
class ADrillVictoryLocation : public AActor
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0228(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_230[0x38];                                     // 0x0230(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      Collision;                                         // 0x0268(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DrillVictoryLocation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DrillVictoryLocation")
	}
	static class ADrillVictoryLocation* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADrillVictoryLocation>();
	}
};
DUMPER7_ASSERTS_ADrillVictoryLocation;

// Class Midair2.AMenuBuilder
// 0x0010 (0x0238 - 0x0228)
class AAMenuBuilder final : public AActor
{
public:
	class UCustomMenuUserWidget*                  menu;                                              // 0x0228(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVerticalBox*                           menubox;                                           // 0x0230(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AMenuBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AMenuBuilder")
	}
	static class AAMenuBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAMenuBuilder>();
	}
};
DUMPER7_ASSERTS_AAMenuBuilder;

// Class Midair2.MAPlayerControllerBase
// 0x01A0 (0x0730 - 0x0590)
class AMAPlayerControllerBase : public APlayerController
{
public:
	uint8                                         Pad_590[0x8];                                      // 0x0590(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DesiredFOV;                                        // 0x0598(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FrameRateCap;                                      // 0x059C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bScorePointsShownToPlayer;                         // 0x05A0(0x0001)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSpectateStayWithOnePlayer;                        // 0x05A1(0x0001)(BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A2[0x6];                                      // 0x05A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UChatWidget>                ChatWidgetClass;                                   // 0x05A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MaxMessageRate;                                    // 0x05B0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SpamCooloffTime;                                   // 0x05B4(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ExpressionRateCost;                                // 0x05B8(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ChatRateCost;                                      // 0x05BC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RemainingSpamCooloff;                              // 0x05C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFinalizedPlayerInventory;                         // 0x05C4(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          GlobalChatInput;                                   // 0x05C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TeamChatInput;                                     // 0x05C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PartyChatInput;                                    // 0x05C7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PlayerExpressionInput;                             // 0x05C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   LastExpressionKey;                                 // 0x05D0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LastExpressionValid;                               // 0x05E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E9[0xF];                                      // 0x05E9(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMALoadout                             SteamSerializedLoadout;                            // 0x05F8(0x00B8)(Transient, Protected, NativeAccessSpecifierProtected)
	class UAudioComponent*                        LastAnnouncerExpressionAudio;                      // 0x06B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UChatWidget*                            ChatWidget;                                        // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUserWidget*                            XPLevelingWidget;                                  // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C8[0x68];                                     // 0x06C8(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClientDoExpression(class APlayerState* Speaker, int32 MessageType);
	void ClientGivenXP(int32 XP, bool bHasLevelupReward);
	void ClientInventoryFinalized();
	void ClientPlaySingleSound2D(class USoundBase* Sound, float start_offset, class USoundConcurrency* conc);
	void ClientPlaySound2D(class USoundBase* Sound);
	void ClientRefreshProgression();
	void ClientSay(class APlayerState* Speaker, const class FString& Message, bool bTeamOnly);
	void DebugCrashGame();
	void DoExpression(int32 MessageType);
	void EndQuickVoice();
	void GiveXP(int32 Amount);
	void InvertMouse(bool bInvert);
	void RefreshSteamInventory();
	void ResetAllSteamData();
	void SaveGeneralSettings();
	void Say(const class FString& Message, bool bTeamOnly);
	void ServerDoExpression(int32 MessageType);
	void ServerSay(const class FString& Message, bool bTeamOnly);
	void ServerUpdateUserUnlocks();
	void SetMouseSensitivity(const float Sensitivity);
	void SetMouseSensitivityToDefault();
	bool ToggleMenu();

	bool GetIsFinalizedPlayerInventory() const;
	class UMALocalPlayer* GetMALocalPlayer() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MAPlayerControllerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MAPlayerControllerBase")
	}
	static class AMAPlayerControllerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMAPlayerControllerBase>();
	}
};
DUMPER7_ASSERTS_AMAPlayerControllerBase;

// Class Midair2.MAPlayerController
// 0x04A0 (0x0BD0 - 0x0730)
class AMAPlayerController : public AMAPlayerControllerBase
{
public:
	uint8                                         Pad_730[0x8];                                      // 0x0730(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatchXPConversion                     MatchXPConversion_TEMP;                            // 0x0738(0x0028)(Edit, Config, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         ActionDistance;                                    // 0x0760(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_764[0x1C];                                     // 0x0764(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	class AMAPlayerState*                         LastSpectatedPlayerState;                          // 0x0780(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FReplicatedDemoMessage                 DemoMessageRep;                                    // 0x0788(0x0048)(Net, RepNotify, NativeAccessSpecifierPublic)
	struct FMATeam                                Team;                                              // 0x07D0(0x0050)(BlueprintVisible, BlueprintReadOnly, Net, NativeAccessSpecifierPublic)
	class AMACharacter*                           ACChararacter;                                     // 0x0820(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_828[0x8];                                      // 0x0828(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AMACharacter>               LightACCharacterBluePrintClass;                    // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_838[0x4];                                      // 0x0838(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsTournamentModeEnabled;                          // 0x083C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPracticeModeEnabled;                            // 0x083D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_83E[0x2];                                      // 0x083E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ServerDisablePawnRelatedInputRequests;             // 0x0840(0x0010)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         DisablePawnRelatedInputRequests;                   // 0x0850(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UInputComponent*                        CharacterInput;                                    // 0x0860(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputComponent*                        VehicleInput;                                      // 0x0868(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInputComponent*                        SpectatorInput;                                    // 0x0870(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<ELockState, class USoundBase*>           LockStateLoops;                                    // 0x0878(0x0050)(Edit, EditFixedSize, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_8C8[0x8];                                      // 0x08C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        LockStateLoopComponent;                            // 0x08D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AMACharacter*                           SpectateCharacter;                                 // 0x08D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerState*                           LastPlayerState;                                   // 0x08E0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESpectateMode                                 CurrentSpectateMode;                               // 0x08E8(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECameraMode                                   CameraMode;                                        // 0x08EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECameraMode                                   PreviousCameraMode;                                // 0x08ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8EE[0x2];                                      // 0x08EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OrbitCameraPressTime;                              // 0x08F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8F4[0x2C];                                     // 0x08F4(0x002C)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraDistPct;                                     // 0x0920(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_924[0x1C];                                     // 0x0924(0x001C)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ActionActor;                                       // 0x0940(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WindMaxSpeed;                                      // 0x0948(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLoadoutSet;                                       // 0x094C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_94D[0x3];                                      // 0x094D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMACharacter*                           ControlledCharacter;                               // 0x0950(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAudioComponent*                        WindAudioLoop;                                     // 0x0958(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AMACharacter*                           LastControlledCharacter;                           // 0x0960(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 PreviousKiller;                                    // 0x0968(0x0008)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class AActor>                     MatchEndClass;                                     // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CachedCameraTotalTrackTime;                        // 0x0978(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_97C[0x4];                                      // 0x097C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 PatchData;                                         // 0x0980(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	float                                         TimeSinceGotoTime;                                 // 0x0990(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_994[0x4];                                      // 0x0994(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(float PowerupLength, const class FString& PowerupName)> OnPlayerGotPowerup; // 0x0998(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnKicked;                                          // 0x09A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_9B8[0x8];                                      // 0x09B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CurrentVote;                                       // 0x09C0(0x0010)(BlueprintVisible, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DesiredPredictionPing;                             // 0x09D0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPredictionPing;                                 // 0x09D4(0x0004)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9D8[0x48];                                     // 0x09D8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SmoothedRTT;                                       // 0x0A20(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastPingTime;                                      // 0x0A24(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastDeathTime;                                     // 0x0A28(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraTrackRate;                                   // 0x0A2C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraTrackBodyAndKillerTime;                      // 0x0A30(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraTrackKillerTime;                             // 0x0A34(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraTotalTrackTime;                              // 0x0A38(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraTrackBodyBias;                               // 0x0A3C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceBodyTooCloseToCamera;                      // 0x0A40(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraAngleIgnoreBodyAbove;                        // 0x0A44(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraIdealDistanceFromBlockers;                   // 0x0A48(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CameraNumberOfAxesChecks;                          // 0x0A4C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AMAProjectile*>                  FakeProjectiles;                                   // 0x0A50(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         DemoHZ;                                            // 0x0A60(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ServerHZ;                                          // 0x0A64(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCharacterInfo>             CurrentCharacterClass;                             // 0x0A68(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMALoadout                             PlayerLoadout;                                     // 0x0A70(0x00B8)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	bool                                          bToggleSkate;                                      // 0x0B28(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMenuWantsEquipKeys;                               // 0x0B29(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2A[0xA];                                      // 0x0B2A(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ExtraDirectHitImpulsePercent;                      // 0x0B34(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMAVoteComponent*                       VoteComponent;                                     // 0x0B38(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsDemoController;                                 // 0x0B40(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B41[0x7];                                      // 0x0B41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAPracticeComponent*                   PracticeComponent;                                 // 0x0B48(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B50[0x8];                                      // 0x0B50(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TeamTags;                                          // 0x0B58(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentVoiceChannelName;                           // 0x0B68(0x0010)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B78[0x20];                                     // 0x0B78(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture2D*>                     DamageNumberTextures;                              // 0x0B98(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         DamageNumberFx;                                    // 0x0BA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BB0[0x10];                                     // 0x0BB0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LastRTTSendTime;                                   // 0x0BC0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LastRTTSentMs;                                     // 0x0BC4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RTTSendInterval;                                   // 0x0BC8(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RTTChangeThresholdMs;                              // 0x0BCC(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static TArray<class UObject*> LoadTeamAvatars(const class FString& PathFromContentFolder, class UClass* AssetClass, bool LoadFromSubfolders);

	void AdminLogin(const class FString& Password);
	void BlockPlayerFromTalking(const class FString& PlayerUniqueNetId);
	void ChangeMap(const class FString& mapName);
	void ChangeScoreboard(bool bShow);
	void ChangeTeam(ETeamId DesiredTeam);
	void ClearDeathEffects();
	void ClientBeginAchTracking();
	void ClientDisplayGameModeFlags(bool bIsTournyModeEnabled, bool bIsPracModeEnabled);
	void ClientEndAchTracking();
	void ClientForceReplicateActor(class AActor* Actor, const TArray<class FString>& PropNames, const TArray<uint8>& Data);
	void ClientForceReplicateClass(const TArray<uint8>& Data, const class FString& PackName);
	void ClientForceReplicateComponent(class USceneComponent* SC, const TArray<class FString>& PropNames, const TArray<uint8>& Data);
	void ClientFunction(uint64 S, uint64 cv);
	void ClientNotifyMapChange(const class FString& mapName);
	void ClientPlayerKicked(const class FString& KickReason, float TimeRemaining);
	void ClientReceiveDeathMessage(const struct FDeathMessageData& DeathMessageData);
	void ClientRefreshCheckpointMaterials(int32 PrevIdx, int32 NextIdx);
	void ClientSetCheckpointColor(const struct FLinearColor& NewColor, class AMATrackCheckpoint* Checkpoint);
	void ClientSetDeathTime();
	void ClientSetDirectHitImpulseBonus(float ExtraImpulsePercent);
	void ClientSetPattern(EPattern PatternToSet);
	void ClientSuggestRequeue();
	void ClientTACForPlayer();
	void ClientTempPatch(const TArray<uint8>& Data, const class FString& PlatformName, int32 Offset);
	void ClientUpdateDirectionArrows(int32 NextCheckpointIdx);
	void ClientUpdateStatDelta(class FName StatId, int32 Delta);
	void ClientUpdateStatDeltas(const TArray<struct FMAStatDelta>& Deltas);
	void EnablePracticeMode(bool bIsEnabled);
	void EnableTournamentMode(bool bIsEnabled);
	void EnterTemporarySpectate();
	struct FRotator GetEffectiveControlRotation();
	float GetFlagHoldDuration();
	TArray<struct FMALoadout> GetPlayerLoadouts();
	void HandleMenu();
	void HideEmoteWheel();
	void HideEndOfMatch();
	void HideScoreboard();
	bool IsUserTalking(const class FString& PlayerUniqueNetId);
	bool IsVoicePlayerMuted(const class FString& PlayerUniqueNetId);
	void JoinVoiceChannel(const class FString& InChannelName, const class FString& InChannelCredentials);
	void OnRep_DemoMessage();
	void OnRep_PlayerLoadout();
	void OnRep_ServerDisablePawnRelatedInputRequests();
	void OpenEmoteWheel();
	void PickedupPowerup(float PowerupLength, const class FString& PowerupName);
	void PlayRecordedCameraInput(float Pitch, float Yaw);
	void PlayRecordedInput(EPlayerRecordableInputTypes InputType);
	void Predict(float NewPredictionPing);
	void RconEndMatch();
	void RconOverrideNextMap(const class FString& mapName);
	void RecievedActiveRespawnDelay(float Time);
	void RecievedClearActiveRespawnDelay();
	void RouteFinderCycleBackwards();
	void RouteFinderCycleForwards();
	void SelectCurrentLoadout(const struct FMALoadout& loadout);
	void SelectLoadoutByName(const class FString& LoadoutName);
	void SendLoadoutToServer();
	void ServerAdminLogin(const class FString& Password);
	void ServerBanPlayer(class APlayerState* BannedPlayer, const class FString& Reason);
	void ServerChangePlayerTeam(class APlayerState* PlayerToMove);
	void ServerEnablePracticeMode(bool bIsEnabled);
	void ServerEnableTournamentMode(bool bIsEnabled);
	void ServerEnumFunction(uint64 S, uint64 B, const class FString& st);
	void ServerEvacuate();
	void ServerFunction(uint64 S, uint64 sv);
	void ServerKickPlayer(class APlayerState* KickedPlayer, const class FString& Reason);
	void ServerKickSelfForAfk();
	void ServerMoveToSpectate(class APlayerState* PlayerToMove);
	void ServerNegotiatePredictionPing(float NewPredictionPing);
	void ServerRconEndMatch();
	void ServerRconOverrideNextMap(const class FString& mapName);
	void ServerRespawnWithBasicLoadout();
	void ServerSelectLoadoutByClass(TSubclassOf<class UCharacterInfo> CharacterInfo);
	void ServerSetAutoBalanceEnabled(const bool bAutoBalanceEnabled);
	void ServerSetBotDebugMode(const bool bBotDebugEnabled);
	void ServerSetDirectHitImpulseBonus(float ExtraImpulsePercent);
	void ServerSetLoadout(const struct FMALoadout& loadout);
	void ServerSetPassword(const class FString& NewPassword);
	void ServerSetPattern(const class FString& PlayerName, EPattern PatternToSet);
	void ServerSetSpectateMode(ESpectateMode Mode);
	void ServerSetViewTarget(class AActor* Target);
	void ServerSpectate();
	void ServerTAC();
	void ServerTACOnSpectatedPlayer(const class FString& PlayerName);
	void ServerToggleReadyToPlay();
	void ServerToggleSpectateMode();
	void ServerUnsetPassword();
	void ServerUpdateReplicatedGeneralSettings(const struct FRepGenSettings& RepGenSettings);
	void ServerUpdateReplicatedInputSettings(const struct FRepInputSettings& RepInputSettings);
	void ServerUpdateRTT(float RTT);
	void ServerViewAPlayerState(class APlayerState* PlayerStateToView);
	void ServerViewBlueFlag();
	void ServerViewRedFlag();
	void SetAutoBalanceEnabled(const bool bAutoBalanceEnabled);
	void SetBotDebugMode(const bool bBotDebugEnabled);
	void SetDirectHitImpulseBonus(float ExtraImpulsePercent);
	void SetEnabledPawnRelatedInput(class AActor* RequestingActor, bool bEnabled);
	void SetPassword(const class FString& NewPassword);
	void SetPattern(EPattern PatternToSet);
	void SetPlayerVoiceMuteStatus(const class FString& PlayerUniqueNetId, bool bShouldMute);
	void SetServerName(const class FString& ServerName);
	void SetupDeathEffects();
	void ShowDamageNumbers(float Damage, const struct FVector& HitLocation);
	void ShowEndOfMatch();
	void ShowScoreboard();
	void Spectate();
	void SpectateJumpToLocation(const class FString& LocationString);
	void TAC();
	void TACOnSpectatedPlayer();
	void TogglePracticeMenu();
	void ToggleReadyToPlay();
	void ToggleRouteFinderMode();
	void ToggleScoreboard();
	void ToggleTutorialMenu();
	void UnblockPlayerFromTalking(const class FString& PlayerUniqueNetId);
	void UnPause();
	void UnsetPassword();
	void UpdateServerName();

	class APawn* FindMostRelevantPawn() const;
	class AMACharacter* FindRelevantCharacter() const;
	float GetActiveRespawnDelay() const;
	class UMAVitalsComponent* GetCharacterVitals() const;
	class AMACharacter* GetControlledCharacter() const;
	int32 GetCurrentXPPool() const;
	class AMACharacter* GetLastControlledCharacter() const;
	float GetTimeDead() const;
	bool IsPawnRelatedInputEnabled() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MAPlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MAPlayerController")
	}
	static class AMAPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMAPlayerController>();
	}
};
DUMPER7_ASSERTS_AMAPlayerController;

// Class Midair2.MADuelPlayerController
// 0x0000 (0x0BD0 - 0x0BD0)
class AMADuelPlayerController final : public AMAPlayerController
{
public:
	void ShowDuelMenu();
	void ToggleDuelRequestMenu();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MADuelPlayerController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MADuelPlayerController")
	}
	static class AMADuelPlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMADuelPlayerController>();
	}
};
DUMPER7_ASSERTS_AMADuelPlayerController;

// Class Midair2.MAPickup
// 0x0158 (0x0380 - 0x0228)
class AMAPickup : public AActor
{
public:
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x0228(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USphereComponent*                       Collision;                                         // 0x0230(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USphereComponent*                       ActionableCollision;                               // 0x0238(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0240(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bTimeout;                                          // 0x0248(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bResetMeshRotationOnSpawn;                         // 0x0249(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InteractionCooldownTime;                           // 0x0250(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FImpactEffect                          TimeoutEffects;                                    // 0x0258(0x0108)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class USoundBase*                             DropSound;                                         // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             ImpactSound;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundBase*                             PickupSound;                                       // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ImpulseInheritence;                                // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ApplyImpulse_NM(const struct FVector& Impulse);
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnStop(const struct FHitResult& ImpactResult);
	void PlayLandingEffects();
	void PlayPickupEffects(class AMAPlayerController* Controller);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MAPickup")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MAPickup")
	}
	static class AMAPickup* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMAPickup>();
	}
};
DUMPER7_ASSERTS_AMAPickup;

// Class Midair2.MAPlayerState
// 0x0268 (0x0590 - 0x0328)
class AMAPlayerState : public APlayerState
{
public:
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 TeamId)>  OnPlayerTeamChanged;                               // 0x0330(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AMATeamState*                           TeamState;                                         // 0x0340(0x0008)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMATeamState*                           LastTeamState;                                     // 0x0348(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESimpleVote                                   PlayerVote;                                        // 0x0350(0x0001)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInitializing;                                   // 0x0351(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LastAutoAnnouncerTime;                             // 0x0354(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AutoAnnouncerTimeLimit;                            // 0x0358(0x0004)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35C[0x8];                                      // 0x035C(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsAlive;                                          // 0x0364(0x0001)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, float>                            LastTimeApplyScoreMap;                             // 0x0368(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
