#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Midair2

#include "Basic.hpp"

#include "OnlineSubsystemUtils_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "Midair2_structs.hpp"
#include "LootLockerSDK_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function Midair2.GetCurrentLadderPlayerAsyncTask.GetCurrentLadderPlayer
// 0x0008 (0x0008 - 0x0000)
struct GetCurrentLadderPlayerAsyncTask_GetCurrentLadderPlayer final
{
public:
	class UGetCurrentLadderPlayerAsyncTask*       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GetCurrentLadderPlayerAsyncTask_GetCurrentLadderPlayer;

// Function Midair2.MACharacterMovement.MAClientAdjustEnergy
// 0x0004 (0x0004 - 0x0000)
struct MACharacterMovement_MAClientAdjustEnergy final
{
public:
	float                                         Energy;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MACharacterMovement_MAClientAdjustEnergy;

// Function Midair2.MACharacterMovement.MAServerMove
// 0x0038 (0x0038 - 0x0000)
struct MACharacterMovement_MAServerMove final
{
public:
	struct FMAPackedMoveBundle                    Bundle;                                            // 0x0000(0x0038)(ConstParm, Parm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MACharacterMovement_MAServerMove;

// Function Midair2.MACharacterMovement.IsSkatingOnGround
// 0x0001 (0x0001 - 0x0000)
struct MACharacterMovement_IsSkatingOnGround final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MACharacterMovement_IsSkatingOnGround;

// Function Midair2.MAPlatformEmulationSettings.GetKnownDeviceProfiles
// 0x0010 (0x0010 - 0x0000)
struct MAPlatformEmulationSettings_GetKnownDeviceProfiles final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlatformEmulationSettings_GetKnownDeviceProfiles;

// Function Midair2.MAPlatformEmulationSettings.GetKnownPlatformIds
// 0x0010 (0x0010 - 0x0000)
struct MAPlatformEmulationSettings_GetKnownPlatformIds final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlatformEmulationSettings_GetKnownPlatformIds;

// Function Midair2.AIPlayerController.PlayRecordedCameraInput
// 0x0008 (0x0008 - 0x0000)
struct AIPlayerController_PlayRecordedCameraInput final
{
public:
	float                                         Pitch;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Yaw;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPlayerController_PlayRecordedCameraInput;

// Function Midair2.AIPlayerController.PlayRecordedInput
// 0x0001 (0x0001 - 0x0000)
struct AIPlayerController_PlayRecordedInput final
{
public:
	EPlayerRecordableInputTypes                   InputType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPlayerController_PlayRecordedInput;

// Function Midair2.AIPlayerController.GetControlledCharacter
// 0x0008 (0x0008 - 0x0000)
struct AIPlayerController_GetControlledCharacter final
{
public:
	class AMACharacter*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AIPlayerController_GetControlledCharacter;

// Function Midair2.MAPlayerControllerBase.ClientDoExpression
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerControllerBase_ClientDoExpression final
{
public:
	class APlayerState*                           Speaker;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MessageType;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MAPlayerControllerBase_ClientDoExpression;

// Function Midair2.MAPlayerControllerBase.ClientGivenXP
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerControllerBase_ClientGivenXP final
{
public:
	int32                                         XP;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasLevelupReward;                                 // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MAPlayerControllerBase_ClientGivenXP;

// Function Midair2.MAPlayerControllerBase.ClientPlaySingleSound2D
// 0x0018 (0x0018 - 0x0000)
struct MAPlayerControllerBase_ClientPlaySingleSound2D final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         start_offset;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundConcurrency*                      conc;                                              // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerControllerBase_ClientPlaySingleSound2D;

// Function Midair2.MAPlayerControllerBase.ClientPlaySound2D
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerControllerBase_ClientPlaySound2D final
{
public:
	class USoundBase*                             Sound;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerControllerBase_ClientPlaySound2D;

// Function Midair2.MAPlayerControllerBase.ClientSay
// 0x0020 (0x0020 - 0x0000)
struct MAPlayerControllerBase_ClientSay final
{
public:
	class APlayerState*                           Speaker;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Message;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTeamOnly;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MAPlayerControllerBase_ClientSay;

// Function Midair2.MAPlayerControllerBase.DoExpression
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerControllerBase_DoExpression final
{
public:
	int32                                         MessageType;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerControllerBase_DoExpression;

// Function Midair2.MAPlayerControllerBase.GiveXP
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerControllerBase_GiveXP final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerControllerBase_GiveXP;

// Function Midair2.MAPlayerControllerBase.InvertMouse
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerControllerBase_InvertMouse final
{
public:
	bool                                          bInvert;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerControllerBase_InvertMouse;

// Function Midair2.MAPlayerControllerBase.Say
// 0x0018 (0x0018 - 0x0000)
struct MAPlayerControllerBase_Say final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTeamOnly;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MAPlayerControllerBase_Say;

// Function Midair2.MAPlayerControllerBase.ServerDoExpression
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerControllerBase_ServerDoExpression final
{
public:
	int32                                         MessageType;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerControllerBase_ServerDoExpression;

// Function Midair2.MAPlayerControllerBase.ServerSay
// 0x0018 (0x0018 - 0x0000)
struct MAPlayerControllerBase_ServerSay final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTeamOnly;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MAPlayerControllerBase_ServerSay;

// Function Midair2.MAPlayerControllerBase.SetMouseSensitivity
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerControllerBase_SetMouseSensitivity final
{
public:
	float                                         Sensitivity;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerControllerBase_SetMouseSensitivity;

// Function Midair2.MAPlayerControllerBase.ToggleMenu
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerControllerBase_ToggleMenu final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerControllerBase_ToggleMenu;

// Function Midair2.MAPlayerControllerBase.GetIsFinalizedPlayerInventory
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerControllerBase_GetIsFinalizedPlayerInventory final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerControllerBase_GetIsFinalizedPlayerInventory;

// Function Midair2.MAPlayerControllerBase.GetMALocalPlayer
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerControllerBase_GetMALocalPlayer final
{
public:
	class UMALocalPlayer*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerControllerBase_GetMALocalPlayer;

// Function Midair2.MAPlayerController.LoadTeamAvatars
// 0x0030 (0x0030 - 0x0000)
struct MAPlayerController_LoadTeamAvatars final
{
public:
	class FString                                 PathFromContentFolder;                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 AssetClass;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          LoadFromSubfolders;                                // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_LoadTeamAvatars;

// Function Midair2.MAPlayerController.AdminLogin
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_AdminLogin final
{
public:
	class FString                                 Password;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_AdminLogin;

// Function Midair2.MAPlayerController.BlockPlayerFromTalking
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_BlockPlayerFromTalking final
{
public:
	class FString                                 PlayerUniqueNetId;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_BlockPlayerFromTalking;

// Function Midair2.MAPlayerController.ChangeMap
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_ChangeMap final
{
public:
	class FString                                 mapName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ChangeMap;

// Function Midair2.MAPlayerController.ChangeScoreboard
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerController_ChangeScoreboard final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ChangeScoreboard;

// Function Midair2.MAPlayerController.ChangeTeam
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerController_ChangeTeam final
{
public:
	ETeamId                                       DesiredTeam;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ChangeTeam;

// Function Midair2.MAPlayerController.ClientDisplayGameModeFlags
// 0x0002 (0x0002 - 0x0000)
struct MAPlayerController_ClientDisplayGameModeFlags final
{
public:
	bool                                          bIsTournyModeEnabled;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPracModeEnabled;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ClientDisplayGameModeFlags;

// Function Midair2.MAPlayerController.ClientForceReplicateActor
// 0x0028 (0x0028 - 0x0000)
struct MAPlayerController_ClientForceReplicateActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         PropNames;                                         // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Data;                                              // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ClientForceReplicateActor;

// Function Midair2.MAPlayerController.ClientForceReplicateClass
// 0x0020 (0x0020 - 0x0000)
struct MAPlayerController_ClientForceReplicateClass final
{
public:
	TArray<uint8>                                 Data;                                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 PackName;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ClientForceReplicateClass;

// Function Midair2.MAPlayerController.ClientForceReplicateComponent
// 0x0028 (0x0028 - 0x0000)
struct MAPlayerController_ClientForceReplicateComponent final
{
public:
	class USceneComponent*                        SC;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         PropNames;                                         // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Data;                                              // 0x0018(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ClientForceReplicateComponent;

// Function Midair2.MAPlayerController.ClientFunction
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_ClientFunction final
{
public:
	uint64                                        S;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        cv;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ClientFunction;

// Function Midair2.MAPlayerController.ClientNotifyMapChange
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_ClientNotifyMapChange final
{
public:
	class FString                                 mapName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ClientNotifyMapChange;

// Function Midair2.MAPlayerController.ClientPlayerKicked
// 0x0018 (0x0018 - 0x0000)
struct MAPlayerController_ClientPlayerKicked final
{
public:
	class FString                                 KickReason;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeRemaining;                                     // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MAPlayerController_ClientPlayerKicked;

// Function Midair2.MAPlayerController.ClientReceiveDeathMessage
// 0x0028 (0x0028 - 0x0000)
struct MAPlayerController_ClientReceiveDeathMessage final
{
public:
	struct FDeathMessageData                      DeathMessageData;                                  // 0x0000(0x0028)(ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ClientReceiveDeathMessage;

// Function Midair2.MAPlayerController.ClientRefreshCheckpointMaterials
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerController_ClientRefreshCheckpointMaterials final
{
public:
	int32                                         PrevIdx;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NextIdx;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ClientRefreshCheckpointMaterials;

// Function Midair2.MAPlayerController.ClientSetCheckpointColor
// 0x0018 (0x0018 - 0x0000)
struct MAPlayerController_ClientSetCheckpointColor final
{
public:
	struct FLinearColor                           NewColor;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AMATrackCheckpoint*                     Checkpoint;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ClientSetCheckpointColor;

// Function Midair2.MAPlayerController.ClientSetDirectHitImpulseBonus
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerController_ClientSetDirectHitImpulseBonus final
{
public:
	float                                         ExtraImpulsePercent;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ClientSetDirectHitImpulseBonus;

// Function Midair2.MAPlayerController.ClientSetPattern
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerController_ClientSetPattern final
{
public:
	EPattern                                      PatternToSet;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ClientSetPattern;

// Function Midair2.MAPlayerController.ClientTempPatch
// 0x0028 (0x0028 - 0x0000)
struct MAPlayerController_ClientTempPatch final
{
public:
	TArray<uint8>                                 Data;                                              // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 PlatformName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MAPlayerController_ClientTempPatch;

// Function Midair2.MAPlayerController.ClientUpdateDirectionArrows
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerController_ClientUpdateDirectionArrows final
{
public:
	int32                                         NextCheckpointIdx;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ClientUpdateDirectionArrows;

// Function Midair2.MAPlayerController.ClientUpdateStatDelta
// 0x000C (0x000C - 0x0000)
struct MAPlayerController_ClientUpdateStatDelta final
{
public:
	class FName                                   StatId;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Delta;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ClientUpdateStatDelta;

// Function Midair2.MAPlayerController.ClientUpdateStatDeltas
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_ClientUpdateStatDeltas final
{
public:
	TArray<struct FMAStatDelta>                   Deltas;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ClientUpdateStatDeltas;

// Function Midair2.MAPlayerController.EnablePracticeMode
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerController_EnablePracticeMode final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_EnablePracticeMode;

// Function Midair2.MAPlayerController.EnableTournamentMode
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerController_EnableTournamentMode final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_EnableTournamentMode;

// Function Midair2.MAPlayerController.GetEffectiveControlRotation
// 0x000C (0x000C - 0x0000)
struct MAPlayerController_GetEffectiveControlRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_GetEffectiveControlRotation;

// Function Midair2.MAPlayerController.GetFlagHoldDuration
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerController_GetFlagHoldDuration final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_GetFlagHoldDuration;

// Function Midair2.MAPlayerController.GetPlayerLoadouts
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_GetPlayerLoadouts final
{
public:
	TArray<struct FMALoadout>                     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_GetPlayerLoadouts;

// Function Midair2.MAPlayerController.IsUserTalking
// 0x0018 (0x0018 - 0x0000)
struct MAPlayerController_IsUserTalking final
{
public:
	class FString                                 PlayerUniqueNetId;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MAPlayerController_IsUserTalking;

// Function Midair2.MAPlayerController.IsVoicePlayerMuted
// 0x0018 (0x0018 - 0x0000)
struct MAPlayerController_IsVoicePlayerMuted final
{
public:
	class FString                                 PlayerUniqueNetId;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MAPlayerController_IsVoicePlayerMuted;

// Function Midair2.MAPlayerController.JoinVoiceChannel
// 0x0020 (0x0020 - 0x0000)
struct MAPlayerController_JoinVoiceChannel final
{
public:
	class FString                                 InChannelName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InChannelCredentials;                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_JoinVoiceChannel;

// Function Midair2.MAPlayerController.PickedupPowerup
// 0x0018 (0x0018 - 0x0000)
struct MAPlayerController_PickedupPowerup final
{
public:
	float                                         PowerupLength;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PowerupName;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_PickedupPowerup;

// Function Midair2.MAPlayerController.PlayRecordedCameraInput
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerController_PlayRecordedCameraInput final
{
public:
	float                                         Pitch;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Yaw;                                               // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_PlayRecordedCameraInput;

// Function Midair2.MAPlayerController.PlayRecordedInput
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerController_PlayRecordedInput final
{
public:
	EPlayerRecordableInputTypes                   InputType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_PlayRecordedInput;

// Function Midair2.MAPlayerController.Predict
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerController_Predict final
{
public:
	float                                         NewPredictionPing;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_Predict;

// Function Midair2.MAPlayerController.RconOverrideNextMap
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_RconOverrideNextMap final
{
public:
	class FString                                 mapName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_RconOverrideNextMap;

// Function Midair2.MAPlayerController.RecievedActiveRespawnDelay
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerController_RecievedActiveRespawnDelay final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_RecievedActiveRespawnDelay;

// Function Midair2.MAPlayerController.SelectCurrentLoadout
// 0x00B8 (0x00B8 - 0x0000)
struct MAPlayerController_SelectCurrentLoadout final
{
public:
	struct FMALoadout                             loadout;                                           // 0x0000(0x00B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_SelectCurrentLoadout;

// Function Midair2.MAPlayerController.SelectLoadoutByName
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_SelectLoadoutByName final
{
public:
	class FString                                 LoadoutName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_SelectLoadoutByName;

// Function Midair2.MAPlayerController.ServerAdminLogin
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_ServerAdminLogin final
{
public:
	class FString                                 Password;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerAdminLogin;

// Function Midair2.MAPlayerController.ServerBanPlayer
// 0x0018 (0x0018 - 0x0000)
struct MAPlayerController_ServerBanPlayer final
{
public:
	class APlayerState*                           BannedPlayer;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Reason;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerBanPlayer;

// Function Midair2.MAPlayerController.ServerChangePlayerTeam
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerController_ServerChangePlayerTeam final
{
public:
	class APlayerState*                           PlayerToMove;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerChangePlayerTeam;

// Function Midair2.MAPlayerController.ServerEnablePracticeMode
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerController_ServerEnablePracticeMode final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerEnablePracticeMode;

// Function Midair2.MAPlayerController.ServerEnableTournamentMode
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerController_ServerEnableTournamentMode final
{
public:
	bool                                          bIsEnabled;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerEnableTournamentMode;

// Function Midair2.MAPlayerController.ServerEnumFunction
// 0x0020 (0x0020 - 0x0000)
struct MAPlayerController_ServerEnumFunction final
{
public:
	uint64                                        S;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        B;                                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 st;                                                // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerEnumFunction;

// Function Midair2.MAPlayerController.ServerFunction
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_ServerFunction final
{
public:
	uint64                                        S;                                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint64                                        sv;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerFunction;

// Function Midair2.MAPlayerController.ServerKickPlayer
// 0x0018 (0x0018 - 0x0000)
struct MAPlayerController_ServerKickPlayer final
{
public:
	class APlayerState*                           KickedPlayer;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Reason;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerKickPlayer;

// Function Midair2.MAPlayerController.ServerMoveToSpectate
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerController_ServerMoveToSpectate final
{
public:
	class APlayerState*                           PlayerToMove;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerMoveToSpectate;

// Function Midair2.MAPlayerController.ServerNegotiatePredictionPing
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerController_ServerNegotiatePredictionPing final
{
public:
	float                                         NewPredictionPing;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerNegotiatePredictionPing;

// Function Midair2.MAPlayerController.ServerRconOverrideNextMap
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_ServerRconOverrideNextMap final
{
public:
	class FString                                 mapName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerRconOverrideNextMap;

// Function Midair2.MAPlayerController.ServerSelectLoadoutByClass
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerController_ServerSelectLoadoutByClass final
{
public:
	TSubclassOf<class UCharacterInfo>             CharacterInfo;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerSelectLoadoutByClass;

// Function Midair2.MAPlayerController.ServerSetAutoBalanceEnabled
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerController_ServerSetAutoBalanceEnabled final
{
public:
	bool                                          bAutoBalanceEnabled;                               // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerSetAutoBalanceEnabled;

// Function Midair2.MAPlayerController.ServerSetBotDebugMode
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerController_ServerSetBotDebugMode final
{
public:
	bool                                          bBotDebugEnabled;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerSetBotDebugMode;

// Function Midair2.MAPlayerController.ServerSetDirectHitImpulseBonus
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerController_ServerSetDirectHitImpulseBonus final
{
public:
	float                                         ExtraImpulsePercent;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerSetDirectHitImpulseBonus;

// Function Midair2.MAPlayerController.ServerSetLoadout
// 0x00B8 (0x00B8 - 0x0000)
struct MAPlayerController_ServerSetLoadout final
{
public:
	struct FMALoadout                             loadout;                                           // 0x0000(0x00B8)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerSetLoadout;

// Function Midair2.MAPlayerController.ServerSetPassword
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_ServerSetPassword final
{
public:
	class FString                                 NewPassword;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerSetPassword;

// Function Midair2.MAPlayerController.ServerSetPattern
// 0x0018 (0x0018 - 0x0000)
struct MAPlayerController_ServerSetPattern final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPattern                                      PatternToSet;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MAPlayerController_ServerSetPattern;

// Function Midair2.MAPlayerController.ServerSetSpectateMode
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerController_ServerSetSpectateMode final
{
public:
	ESpectateMode                                 Mode;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerSetSpectateMode;

// Function Midair2.MAPlayerController.ServerSetViewTarget
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerController_ServerSetViewTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerSetViewTarget;

// Function Midair2.MAPlayerController.ServerTACOnSpectatedPlayer
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_ServerTACOnSpectatedPlayer final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerTACOnSpectatedPlayer;

// Function Midair2.MAPlayerController.ServerUpdateReplicatedGeneralSettings
// 0x0002 (0x0002 - 0x0000)
struct MAPlayerController_ServerUpdateReplicatedGeneralSettings final
{
public:
	struct FRepGenSettings                        RepGenSettings;                                    // 0x0000(0x0002)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerUpdateReplicatedGeneralSettings;

// Function Midair2.MAPlayerController.ServerUpdateReplicatedInputSettings
// 0x0002 (0x0002 - 0x0000)
struct MAPlayerController_ServerUpdateReplicatedInputSettings final
{
public:
	struct FRepInputSettings                      RepInputSettings;                                  // 0x0000(0x0002)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerUpdateReplicatedInputSettings;

// Function Midair2.MAPlayerController.ServerUpdateRTT
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerController_ServerUpdateRTT final
{
public:
	float                                         RTT;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerUpdateRTT;

// Function Midair2.MAPlayerController.ServerViewAPlayerState
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerController_ServerViewAPlayerState final
{
public:
	class APlayerState*                           PlayerStateToView;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ServerViewAPlayerState;

// Function Midair2.MAPlayerController.SetAutoBalanceEnabled
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerController_SetAutoBalanceEnabled final
{
public:
	bool                                          bAutoBalanceEnabled;                               // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_SetAutoBalanceEnabled;

// Function Midair2.MAPlayerController.SetBotDebugMode
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerController_SetBotDebugMode final
{
public:
	bool                                          bBotDebugEnabled;                                  // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_SetBotDebugMode;

// Function Midair2.MAPlayerController.SetDirectHitImpulseBonus
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerController_SetDirectHitImpulseBonus final
{
public:
	float                                         ExtraImpulsePercent;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_SetDirectHitImpulseBonus;

// Function Midair2.MAPlayerController.SetEnabledPawnRelatedInput
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_SetEnabledPawnRelatedInput final
{
public:
	class AActor*                                 RequestingActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MAPlayerController_SetEnabledPawnRelatedInput;

// Function Midair2.MAPlayerController.SetPassword
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_SetPassword final
{
public:
	class FString                                 NewPassword;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_SetPassword;

// Function Midair2.MAPlayerController.SetPattern
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerController_SetPattern final
{
public:
	EPattern                                      PatternToSet;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_SetPattern;

// Function Midair2.MAPlayerController.SetPlayerVoiceMuteStatus
// 0x0018 (0x0018 - 0x0000)
struct MAPlayerController_SetPlayerVoiceMuteStatus final
{
public:
	class FString                                 PlayerUniqueNetId;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldMute;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MAPlayerController_SetPlayerVoiceMuteStatus;

// Function Midair2.MAPlayerController.SetServerName
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_SetServerName final
{
public:
	class FString                                 ServerName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_SetServerName;

// Function Midair2.MAPlayerController.ShowDamageNumbers
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_ShowDamageNumbers final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocation;                                       // 0x0004(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_ShowDamageNumbers;

// Function Midair2.MAPlayerController.SpectateJumpToLocation
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_SpectateJumpToLocation final
{
public:
	class FString                                 LocationString;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_SpectateJumpToLocation;

// Function Midair2.MAPlayerController.UnblockPlayerFromTalking
// 0x0010 (0x0010 - 0x0000)
struct MAPlayerController_UnblockPlayerFromTalking final
{
public:
	class FString                                 PlayerUniqueNetId;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_UnblockPlayerFromTalking;

// Function Midair2.MAPlayerController.FindMostRelevantPawn
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerController_FindMostRelevantPawn final
{
public:
	class APawn*                                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_FindMostRelevantPawn;

// Function Midair2.MAPlayerController.FindRelevantCharacter
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerController_FindRelevantCharacter final
{
public:
	class AMACharacter*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_FindRelevantCharacter;

// Function Midair2.MAPlayerController.GetActiveRespawnDelay
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerController_GetActiveRespawnDelay final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_GetActiveRespawnDelay;

// Function Midair2.MAPlayerController.GetCharacterVitals
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerController_GetCharacterVitals final
{
public:
	class UMAVitalsComponent*                     ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_GetCharacterVitals;

// Function Midair2.MAPlayerController.GetControlledCharacter
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerController_GetControlledCharacter final
{
public:
	class AMACharacter*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_GetControlledCharacter;

// Function Midair2.MAPlayerController.GetCurrentXPPool
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerController_GetCurrentXPPool final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_GetCurrentXPPool;

// Function Midair2.MAPlayerController.GetLastControlledCharacter
// 0x0008 (0x0008 - 0x0000)
struct MAPlayerController_GetLastControlledCharacter final
{
public:
	class AMACharacter*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_GetLastControlledCharacter;

// Function Midair2.MAPlayerController.GetTimeDead
// 0x0004 (0x0004 - 0x0000)
struct MAPlayerController_GetTimeDead final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_GetTimeDead;

// Function Midair2.MAPlayerController.IsPawnRelatedInputEnabled
// 0x0001 (0x0001 - 0x0000)
struct MAPlayerController_IsPawnRelatedInputEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPlayerController_IsPawnRelatedInputEnabled;

// Function Midair2.MAPickup.ApplyImpulse_NM
// 0x000C (0x000C - 0x0000)
struct MAPickup_ApplyImpulse_NM final
{
public:
	struct FVector                                Impulse;                                           // 0x0000(0x000C)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MAPickup_ApplyImpulse_NM;

// Function Midair2.MAPickup.OnBeginOverlap
// 0x00A8 (0x00A8 - 0x0000)
struct MAPickup_OnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
