#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemOculus

#include "Basic.hpp"

#include "OnlineSubsystemUtils_structs.hpp"
#include "OnlineSubsystemUtils_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class OnlineSubsystemOculus.OculusCreateSessionCallbackProxy
// 0x0068 (0x0098 - 0x0030)
class UOculusCreateSessionCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x48];                                      // 0x0050(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOculusCreateSessionCallbackProxy* CreateSession(int32 PublicConnections, const class FString& OculusMatchmakingPool);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OculusCreateSessionCallbackProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OculusCreateSessionCallbackProxy")
	}
	static class UOculusCreateSessionCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOculusCreateSessionCallbackProxy>();
	}
};
DUMPER7_ASSERTS_UOculusCreateSessionCallbackProxy;

// Class OnlineSubsystemOculus.OculusEntitlementCallbackProxy
// 0x0020 (0x0050 - 0x0030)
class UOculusEntitlementCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UOculusEntitlementCallbackProxy* VerifyEntitlement();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OculusEntitlementCallbackProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OculusEntitlementCallbackProxy")
	}
	static class UOculusEntitlementCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOculusEntitlementCallbackProxy>();
	}
};
DUMPER7_ASSERTS_UOculusEntitlementCallbackProxy;

// Class OnlineSubsystemOculus.OculusFindSessionsCallbackProxy
// 0x0068 (0x0098 - 0x0030)
class UOculusFindSessionsCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void(const TArray<struct FBlueprintSessionResult>& Results)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const TArray<struct FBlueprintSessionResult>& Results)> OnFailure; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x48];                                      // 0x0050(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOculusFindSessionsCallbackProxy* FindMatchmakingSessions(int32 MaxResults, const class FString& OculusMatchmakingPool);
	static class UOculusFindSessionsCallbackProxy* FindModeratedSessions(int32 MaxResults);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OculusFindSessionsCallbackProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OculusFindSessionsCallbackProxy")
	}
	static class UOculusFindSessionsCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOculusFindSessionsCallbackProxy>();
	}
};
DUMPER7_ASSERTS_UOculusFindSessionsCallbackProxy;

// Class OnlineSubsystemOculus.OculusIdentityCallbackProxy
// 0x0030 (0x0060 - 0x0030)
class UOculusIdentityCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void(const class FString& OculusId, const class FString& OculusName)> OnSuccess; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOculusIdentityCallbackProxy* GetOculusIdentity(int32 LocalUserNum);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OculusIdentityCallbackProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OculusIdentityCallbackProxy")
	}
	static class UOculusIdentityCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOculusIdentityCallbackProxy>();
	}
};
DUMPER7_ASSERTS_UOculusIdentityCallbackProxy;

// Class OnlineSubsystemOculus.OculusNetConnection
// 0x0010 (0x1C58 - 0x1C48)
class UOculusNetConnection final : public UIpConnection
{
public:
	uint8                                         Pad_1C48[0x10];                                    // 0x1C48(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OculusNetConnection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OculusNetConnection")
	}
	static class UOculusNetConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOculusNetConnection>();
	}
};
DUMPER7_ASSERTS_UOculusNetConnection;

// Class OnlineSubsystemOculus.OculusNetDriver
// 0x00B8 (0x0888 - 0x07D0)
class UOculusNetDriver final : public UIpNetDriver
{
public:
	uint8                                         Pad_7D0[0xB8];                                     // 0x07D0(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OculusNetDriver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OculusNetDriver")
	}
	static class UOculusNetDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOculusNetDriver>();
	}
};
DUMPER7_ASSERTS_UOculusNetDriver;

// Class OnlineSubsystemOculus.OculusUpdateSessionCallbackProxy
// 0x0040 (0x0070 - 0x0030)
class UOculusUpdateSessionCallbackProxy final : public UOnlineBlueprintCallProxyBase
{
public:
	TMulticastInlineDelegate<void()>              OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailure;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x20];                                      // 0x0050(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UOculusUpdateSessionCallbackProxy* SetSessionEnqueue(bool bShouldEnqueueInMatchmakingPool);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OculusUpdateSessionCallbackProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OculusUpdateSessionCallbackProxy")
	}
	static class UOculusUpdateSessionCallbackProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOculusUpdateSessionCallbackProxy>();
	}
};
DUMPER7_ASSERTS_UOculusUpdateSessionCallbackProxy;

}

