#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenCVLensCalibration

#include "Basic.hpp"

#include "OpenCVLensDistortion_structs.hpp"


namespace SDK::Params
{

// Function OpenCVLensCalibration.OpenCVLensCalibrator.CreateCalibrator
// 0x0018 (0x0018 - 0x0000)
struct OpenCVLensCalibrator_CreateCalibrator final
{
public:
	int32                                         BoardWidth;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoardHeight;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SquareSize;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFisheyeModel;                                  // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOpenCVLensCalibrator*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OpenCVLensCalibrator_CreateCalibrator;

// Function OpenCVLensCalibration.OpenCVLensCalibrator.CalculateLensParameters
// 0x0048 (0x0048 - 0x0000)
struct OpenCVLensCalibrator_CalculateLensParameters final
{
public:
	struct FOpenCVLensDistortionParameters        LensDistortionParameters;                          // 0x0000(0x0034)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MarginOfError;                                     // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOpenCVCameraViewInfo                  CameraViewInfo;                                    // 0x0038(0x000C)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OpenCVLensCalibrator_CalculateLensParameters;

// Function OpenCVLensCalibration.OpenCVLensCalibrator.FeedImage
// 0x0018 (0x0018 - 0x0000)
struct OpenCVLensCalibrator_FeedImage final
{
public:
	class FString                                 FilePath;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OpenCVLensCalibrator_FeedImage;

// Function OpenCVLensCalibration.OpenCVLensCalibrator.FeedRenderTarget
// 0x0010 (0x0010 - 0x0000)
struct OpenCVLensCalibrator_FeedRenderTarget final
{
public:
	class UTextureRenderTarget2D*                 TextureRenderTarget;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OpenCVLensCalibrator_FeedRenderTarget;

}

