#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Radial_Wheel_Item_WB

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Radial_Wheel_Slot_Struct_structs.hpp"
#include "Radial_Wheel_Item_Struct_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Radial_Wheel_Item_WB.Radial_Wheel_Item_WB_C
// 0x0160 (0x03C0 - 0x0260)
class URadial_Wheel_Item_WB_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Item_Content_OV;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_Icon_Image;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Item_Info_Text;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Main_SB;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Radial_Wheel_Item_Image;                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URadial_Wheel_Slot_Style_DA_C*          Current_Slot_Style;                                // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Angle;                                             // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Is_Selected_;                                      // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Is_Active_;                                        // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRadial_Wheel_Slot_Struct              Slot_Data;                                         // 0x02B0(0x0090)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FRadial_Wheel_Item_Struct              Item_Data;                                         // 0x0340(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Radial_Wheel_Material_Instance;                    // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Radial_Wheel_Item_WB(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void On_Selected();
	void Selected_Animation_Repeater();
	void On_Unselected();
	void Update_Slot(const struct FRadial_Wheel_Slot_Struct& Slot_0);
	void Update_Slot_Style(class URadial_Wheel_Slot_Style_DA_C* Slot_Style);
	class UMaterialInstanceDynamic* Create_Material_Instance_From_Slot_Style(class URadial_Wheel_Slot_Style_DA_C* Style);
	bool Can_Be_Selected_();
	void SequenceEvent__ENTRYPOINTRadial_Wheel_Item_WB_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Radial_Wheel_Item_WB_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Radial_Wheel_Item_WB_C")
	}
	static class URadial_Wheel_Item_WB_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadial_Wheel_Item_WB_C>();
	}
};
DUMPER7_ASSERTS_URadial_Wheel_Item_WB_C;

}

