#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Radial_Wheel_WB

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Radial_Wheel_Slot_Struct_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"
#include "Radial_Wheel_Position_Enum_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Radial_Wheel_WB.Radial_Wheel_WB_C
// 0x0090 (0x02F0 - 0x0260)
class URadial_Wheel_WB_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Popup;                                             // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        Background_Blur;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Background_Border;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Image;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Radial_Wheel_Container_OV;                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Radial_Wheel_Current_Slot_Name_Text;               // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Radial_Wheel_OV;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URadial_Wheel_AC_C*                     Radian_Wheel_Component;                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class URadial_Wheel_Item_WB_C*>        Slots_Widgets;                                     // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class URadial_Wheel_Item_WB_C*                Current_Slot;                                      // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRadial_Wheel_Slot_Struct>      Preview_Slots;                                     // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Update_Selected_Slot_;                             // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        _Opened_Sound;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Wheel_Opened_;                                     // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Using_Gamepad_;                                    // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E2[0x2];                                      // 0x02E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Gamepad_Interpolated_Axis;                         // 0x02E4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Radial_Wheel_WB(int32 EntryPoint);
	void Center_Mouse_Position();
	void Popup_Animation_Repeater();
	void Construct();
	void WidgetAnimationEvt_Popup_K2Node_WidgetAnimationEvent_0();
	void Hide_Radial_Wheel();
	void Show_Radial_Wheel();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void Generate_Radial_Wheel(TArray<struct FRadial_Wheel_Slot_Struct>& Slots_);
	void Get_Mouse_Input_Angle___Distance(float* Angle, float* Distance);
	void Update_Selected_Slot();
	void Get_Gamepad_Input_Angle___Distance(float* Angle, float* Distance);
	void Refresh_Radial_Wheel_Slots();
	void Set_Wheel_Position(ERadial_Wheel_Position_Enum New_Position);
	void Get_Wheel_Center_Position(bool* Valid_, int32* X, int32* Y);
	void Refresh_Radial_Wheel_Style();
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void _Closed_Sound(bool Closed_);
	void Lock_Mouse_To_Radius();
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SequenceEvent__ENTRYPOINTRadial_Wheel_WB_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Radial_Wheel_WB_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Radial_Wheel_WB_C")
	}
	static class URadial_Wheel_WB_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadial_Wheel_WB_C>();
	}
};
DUMPER7_ASSERTS_URadial_Wheel_WB_C;

}

