#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleUGC

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "SimpleUGC_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class SimpleUGC.MakeReplaceableActorComponent
// 0x0008 (0x00B8 - 0x00B0)
class UMakeReplaceableActorComponent final : public UActorComponent
{
public:
	TSubclassOf<class AActor>                     CompatibleReplacement;                             // 0x00B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MakeReplaceableActorComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MakeReplaceableActorComponent")
	}
	static class UMakeReplaceableActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMakeReplaceableActorComponent>();
	}
};
DUMPER7_ASSERTS_UMakeReplaceableActorComponent;

// Class SimpleUGC.ReplacementActorComponent
// 0x0010 (0x00C0 - 0x00B0)
class UReplacementActorComponent final : public UActorComponent
{
public:
	TArray<TSubclassOf<class AActor>>             ActorClassesToReplace;                             // 0x00B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReplacementActorComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReplacementActorComponent")
	}
	static class UReplacementActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReplacementActorComponent>();
	}
};
DUMPER7_ASSERTS_UReplacementActorComponent;

// Class SimpleUGC.UGCBaseGameInstance
// 0x0008 (0x01B0 - 0x01A8)
class UUGCBaseGameInstance : public UGameInstance
{
public:
	class UUGCRegistry*                           UGCRegistry;                                       // 0x01A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCBaseGameInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCBaseGameInstance")
	}
	static class UUGCBaseGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUGCBaseGameInstance>();
	}
};
DUMPER7_ASSERTS_UUGCBaseGameInstance;

// Class SimpleUGC.UGCBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UUGCBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UUGCRegistry* GetUGCRegistry(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCBlueprintLibrary")
	}
	static class UUGCBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUGCBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UUGCBlueprintLibrary;

// Class SimpleUGC.UGCRegistry
// 0x0068 (0x0090 - 0x0028)
class UUGCRegistry final : public UObject
{
public:
	TArray<struct FUGCPackage>                    UGCPackages;                                       // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<TSubclassOf<class AActor>, TSubclassOf<class AActor>> RegisteredOverrides;                  // 0x0038(0x0050)(BlueprintVisible, BlueprintReadOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool ApplyAllOverridesInPackage(const struct FUGCPackage& Package);
	bool ApplyOverridesForActorClass(TSubclassOf<class AActor> ActorClass);
	void ClearOverrideForClass(TSubclassOf<class AActor> ActorClass);
	bool FindUGCPackages();
	bool GetActorClassesWithReplacementActorComponentsInPackage(const struct FUGCPackage& Package, TArray<TSubclassOf<class AActor>>* ActorClasses);
	bool GetAllClassesInPackage(const struct FUGCPackage& Package, TArray<class UClass*>* Classes);
	bool GetMapsInPackage(const struct FUGCPackage& Package, TArray<class FName>* maps);
	TSubclassOf<class AActor> GetOverrideForActorClass(TSubclassOf<class AActor> ActorClass);
	void RegisterOverrideForClass(TSubclassOf<class AActor> ClassToOverride, TSubclassOf<class AActor> OverrideClass);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCRegistry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCRegistry")
	}
	static class UUGCRegistry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUGCRegistry>();
	}
};
DUMPER7_ASSERTS_UUGCRegistry;

}

