#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleUGC

#include "Basic.hpp"

#include "SimpleUGC_structs.hpp"


namespace SDK::Params
{

// Function SimpleUGC.UGCBlueprintLibrary.GetUGCRegistry
// 0x0010 (0x0010 - 0x0000)
struct UGCBlueprintLibrary_GetUGCRegistry final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUGCRegistry*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UGCBlueprintLibrary_GetUGCRegistry;

// Function SimpleUGC.UGCRegistry.ApplyAllOverridesInPackage
// 0x0048 (0x0048 - 0x0000)
struct UGCRegistry_ApplyAllOverridesInPackage final
{
public:
	struct FUGCPackage                            Package;                                           // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UGCRegistry_ApplyAllOverridesInPackage;

// Function SimpleUGC.UGCRegistry.ApplyOverridesForActorClass
// 0x0010 (0x0010 - 0x0000)
struct UGCRegistry_ApplyOverridesForActorClass final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UGCRegistry_ApplyOverridesForActorClass;

// Function SimpleUGC.UGCRegistry.ClearOverrideForClass
// 0x0008 (0x0008 - 0x0000)
struct UGCRegistry_ClearOverrideForClass final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UGCRegistry_ClearOverrideForClass;

// Function SimpleUGC.UGCRegistry.FindUGCPackages
// 0x0001 (0x0001 - 0x0000)
struct UGCRegistry_FindUGCPackages final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UGCRegistry_FindUGCPackages;

// Function SimpleUGC.UGCRegistry.GetActorClassesWithReplacementActorComponentsInPackage
// 0x0058 (0x0058 - 0x0000)
struct UGCRegistry_GetActorClassesWithReplacementActorComponentsInPackage final
{
public:
	struct FUGCPackage                            Package;                                           // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class AActor>>             ActorClasses;                                      // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UGCRegistry_GetActorClassesWithReplacementActorComponentsInPackage;

// Function SimpleUGC.UGCRegistry.GetAllClassesInPackage
// 0x0058 (0x0058 - 0x0000)
struct UGCRegistry_GetAllClassesInPackage final
{
public:
	struct FUGCPackage                            Package;                                           // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
	TArray<class UClass*>                         Classes;                                           // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UGCRegistry_GetAllClassesInPackage;

// Function SimpleUGC.UGCRegistry.GetMapsInPackage
// 0x0058 (0x0058 - 0x0000)
struct UGCRegistry_GetMapsInPackage final
{
public:
	struct FUGCPackage                            Package;                                           // 0x0000(0x0040)(Parm, NativeAccessSpecifierPublic)
	TArray<class FName>                           maps;                                              // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UGCRegistry_GetMapsInPackage;

// Function SimpleUGC.UGCRegistry.GetOverrideForActorClass
// 0x0010 (0x0010 - 0x0000)
struct UGCRegistry_GetOverrideForActorClass final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UGCRegistry_GetOverrideForActorClass;

// Function SimpleUGC.UGCRegistry.RegisterOverrideForClass
// 0x0010 (0x0010 - 0x0000)
struct UGCRegistry_RegisterOverrideForClass final
{
public:
	TSubclassOf<class AActor>                     ClassToOverride;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     OverrideClass;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UGCRegistry_RegisterOverrideForClass;

}

