#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tempest_1P_ABP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Tempest_1P_ABP.Tempest_1P_ABP_C
// 0x0100 (0x03C0 - 0x02C0)
class UTempest_1P_ABP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x02F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0340(0x0080)()

public:
	void ExecuteUbergraph_Tempest_1P_ABP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Tempest_1P_ABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Tempest_1P_ABP_C")
	}
	static class UTempest_1P_ABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTempest_1P_ABP_C>();
	}
};
DUMPER7_ASSERTS_UTempest_1P_ABP_C;

}

