#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ExperienceTileButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Midair2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ExperienceTileButton.W_ExperienceTileButton_C
// 0x0080 (0x0C40 - 0x0BC0)
class UW_ExperienceTileButton_C final : public UMAButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHovered;                                         // 0x0BC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       ExperienceDescription;                             // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ExperienceTitle;                                   // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KeyArt;                                            // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MapTitle;                                          // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0BF0(0x0018)(Edit, BlueprintVisible)
	class FText                                   Description;                                       // 0x0C08(0x0018)(Edit, BlueprintVisible)
	class FText                                   MainTitle;                                         // 0x0C20(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             Image;                                             // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTileText(const class FText& ExperienceTitle_0, const class FText& ExperienceDescription_0, const class FText& MapTitle_0, class UTexture2D* Image_0);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_W_ExperienceTileButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_ExperienceTileButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_ExperienceTileButton_C")
	}
	static class UW_ExperienceTileButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ExperienceTileButton_C>();
	}
};
DUMPER7_ASSERTS_UW_ExperienceTileButton_C;

}

