#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ExperienceTileButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_ExperienceTileButton.W_ExperienceTileButton_C.UpdateTileText
// 0x0050 (0x0050 - 0x0000)
struct W_ExperienceTileButton_C_UpdateTileText final
{
public:
	class FText                                   ExperienceTitle_0;                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   ExperienceDescription_0;                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   MapTitle_0;                                        // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             Image_0;                                           // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ExperienceTileButton_C_UpdateTileText;

// Function W_ExperienceTileButton.W_ExperienceTileButton_C.ExecuteUbergraph_W_ExperienceTileButton
// 0x0018 (0x0018 - 0x0000)
struct W_ExperienceTileButton_C_ExecuteUbergraph_W_ExperienceTileButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_ExperienceTileButton_C_ExecuteUbergraph_W_ExperienceTileButton;

}

