#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Experience

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Experience.W_Experience_C
// 0x0070 (0x02F8 - 0x0288)
class UW_Experience_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_ExperienceTileButton_C*              W_ExperienceTileButton;                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   MainTitle;                                         // 0x0298(0x0018)(Edit, BlueprintVisible)
	class FText                                   Title;                                             // 0x02B0(0x0018)(Edit, BlueprintVisible)
	class FText                                   Description;                                       // 0x02C8(0x0018)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void()>              ButtonClicked;                                     // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UTexture2D*                             Image;                                             // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTitle(const class FText& NewTitle);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BndEvt__W_Experience_W_ExperienceTileButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_W_Experience(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Experience_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Experience_C")
	}
	static class UW_Experience_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Experience_C>();
	}
};
DUMPER7_ASSERTS_UW_Experience_C;

}

