#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FriendsOverlay

#include "Basic.hpp"

#include "Midair2_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FriendsOverlay.W_FriendsOverlay_C
// 0x0050 (0x0378 - 0x0328)
class UW_FriendsOverlay_C final : public UMAActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_0;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           FriendsContainerVB;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_79;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OnlinePlayersTB;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsOverlay_Button_C*           WBP_FriendsOverlay_Button;                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsOverlay_Button_C*           WBP_FriendsOverlay_Button_1;                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsOverlay_Button_C*           WBP_FriendsOverlay_Button_2;                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FriendsOverlay_Button_C*           WBP_FriendsOverlay_Button_3;                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NumFriendsToDisplay;                               // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_FriendsOverlay(int32 EntryPoint);
	void BndEvt__W_FriendsOverlay_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void BeforePush_A4F1FC54466EC49C9848FE8592A4D975(class UCommonActivatableWidget* UserWidget);
	void AfterPush_A4F1FC54466EC49C9848FE8592A4D975(class UCommonActivatableWidget* UserWidget);
	void PartyMembersUpdated(TArray<struct FPartyMemberView>& PartyMembers);
	void OnFriendsUpdated(const TArray<struct FFriendView>& Friends);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_FriendsOverlay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_FriendsOverlay_C")
	}
	static class UW_FriendsOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_FriendsOverlay_C>();
	}
};
DUMPER7_ASSERTS_UW_FriendsOverlay_C;

}

