#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_HorizontalTabList

#include "Basic.hpp"

#include "Midair2_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_HorizontalTabList.W_HorizontalTabList_C
// 0x0060 (0x0440 - 0x03E0)
class UW_HorizontalTabList_C final : public UMATabListWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActionWidget*                    NextTabAction;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               NextTabActionWrapper;                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    PreviousTabAction;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PreviousTabActionWrapper;                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TabButtonBox;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                TabButtonPadding;                                  // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	int32                                         MinTabWidth;                                       // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseButtonStyle;                                    // 0x0424(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_425[0x3];                                      // 0x0425(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ButtonStyle;                                       // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 DebugButtonTypeDisplay;                            // 0x0430(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DebugTabCount;                                     // 0x0438(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_HorizontalTabList(int32 EntryPoint);
	void TabSelected(class FName TabId);
	void HandleTabRemoval(class FName TabNameID, class UCommonButtonBase* TabButton);
	void Construct();
	void HandleTabCreation(class FName TabNameID, class UCommonButtonBase* TabButton);
	void CustomEvent_1(ESlateVisibility InVisibility);
	void Previous_Visibility();
	void PreConstruct(bool IsDesignTime);
	void UpdateTabStyles(class UCommonButtonBase* ButtonWidget);
	void DebugCreateTabsForDesigner();
	void GetFirstChild(class UWidget** NewParam);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_HorizontalTabList_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_HorizontalTabList_C")
	}
	static class UW_HorizontalTabList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_HorizontalTabList_C>();
	}
};
DUMPER7_ASSERTS_UW_HorizontalTabList_C;

}

