#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_LobbyPlayerWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_LobbyPlayerWidget.W_LobbyPlayerWidget_C
// 0x0028 (0x0288 - 0x0260)
class UW_LobbyPlayerWidget_C final : public UUserWidget
{
public:
	class UImage*                                 Image_27;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_46;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsLeader;                                          // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlayerReady;                                       // 0x0271(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PlayerName;                                        // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	struct FSlateColor GetPlayerNameColorAndOpacity();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_LobbyPlayerWidget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_LobbyPlayerWidget_C")
	}
	static class UW_LobbyPlayerWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_LobbyPlayerWidget_C>();
	}
};
DUMPER7_ASSERTS_UW_LobbyPlayerWidget_C;

}

