#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Midair_TabMenu_Button

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_Midair_TabMenu_Button.W_Midair_TabMenu_Button_C.ExecuteUbergraph_W_Midair_TabMenu_Button
// 0x0090 (0x0090 - 0x0000)
struct W_Midair_TabMenu_Button_C_ExecuteUbergraph_W_Midair_TabMenu_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bActive;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InText;                               // 0x0018(0x0018)(ConstParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0060(0x0028)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_TabMenu_Button_C_ExecuteUbergraph_W_Midair_TabMenu_Button;

// Function W_Midair_TabMenu_Button.W_Midair_TabMenu_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Midair_TabMenu_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_W_Midair_TabMenu_Button_C_PreConstruct;

// Function W_Midair_TabMenu_Button.W_Midair_TabMenu_Button_C.UpdateButtonText
// 0x0018 (0x0018 - 0x0000)
struct W_Midair_TabMenu_Button_C_UpdateButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_W_Midair_TabMenu_Button_C_UpdateButtonText;

// Function W_Midair_TabMenu_Button.W_Midair_TabMenu_Button_C.SetButtonIsActive
// 0x0001 (0x0001 - 0x0000)
struct W_Midair_TabMenu_Button_C_SetButtonIsActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_W_Midair_TabMenu_Button_C_SetButtonIsActive;

}

