#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Midair_Frontend

#include "Basic.hpp"

#include "Midair2_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonGame_structs.hpp"


namespace SDK::Params
{

// Function W_Midair_Frontend.W_Midair_Frontend_C.ExecuteUbergraph_W_Midair_Frontend
// 0x0588 (0x0588 - 0x0000)
struct W_Midair_Frontend_C_ExecuteUbergraph_W_Midair_Frontend final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_ServerBrowser_C*                     K2Node_DynamicCast_AsW_Server_Browser;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0018)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLoggedInUsername_ReturnValue;          // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00D0(0x0018)()
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_13;                  // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_12;                  // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatableWidget*               Temp_object_Variable_1;                            // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_11;                  // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_10;                  // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatableWidget*               Temp_object_Variable_2;                            // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_9;                   // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_8;                   // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatableWidget*               Temp_object_Variable_3;                            // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_7;                   // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_6;                   // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_7; // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatableWidget*               Temp_object_Variable_4;                            // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonMessagingResult Result)> K2Node_CreateDelegate_OutputDelegate_8;           // 0x01C8(0x0010)(ZeroConstructor, NoDestructor)
	ECommonMessagingResult                        K2Node_CustomEvent_Result_1;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        Temp_byte_Variable;                                // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAsyncAction_ShowConfirmation*          CallFunc_ShowConfirmationYesNo_ReturnValue;        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_5;                   // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_9; // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_4;                   // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_10; // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatableWidget*               Temp_object_Variable_5;                            // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_11; // 0x0228(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_3;                   // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_2;                   // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_12; // 0x0248(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatableWidget*               Temp_object_Variable_6;                            // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonMessagingResult Result)> K2Node_CreateDelegate_OutputDelegate_13;          // 0x0260(0x0010)(ZeroConstructor, NoDestructor)
	ECommonMessagingResult                        K2Node_CustomEvent_Result;                         // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonMessagingResult                        Temp_byte_Variable_1;                              // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_14; // 0x0274(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_1;                   // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget;                     // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_15; // 0x0298(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatableWidget*               Temp_object_Variable_7;                            // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAMatchMakerSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSearchInProgress_ReturnValue;           // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAMatchMakerSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAMatchMakerSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSearchInProgress_ReturnValue_1;         // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_16;                  // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue; // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue_1; // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMAPlayerControllerBase*                K2Node_DynamicCast_AsMAPlayer_Controller_Base;     // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMALocalPlayer*                         CallFunc_GetMALocalPlayer_ReturnValue;             // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_16; // 0x0330(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue_2; // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue_3; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_4;            // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue_4; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_17;                  // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_5;            // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue_5; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_14;              // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_13;              // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_12;              // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_11;              // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_6;            // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue_6; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_17; // 0x03D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_7;            // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue_7; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_10;              // 0x0400(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_9;               // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_8;               // 0x0410(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_7;               // 0x0418(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x0420(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0428(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Menu_C*                             K2Node_Event_Widget;                               // 0x0430(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameInstance*                        K2Node_DynamicCast_AsMAGame_Instance;              // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetProjectVersionString_ReturnValue;      // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0460(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0478(0x0018)()
	class UAsyncAction_ShowConfirmation*          CallFunc_ShowConfirmationOk_ReturnValue;           // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x7];                                      // 0x0499(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_8;            // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x04B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue_8; // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushContentToLayer_ForPlayer_ReturnValue; // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UMALocalPlayer* LocalPlayer)> K2Node_CreateDelegate_OutputDelegate_18;      // 0x04D4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_14;                  // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_15;                  // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_19; // 0x04F8(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0508(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_20; // 0x0510(0x0010)(ZeroConstructor, NoDestructor)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue_1;       // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               CallFunc_PushContentToLayer_ForPlayer_ReturnValue_1; // 0x0528(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0530(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               Temp_object_Variable_8;                            // 0x0538(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0540(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0548(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_ExecuteUbergraph_W_Midair_Frontend;

// Function W_Midair_Frontend.W_Midair_Frontend_C.Tick
// 0x003C (0x003C - 0x0000)
struct W_Midair_Frontend_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_Tick;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_QuickPlayBtn_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_QuickPlayBtn_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_QuickPlayBtn_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_QuickPlayBtn_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_QuickPlayBtn_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_QuickPlayBtn_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_QuickPlayDuelBtn_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_QuickPlayDuelBtn_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_QuickPlayDuelBtn_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_StoreBTN_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_StoreBTN_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_StoreBTN_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_PracticeButton_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_PracticeButton_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_PracticeButton_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.StackRef
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_StackRef final
{
public:
	class UBP_Menu_C*                             Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_StackRef;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_CreditsBTN_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_CreditsBTN_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_CreditsBTN_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_PatreonBTN_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_PatreonBTN_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_PatreonBTN_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_WishlistBTN_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_WishlistBTN_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_WishlistBTN_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_DiscordBTN_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_DiscordBTN_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_DiscordBTN_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_MatchHistoryButton_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_MatchHistoryButton_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_MatchHistoryButton_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_6_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_6_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_6_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_4_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_4_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_4_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_2_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_2_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_2_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_1_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_1_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_1_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BndEvt__W_Midair_Frontend_ServerBrowserButton1_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_ServerBrowserButton1_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BndEvt__W_Midair_Frontend_ServerBrowserButton1_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BeforePush_E8C78673451B8E17361511AC2CAC35CC
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BeforePush_E8C78673451B8E17361511AC2CAC35CC final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BeforePush_E8C78673451B8E17361511AC2CAC35CC;

// Function W_Midair_Frontend.W_Midair_Frontend_C.AfterPush_E8C78673451B8E17361511AC2CAC35CC
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_AfterPush_E8C78673451B8E17361511AC2CAC35CC final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_AfterPush_E8C78673451B8E17361511AC2CAC35CC;

// Function W_Midair_Frontend.W_Midair_Frontend_C.OnResult_F3C721EC4F56A0AAD0641DB695698C55
// 0x0001 (0x0001 - 0x0000)
struct W_Midair_Frontend_C_OnResult_F3C721EC4F56A0AAD0641DB695698C55 final
{
public:
	ECommonMessagingResult                        Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_OnResult_F3C721EC4F56A0AAD0641DB695698C55;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BeforePush_9B9FCFC14EBB4133484E92977ADC2E4B
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BeforePush_9B9FCFC14EBB4133484E92977ADC2E4B final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BeforePush_9B9FCFC14EBB4133484E92977ADC2E4B;

// Function W_Midair_Frontend.W_Midair_Frontend_C.AfterPush_9B9FCFC14EBB4133484E92977ADC2E4B
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_AfterPush_9B9FCFC14EBB4133484E92977ADC2E4B final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_AfterPush_9B9FCFC14EBB4133484E92977ADC2E4B;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BeforePush_B7CF16BB408CD8C89D2A4781BF61F741
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BeforePush_B7CF16BB408CD8C89D2A4781BF61F741 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BeforePush_B7CF16BB408CD8C89D2A4781BF61F741;

// Function W_Midair_Frontend.W_Midair_Frontend_C.AfterPush_B7CF16BB408CD8C89D2A4781BF61F741
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_AfterPush_B7CF16BB408CD8C89D2A4781BF61F741 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_AfterPush_B7CF16BB408CD8C89D2A4781BF61F741;

// Function W_Midair_Frontend.W_Midair_Frontend_C.OnResult_2012FB8D4D74C5C6CFBCE1A1C25CBBBA
// 0x0001 (0x0001 - 0x0000)
struct W_Midair_Frontend_C_OnResult_2012FB8D4D74C5C6CFBCE1A1C25CBBBA final
{
public:
	ECommonMessagingResult                        Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_OnResult_2012FB8D4D74C5C6CFBCE1A1C25CBBBA;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BeforePush_0DE179484EAD1ADF7248F2BAFE7F2A29
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BeforePush_0DE179484EAD1ADF7248F2BAFE7F2A29 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BeforePush_0DE179484EAD1ADF7248F2BAFE7F2A29;

// Function W_Midair_Frontend.W_Midair_Frontend_C.AfterPush_0DE179484EAD1ADF7248F2BAFE7F2A29
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_AfterPush_0DE179484EAD1ADF7248F2BAFE7F2A29 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_AfterPush_0DE179484EAD1ADF7248F2BAFE7F2A29;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BeforePush_C9BF5ABA46345925969BA8A13E84A19C
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BeforePush_C9BF5ABA46345925969BA8A13E84A19C final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BeforePush_C9BF5ABA46345925969BA8A13E84A19C;

// Function W_Midair_Frontend.W_Midair_Frontend_C.AfterPush_C9BF5ABA46345925969BA8A13E84A19C
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_AfterPush_C9BF5ABA46345925969BA8A13E84A19C final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_AfterPush_C9BF5ABA46345925969BA8A13E84A19C;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BeforePush_5BF5B38B4C807927AE537792AB994C3C
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BeforePush_5BF5B38B4C807927AE537792AB994C3C final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BeforePush_5BF5B38B4C807927AE537792AB994C3C;

// Function W_Midair_Frontend.W_Midair_Frontend_C.AfterPush_5BF5B38B4C807927AE537792AB994C3C
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_AfterPush_5BF5B38B4C807927AE537792AB994C3C final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_AfterPush_5BF5B38B4C807927AE537792AB994C3C;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BeforePush_B3C73CC64038064FD2F402AEC2CE0B64
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BeforePush_B3C73CC64038064FD2F402AEC2CE0B64 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BeforePush_B3C73CC64038064FD2F402AEC2CE0B64;

// Function W_Midair_Frontend.W_Midair_Frontend_C.AfterPush_B3C73CC64038064FD2F402AEC2CE0B64
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_AfterPush_B3C73CC64038064FD2F402AEC2CE0B64 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_AfterPush_B3C73CC64038064FD2F402AEC2CE0B64;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BeforePush_131659D140FD097E7AFE30A348D8FFD1
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BeforePush_131659D140FD097E7AFE30A348D8FFD1 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BeforePush_131659D140FD097E7AFE30A348D8FFD1;

// Function W_Midair_Frontend.W_Midair_Frontend_C.AfterPush_131659D140FD097E7AFE30A348D8FFD1
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_AfterPush_131659D140FD097E7AFE30A348D8FFD1 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_AfterPush_131659D140FD097E7AFE30A348D8FFD1;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BeforePush_0981B51345F5948CF92DD29783231F8D
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BeforePush_0981B51345F5948CF92DD29783231F8D final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BeforePush_0981B51345F5948CF92DD29783231F8D;

// Function W_Midair_Frontend.W_Midair_Frontend_C.AfterPush_0981B51345F5948CF92DD29783231F8D
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_AfterPush_0981B51345F5948CF92DD29783231F8D final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_AfterPush_0981B51345F5948CF92DD29783231F8D;

// Function W_Midair_Frontend.W_Midair_Frontend_C.NewFunction_0
// 0x00B8 (0x00B8 - 0x0000)
struct W_Midair_Frontend_C_NewFunction_0 final
{
public:
	struct FEventReply                            ReturnValue;                                       // 0x0000(0x00B8)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_NewFunction_0;

// Function W_Midair_Frontend.W_Midair_Frontend_C.IsMidairDevVisibility
// 0x0020 (0x0020 - 0x0000)
struct W_Midair_Frontend_C_IsMidairDevVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameInstance*                        K2Node_DynamicCast_AsMAGame_Instance;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMidairDeveloper_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_IsMidairDevVisibility;

// Function W_Midair_Frontend.W_Midair_Frontend_C.GetCreditText
// 0x0048 (0x0048 - 0x0000)
struct W_Midair_Frontend_C_GetCreditText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_GetCreditText;

// Function W_Midair_Frontend.W_Midair_Frontend_C.On Balance Updated
// 0x0030 (0x0030 - 0x0000)
struct W_Midair_Frontend_C_On_Balance_Updated final
{
public:
	class UMALocalPlayer*                         LocalPlayer;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_On_Balance_Updated;

// Function W_Midair_Frontend.W_Midair_Frontend_C.SetMatchmakingButtonText
// 0x0040 (0x0040 - 0x0000)
struct W_Midair_Frontend_C_SetMatchmakingButtonText final
{
public:
	class FText                                   ButtonText;                                        // 0x0000(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAMatchMakerSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSearchInProgress_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAMatchMakerSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMAMatchmakingStatus                          CallFunc_GetCurrentStatus_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_SetMatchmakingButtonText;

// Function W_Midair_Frontend.W_Midair_Frontend_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct W_Midair_Frontend_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_Midair_Frontend_C_BP_GetDesiredFocusTarget;

}

