#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MidairServerButton

#include "Basic.hpp"

#include "Midair2_classes.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MidairServerButton.W_MidairServerButton_C
// 0x0188 (0x0D48 - 0x0BC0)
class UW_MidairServerButton_C final : public UMAButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BC0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnPressed;                                         // 0x0BC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0BD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 LockImage;                                         // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MapTextBox;                                        // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PingText;                                          // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerCountText;                                   // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ServerNameText;                                    // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ServerVersionText;                                 // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FBlueprintSessionResult                Session;                                           // 0x0C08(0x0128)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FString                                 ServerName;                                        // 0x0D30(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0D40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void SetIsPressed(bool IsPressed_0);
	struct FSlateBrush Get_ButtonBorder_Background_0();
	void SetIsPassworded(bool bIsPassworded);
	void SetTexts(const class FText& ServerName_0, const class FText& mapName, const class FText& Ping, const class FText& PlayerCount, const class FText& Version);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ExecuteUbergraph_W_MidairServerButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_MidairServerButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_MidairServerButton_C")
	}
	static class UW_MidairServerButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MidairServerButton_C>();
	}
};
DUMPER7_ASSERTS_UW_MidairServerButton_C;

}

