#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MidairServerButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_MidairServerButton.W_MidairServerButton_C.SetIsPressed
// 0x0018 (0x0018 - 0x0000)
struct W_MidairServerButton_C_SetIsPressed final
{
public:
	bool                                          IsPressed_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MidairServerButton_C_SetIsPressed;

// Function W_MidairServerButton.W_MidairServerButton_C.Get_ButtonBorder_Background_0
// 0x01B8 (0x01B8 - 0x0000)
struct W_MidairServerButton_C_Get_ButtonBorder_Background_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00A8(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0130(0x0088)()
};
DUMPER7_ASSERTS_W_MidairServerButton_C_Get_ButtonBorder_Background_0;

// Function W_MidairServerButton.W_MidairServerButton_C.SetIsPassworded
// 0x0001 (0x0001 - 0x0000)
struct W_MidairServerButton_C_SetIsPassworded final
{
public:
	bool                                          bIsPassworded;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_W_MidairServerButton_C_SetIsPassworded;

// Function W_MidairServerButton.W_MidairServerButton_C.SetTexts
// 0x0078 (0x0078 - 0x0000)
struct W_MidairServerButton_C_SetTexts final
{
public:
	class FText                                   ServerName_0;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   mapName;                                           // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Ping;                                              // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   PlayerCount;                                       // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Version;                                           // 0x0060(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_W_MidairServerButton_C_SetTexts;

// Function W_MidairServerButton.W_MidairServerButton_C.ExecuteUbergraph_W_MidairServerButton
// 0x0018 (0x0018 - 0x0000)
struct W_MidairServerButton_C_ExecuteUbergraph_W_MidairServerButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_MidairServerButton_C_ExecuteUbergraph_W_MidairServerButton;

}

