#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Midair_MenuBtn

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_Midair_MenuBtn.W_Midair_MenuBtn_C.ExecuteUbergraph_W_Midair_MenuBtn
// 0x0040 (0x0040 - 0x0000)
struct W_Midair_MenuBtn_C_ExecuteUbergraph_W_Midair_MenuBtn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_InText;                               // 0x0028(0x0018)(ConstParm)
};
DUMPER7_ASSERTS_W_Midair_MenuBtn_C_ExecuteUbergraph_W_Midair_MenuBtn;

// Function W_Midair_MenuBtn.W_Midair_MenuBtn_C.UpdateButtonText
// 0x0018 (0x0018 - 0x0000)
struct W_Midair_MenuBtn_C_UpdateButtonText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_W_Midair_MenuBtn_C_UpdateButtonText;

// Function W_Midair_MenuBtn.W_Midair_MenuBtn_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Midair_MenuBtn_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_W_Midair_MenuBtn_C_PreConstruct;

}

