#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Midair_Frontend

#include "Basic.hpp"

#include "Midair2_structs.hpp"
#include "Midair2_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Midair_Frontend.W_Midair_Frontend_C
// 0x0208 (0x06F8 - 0x04F0)
class UW_Midair_Frontend_C final : public UMAMainMenuScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBP_ExtendedProgressBar_C*              BP_ExtendedProgressBar;                            // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_1;                                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_1;                              // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_89;                             // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget_520;                            // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Creditimg;                                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    CreditsBTN;                                        // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CreditsText;                                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    CustomMatchButton;                                 // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    DiscordBTN;                                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ExtraOptions;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_TabMenu_Button_C*             ExtrasButton;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_123;                                         // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    LeaderboardsButton;                                // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LevelText_1;                                       // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    LoadoutButton;                                     // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ManaShardimg;                                      // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    MatchHistoryButton;                                // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              MenuSafeZone;                                      // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              MenuSafeZone_1;                                    // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    PatreonBTN;                                        // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_TabMenu_Button_C*             PlayButton;                                        // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerNameText_1;                                  // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PlayOtions;                                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    PracticeButton;                                    // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    PracticeButton_1;                                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_TabMenu_Button_C*             ProfileButton;                                     // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ProfileOptions;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                QuitButton;                                        // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_144;                                      // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    ServerBrowserButton;                               // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SettingsButton;                                    // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ShardText;                                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_84;                                        // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    StatsButton;                                       // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    StoreBTN;                                          // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    TutorialBTN;                                       // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Version;                                           // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_FriendsOverlay_C*                    W_FriendsOverlay;                                  // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Uw_Quickplay_Widget_C*                  w_Quickplay_Widget;                                // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_WelcomeWidget_C*                     W_WelcomeWidget;                                   // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NewsIcon_C*                        WBP_NewsIcon_183;                                  // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    WishlistBTN;                                       // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             XpInfoTB;                                          // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_Menu_C*                             MenuStack;                                         // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMALocalPlayer*                         MALocalPlayer;                                     // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 PlayerName;                                        // 0x0688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CurrentTicketId;                                   // 0x0698(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 SelectedMatchmakingGameMode;                       // 0x06A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsInMatchmakingQueue;                              // 0x06B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TicketRefreshTimerHandle;                          // 0x06C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FMAQueueInfo                           CurrentQueueInfo;                                  // 0x06C8(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         NewNewsCount;                                      // 0x06DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNewsOpen;                                        // 0x06E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_NewsPanel_C*                       As_WBP_News_Panel;                                 // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           FriendRefreshTimer;                                // 0x06F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_Midair_Frontend(int32 EntryPoint);
	void BndEvt__W_Midair_Frontend_TutorialBTN_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_Midair_Frontend_Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__W_Midair_Frontend_WBP_NewsIcon_183_K2Node_ComponentBoundEvent_3_OnNewsClicked__DelegateSignature();
	void RefreshMatchmakingQueueInfo();
	void BndEvt__W_Midair_Frontend_StoreBTN_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_Midair_Frontend_PracticeButton_1_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_HandleQuit();
	void BndEvt__W_Midair_Frontend_CreditsBTN_K2Node_ComponentBoundEvent_21_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_Midair_Frontend_PatreonBTN_K2Node_ComponentBoundEvent_20_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_Midair_Frontend_WishlistBTN_K2Node_ComponentBoundEvent_19_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_Midair_Frontend_DiscordBTN_K2Node_ComponentBoundEvent_18_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_Midair_Frontend_MatchHistoryButton_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_6_K2Node_ComponentBoundEvent_16_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_4_K2Node_ComponentBoundEvent_15_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_2_K2Node_ComponentBoundEvent_14_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_Midair_Frontend_W_Midair_MenuBtn_1_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_Midair_Frontend_ServerBrowserButton1_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_Midair_Frontend_QuitButton_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void Go_To_Quit();
	void GoToSettings();
	void BndEvt__W_Midair_Frontend_SettingsButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void StackRef(class UBP_Menu_C* Widget);
	void OnResult_CAB67D6340E05BE1EA6629BEFE0091D5(ECommonMessagingResult Result);
	void BeforePush_24E70A3045643AACE8B16689CF54F953(class UCommonActivatableWidget* UserWidget);
	void AfterPush_24E70A3045643AACE8B16689CF54F953(class UCommonActivatableWidget* UserWidget);
	void BeforePush_9FA6C86B4A78DB9C9604B8B19C200AA4(class UCommonActivatableWidget* UserWidget);
	void AfterPush_9FA6C86B4A78DB9C9604B8B19C200AA4(class UCommonActivatableWidget* UserWidget);
	void OnSuccess_7702AF134C15C94CA0A6118FCB1BC948(const struct FMAQueueInfo& QueueInfo);
	void OnFail_7702AF134C15C94CA0A6118FCB1BC948(const struct FMAQueueInfo& QueueInfo);
	void BeforePush_E8C78673451B8E17361511AC2CAC35CC(class UCommonActivatableWidget* UserWidget);
	void AfterPush_E8C78673451B8E17361511AC2CAC35CC(class UCommonActivatableWidget* UserWidget);
	void OnResult_F3C721EC4F56A0AAD0641DB695698C55(ECommonMessagingResult Result);
	void BeforePush_0DE179484EAD1ADF7248F2BAFE7F2A29(class UCommonActivatableWidget* UserWidget);
	void AfterPush_0DE179484EAD1ADF7248F2BAFE7F2A29(class UCommonActivatableWidget* UserWidget);
	void BeforePush_C9BF5ABA46345925969BA8A13E84A19C(class UCommonActivatableWidget* UserWidget);
	void AfterPush_C9BF5ABA46345925969BA8A13E84A19C(class UCommonActivatableWidget* UserWidget);
	void BeforePush_5BF5B38B4C807927AE537792AB994C3C(class UCommonActivatableWidget* UserWidget);
	void AfterPush_5BF5B38B4C807927AE537792AB994C3C(class UCommonActivatableWidget* UserWidget);
	void BeforePush_131659D140FD097E7AFE30A348D8FFD1(class UCommonActivatableWidget* UserWidget);
	void AfterPush_131659D140FD097E7AFE30A348D8FFD1(class UCommonActivatableWidget* UserWidget);
	void BeforePush_0981B51345F5948CF92DD29783231F8D(class UCommonActivatableWidget* UserWidget);
	void AfterPush_0981B51345F5948CF92DD29783231F8D(class UCommonActivatableWidget* UserWidget);
	void BeforePush_B3C73CC64038064FD2F402AEC2CE0B64(class UCommonActivatableWidget* UserWidget);
	void AfterPush_B3C73CC64038064FD2F402AEC2CE0B64(class UCommonActivatableWidget* UserWidget);
	void OnResult_2012FB8D4D74C5C6CFBCE1A1C25CBBBA(ECommonMessagingResult Result);
	void BeforePush_B7CF16BB408CD8C89D2A4781BF61F741(class UCommonActivatableWidget* UserWidget);
	void AfterPush_B7CF16BB408CD8C89D2A4781BF61F741(class UCommonActivatableWidget* UserWidget);
	void BeforePush_9B9FCFC14EBB4133484E92977ADC2E4B(class UCommonActivatableWidget* UserWidget);
	void AfterPush_9B9FCFC14EBB4133484E92977ADC2E4B(class UCommonActivatableWidget* UserWidget);
	struct FEventReply NewFunction_0();
	ESlateVisibility IsMidairDevVisibility();
	class FText GetCreditText();
	void On_Balance_Updated(class UMALocalPlayer* LocalPlayer);
	ESlateVisibility GetVisibility_0();
	void TryShowWelcomeWidget();
	void On_Wallet_Updated(class UMALocalPlayer* LocalPlayer);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Midair_Frontend_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Midair_Frontend_C")
	}
	static class UW_Midair_Frontend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Midair_Frontend_C>();
	}
};
DUMPER7_ASSERTS_UW_Midair_Frontend_C;

}

