#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: w_Quickplay_Widget

#include "Basic.hpp"

#include "Midair2_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass w_Quickplay_Widget.w_Quickplay_Widget_C
// 0x0090 (0x02F0 - 0x0260)
class Uw_Quickplay_Widget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnCancel;                                          // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnSearching;                                       // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_1;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonText;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_143;                               // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ModeImage;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PlayersInQueueTxt;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   QueueText;                                         // 0x02C0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FMMQueueInfo                           Queue_Info;                                        // 0x02D8(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_w_Quickplay_Widget(int32 EntryPoint);
	void OnQueueUpdated(EMAMatchmakingStatus UpdatedStatus);
	void Construct();
	void OnMatchReady();
	void On_Queue_Count_Updated(const struct FMMQueueInfo& QueueInfo);
	void QueueSelected();
	void BndEvt__w_Quickplay_Widget_Button_0_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__w_Quickplay_Widget_Button_1_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__w_Quickplay_Widget_Button_1_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__w_Quickplay_Widget_Button_1_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void RefreshMatchmakingQueueInfo();
	void OnSuccess_753C800F4189C84984C5EC90F4FB2FD6(const struct FMAQueueInfo& QueueInfo);
	void OnFail_753C800F4189C84984C5EC90F4FB2FD6(const struct FMAQueueInfo& QueueInfo);
	class FText GetButtonTextFromStatus();
	ESlateVisibility GetOverlayVisibility();
	class FText GetText_0();
	struct FSlateBrush Get_ModeImage_Brush_0();
	void SetQueueText();
	bool GetButton0IsEnabled();
	bool IsButtonEnabledForParty();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("w_Quickplay_Widget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"w_Quickplay_Widget_C")
	}
	static class Uw_Quickplay_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uw_Quickplay_Widget_C>();
	}
};
DUMPER7_ASSERTS_Uw_Quickplay_Widget_C;

}

