#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ServerPasswordDialog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Midair2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ServerPasswordDialog.W_ServerPasswordDialog_C
// 0x0038 (0x0360 - 0x0328)
class UW_ServerPasswordDialog_C final : public UMAActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ServerNameTB;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       ServerPasswordET;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    W_Midair_MenuBtn;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    W_Midair_MenuBtn_1;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class FText Password)> OnConnect;                                  // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__W_LobbyJoinCode_W_Midair_MenuBtn_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_LobbyJoinCode_W_Midair_MenuBtn_1_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__W_ServerPasswordDialog_ServerPasswordET_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void ExecuteUbergraph_W_ServerPasswordDialog(int32 EntryPoint);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_ServerPasswordDialog_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_ServerPasswordDialog_C")
	}
	static class UW_ServerPasswordDialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ServerPasswordDialog_C>();
	}
};
DUMPER7_ASSERTS_UW_ServerPasswordDialog_C;

}

