#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ServerBrowser

#include "Basic.hpp"

#include "OnlineSubsystemUtils_structs.hpp"
#include "Engine_structs.hpp"
#include "Midair2_structs.hpp"
#include "Midair2_classes.hpp"
#include "CommonGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_ServerBrowser.W_ServerBrowser_C
// 0x0200 (0x0528 - 0x0328)
class UW_ServerBrowser_C final : public UMAServerBrowserScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBoundActionBar*                  BottomActionBar;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              BottomSZ;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_87;                                // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              HideFullServers;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              HidePasswordedServers;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    JoinServerTN;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MenuBorder;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                NoGamesBorder;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NoGamesMessage;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Midair_MenuBtn_C*                    RefreshButton;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      RefreshThrobber;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMAListView*                            ServersBox;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMAGameInstance*                        GameInstance;                                      // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRefreshing;                                      // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EFindSessionsSortMethod                       CurrentSortMethod;                                 // 0x0399(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A[0x2];                                      // 0x039A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LastRefreshTS;                                     // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_ServerBrowserEntry_C*                SelectedServer;                                    // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UCommonSession_SearchResult*>    CurrentSessions;                                   // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FBlueprintSessionResult>        Results;                                           // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Password;                                          // 0x03C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBlueprintSessionResult                SelectedBPSession;                                 // 0x03E0(0x0128)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bHasSelection;                                     // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_ServerBrowserEntry_C*                CurrentServerEntry;                                // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBlueprintSessionResult>        EditorResults;                                     // 0x0518(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_W_ServerBrowser(int32 EntryPoint);
	void BndEvt__W_ServerBrowser_JoinServerTN_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Join();
	void SetPassword(const class FText& Password_0);
	void RemoveFull();
	void BndEvt__W_ServerBrowser_HideFullServers_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void ItemDblClicked(class UCommonSession_SearchResult* Session, class UW_ServerBrowserEntry_C* ServerEntry);
	void ItemClicked(class UCommonSession_SearchResult* Session, class UW_ServerBrowserEntry_C* ServerEntry);
	void ItemGenerated(class UUserWidget* Widget);
	void RemovePassworded();
	void BndEvt__W_ServerBrowser_HidePasswordedServers_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__W_ServerBrowser_RefreshButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void TryJoin();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TryRefresh();
	void On_Found_Sessions(const TArray<struct FBlueprintSessionResult>& Results_0);
	void Construct();
	void OnResult_E555FF234B45C714435190878E5BA440(ECommonMessagingResult Result);
	void BeforePush_22F61AD9458EA259C2F72D86D8F3ED50(class UCommonActivatableWidget* UserWidget);
	void AfterPush_22F61AD9458EA259C2F72D86D8F3ED50(class UCommonActivatableWidget* UserWidget);
	void OnSuccess_C9F759C3444CBA23A0E5DCA53C5BD0B2();
	void OnFailure_C9F759C3444CBA23A0E5DCA53C5BD0B2();
	bool GetJoinButtonIsEnabled();
	bool Get_RefreshButton_bIsEnabled_0();
	void Filter_Servers_by_Version(TArray<struct FBlueprintSessionResult>& Servers, TArray<struct FBlueprintSessionResult>* Filtered);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_ServerBrowser_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_ServerBrowser_C")
	}
	static class UW_ServerBrowser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_ServerBrowser_C>();
	}
};
DUMPER7_ASSERTS_UW_ServerBrowser_C;

}

