#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SettingsListEntry_Scalar

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_SettingsListEntry_Scalar.W_SettingsListEntry_Scalar_C.ExecuteUbergraph_W_SettingsListEntry_Scalar
// 0x0028 (0x0028 - 0x0000)
struct W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Value;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DefaultValue;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_SettingsListEntry_Scalar_C_ExecuteUbergraph_W_SettingsListEntry_Scalar;

// Function W_SettingsListEntry_Scalar.W_SettingsListEntry_Scalar_C.OnDefaultValueChanged
// 0x0004 (0x0004 - 0x0000)
struct W_SettingsListEntry_Scalar_C_OnDefaultValueChanged final
{
public:
	float                                         DefaultValue;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_SettingsListEntry_Scalar_C_OnDefaultValueChanged;

// Function W_SettingsListEntry_Scalar.W_SettingsListEntry_Scalar_C.OnValueChanged
// 0x0004 (0x0004 - 0x0000)
struct W_SettingsListEntry_Scalar_C_OnValueChanged final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_W_SettingsListEntry_Scalar_C_OnValueChanged;

}

