#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabRoute_Details

#include "Basic.hpp"

#include "Midair2_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TabRoute_Details.WBP_TabRoute_Details_C
// 0x0220 (0x0480 - 0x0260)
class UWBP_TabRoute_Details_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEditableTextBox*                       EditableTextBox_Name;                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HitMarkersText;                                    // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_284;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Orb;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableTextBox*              MultiLineEditableTextBox_Description;              // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SelectedRouteTrailAverageSpeed;                    // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SelectedRouteTrailCaptureSpeed;                    // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SelectedRouteTrailCaptureTIme;                     // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SelectedRouteTrailGrabSpeed;                       // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SelectedRouteTrailGrabTime;                        // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SelectedRouteTrailMaxSpeed;                        // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SelectedRouteTrailTotalTime;                       // 0x02C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlayDisabled;                            // 0x02C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalMarkersText;                                  // 0x02D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Details;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Action_C*                   WBP_Button_Goto;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Action_C*                   WBP_Button_Grab;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Action_C*                   WBP_Button_Hide;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Action_C*                   WBP_Button_Play;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Action_C*                   WBP_Button_Record;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Action_C*                   WBP_Button_Save;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Action_C*                   WBP_Button_Spawn_Bot;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Action_C*                   WBP_Button_Start;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Action_C*                   WBP_Button_Stop;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DifficultySelector_C*              WBP_DifficultySelector_Orb;                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DifficultySelector_C*              WBP_DifficultySelector_Route;                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MarkerSelector_C*                  WBP_MarkerSelector;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RouteTypeSelector_C*               WBP_RouteTypeSelector;                             // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_C*                           WBP_Title;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMARouteTrail                          Route;                                             // 0x0350(0x0100)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              Go_Back;                                           // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          RecordingRoute;                                    // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShowTrail;                                         // 0x0461(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_462[0x6];                                      // 0x0462(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              Route_Updated;                                     // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          PawnMoving;                                        // 0x0478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlayDisabled;                                      // 0x0479(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_TabRoute_Details(int32 EntryPoint);
	void BndEvt__WBP_TabRoute_Details_WBP_Button_Spawn_Bot_K2Node_ComponentBoundEvent_13_Action_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabRoute_Details_WBP_RouteTypeSelector_K2Node_ComponentBoundEvent_12_RouteTypeSelected__DelegateSignature(const class FString& RouteType);
	void BndEvt__WBP_TabRoute_Details_WBP_DifficultySelector_Route_K2Node_ComponentBoundEvent_8_DifficultySelected__DelegateSignature(ERouteTrailDifficulty Difficulty);
	void BndEvt__WBP_TabRoute_Details_WBP_Button_Start_K2Node_ComponentBoundEvent_11_Action_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabRoute_Details_WBP_Button_Grab_K2Node_ComponentBoundEvent_10_Action_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabRoute_Details_WBP_DifficultySelector_K2Node_ComponentBoundEvent_1_DifficultySelected__DelegateSignature(ERouteTrailDifficulty Difficulty);
	void BndEvt__WBP_TabRoute_Details_WBP_MarkerSelector_K2Node_ComponentBoundEvent_9_Marker_Index_Updated__DelegateSignature(int32 MarkerIndex);
	void BndEvt__WBP_TabRoute_Details_WBP_Button_Save_K2Node_ComponentBoundEvent_0_Action_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabRoute_Details_WBP_Button_Stop_K2Node_ComponentBoundEvent_7_Action_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabRoute_Details_WBP_Button_Goto_K2Node_ComponentBoundEvent_6_Action_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabRoute_Details_WBP_Button_Hide_K2Node_ComponentBoundEvent_5_Action_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabRoute_Details_WBP_Button_Play_K2Node_ComponentBoundEvent_4_Action_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabRoute_Details_WBP_Button_Record_K2Node_ComponentBoundEvent_3_Action_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabRoute_Details_WBP_Title_K2Node_ComponentBoundEvent_2_Title_Clicked__DelegateSignature();
	void Construct();
	void GetMAPracticeComponentForWidget(class UMAPracticeComponent** MAPracticeComponent);
	void Set_Route_Trail(const struct FMARouteTrail& RouteTrail);
	void SaveRoute(class UMAPracticeComponent* MAPracticeComponent);
	ESlateVisibility Get_TextBlock_PlayDisabled_Visibility_0();
	bool Get_WBP_Button_Play_bIsEnabled_0();
	class FText Get_SelectedRouteTrailGrabSpeed_Text_0();
	class FText Get_SelectedRouteTrailGrabTime_Text_0();
	class FText Get_SelectedRouteTrailCaptureTIme_Text_0();
	class FText Get_SelectedRouteTrailTotalTime_Text_0();
	class FText Get_SelectedRouteTrailCaptureSpeed_Text_0();
	class FText Get_SelectedRouteTrailMaxSpeed_Text_0();
	class FText Get_SelectedRouteTrailAverageSpeed_Text_0();
	class FText Get_HitMarkersText_Text_0();
	class FText Get_TotalMarkersText_Text_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TabRoute_Details_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TabRoute_Details_C")
	}
	static class UWBP_TabRoute_Details_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TabRoute_Details_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TabRoute_Details_C;

}

