#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ExperienceBar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ExperienceBar.WBP_ExperienceBar_C.ExecuteUbergraph_WBP_ExperienceBar
// 0x0008 (0x0008 - 0x0000)
struct WBP_ExperienceBar_C_ExecuteUbergraph_WBP_ExperienceBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_ExperienceBar_C_ExecuteUbergraph_WBP_ExperienceBar;

// Function WBP_ExperienceBar.WBP_ExperienceBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ExperienceBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_ExperienceBar_C_PreConstruct;

// Function WBP_ExperienceBar.WBP_ExperienceBar_C.SetBarSize
// 0x0004 (0x0004 - 0x0000)
struct WBP_ExperienceBar_C_SetBarSize final
{
public:
	float                                         Height;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ExperienceBar_C_SetBarSize;

// Function WBP_ExperienceBar.WBP_ExperienceBar_C.SetBarPadding
// 0x0014 (0x0014 - 0x0000)
struct WBP_ExperienceBar_C_SetBarPadding final
{
public:
	float                                         Padding_0;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_ExperienceBar_C_SetBarPadding;

}

