#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatDisplay_Scoreboard_NoTitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatDisplay_Scoreboard_NoTitle.WBP_StatDisplay_Scoreboard_NoTitle_C
// 0x0030 (0x0290 - 0x0260)
class UWBP_StatDisplay_Scoreboard_NoTitle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ScoreDisplay;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   StatName;                                          // 0x0270(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         StatValue;                                         // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bDisplayDecimals;                                  // 0x028C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_StatDisplay_Scoreboard_NoTitle(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	class FText Get_ScoreDisplay_Text_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_StatDisplay_Scoreboard_NoTitle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_StatDisplay_Scoreboard_NoTitle_C")
	}
	static class UWBP_StatDisplay_Scoreboard_NoTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatDisplay_Scoreboard_NoTitle_C>();
	}
};
DUMPER7_ASSERTS_UWBP_StatDisplay_Scoreboard_NoTitle_C;

}

