#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AudioSettings

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_AudioSettings.WBP_AudioSettings_C.ExecuteUbergraph_WBP_AudioSettings
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_NewValue_10;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSoundClassVolume_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSoundClassVolume_ReturnValue_1;        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSoundClassVolume_ReturnValue_2;        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSoundClassVolume_ReturnValue_3;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSoundClassVolume_ReturnValue_4;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSoundClassVolume_ReturnValue_5;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_NewValue_9;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_NewValue_8;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_NewValue_7;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue_2;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue_3;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_NewValue_6;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_NewValue_5;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_NewValue_4;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_NewValue_3;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_NewValue_2;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue_4;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue_5;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue_6;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue_7;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue_8;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue_9;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue_10;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_NewValue_1;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_NewValue;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue_11;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue_12;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_NewValue_11;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings;

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__UISlider_K2Node_ComponentBoundEvent_1_ValueApplied__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__UISlider_K2Node_ComponentBoundEvent_1_ValueApplied__DelegateSignature final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_AudioSettings_C_BndEvt__UISlider_K2Node_ComponentBoundEvent_1_ValueApplied__DelegateSignature;

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__UISlider_K2Node_ComponentBoundEvent_0_ValueAdjusted__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__UISlider_K2Node_ComponentBoundEvent_0_ValueAdjusted__DelegateSignature final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_AudioSettings_C_BndEvt__UISlider_K2Node_ComponentBoundEvent_0_ValueAdjusted__DelegateSignature;

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__VoiceSlider_K2Node_ComponentBoundEvent_156_ValueApplied__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__VoiceSlider_K2Node_ComponentBoundEvent_156_ValueApplied__DelegateSignature final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_AudioSettings_C_BndEvt__VoiceSlider_K2Node_ComponentBoundEvent_156_ValueApplied__DelegateSignature;

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__FlagSlider_K2Node_ComponentBoundEvent_146_ValueApplied__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__FlagSlider_K2Node_ComponentBoundEvent_146_ValueApplied__DelegateSignature final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_AudioSettings_C_BndEvt__FlagSlider_K2Node_ComponentBoundEvent_146_ValueApplied__DelegateSignature;

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__MusicSlider_K2Node_ComponentBoundEvent_137_ValueApplied__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__MusicSlider_K2Node_ComponentBoundEvent_137_ValueApplied__DelegateSignature final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_AudioSettings_C_BndEvt__MusicSlider_K2Node_ComponentBoundEvent_137_ValueApplied__DelegateSignature;

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__EffectsSlider_K2Node_ComponentBoundEvent_129_ValueApplied__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__EffectsSlider_K2Node_ComponentBoundEvent_129_ValueApplied__DelegateSignature final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_AudioSettings_C_BndEvt__EffectsSlider_K2Node_ComponentBoundEvent_129_ValueApplied__DelegateSignature;

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__MasterSlider_K2Node_ComponentBoundEvent_122_ValueApplied__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__MasterSlider_K2Node_ComponentBoundEvent_122_ValueApplied__DelegateSignature final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_AudioSettings_C_BndEvt__MasterSlider_K2Node_ComponentBoundEvent_122_ValueApplied__DelegateSignature;

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__VoiceSlider_K2Node_ComponentBoundEvent_14_ValueAdjusted__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__VoiceSlider_K2Node_ComponentBoundEvent_14_ValueAdjusted__DelegateSignature final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_AudioSettings_C_BndEvt__VoiceSlider_K2Node_ComponentBoundEvent_14_ValueAdjusted__DelegateSignature;

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__FlagSlider_K2Node_ComponentBoundEvent_9_ValueAdjusted__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__FlagSlider_K2Node_ComponentBoundEvent_9_ValueAdjusted__DelegateSignature final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_AudioSettings_C_BndEvt__FlagSlider_K2Node_ComponentBoundEvent_9_ValueAdjusted__DelegateSignature;

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__MusicSlider_K2Node_ComponentBoundEvent_5_ValueAdjusted__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__MusicSlider_K2Node_ComponentBoundEvent_5_ValueAdjusted__DelegateSignature final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_AudioSettings_C_BndEvt__MusicSlider_K2Node_ComponentBoundEvent_5_ValueAdjusted__DelegateSignature;

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__EffectsSlider_K2Node_ComponentBoundEvent_2_ValueAdjusted__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__EffectsSlider_K2Node_ComponentBoundEvent_2_ValueAdjusted__DelegateSignature final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_AudioSettings_C_BndEvt__EffectsSlider_K2Node_ComponentBoundEvent_2_ValueAdjusted__DelegateSignature;

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__MasterSlider_K2Node_ComponentBoundEvent_0_ValueAdjusted__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__MasterSlider_K2Node_ComponentBoundEvent_0_ValueAdjusted__DelegateSignature final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_AudioSettings_C_BndEvt__MasterSlider_K2Node_ComponentBoundEvent_0_ValueAdjusted__DelegateSignature;

// Function WBP_AudioSettings.WBP_AudioSettings_C.Save
// 0x0008 (0x0008 - 0x0000)
struct WBP_AudioSettings_C_Save final
{
public:
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_AudioSettings_C_Save;

}

