#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_Menu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Midair2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_Menu.WBP_Settings_Menu_C
// 0x0030 (0x0470 - 0x0440)
class UWBP_Settings_Menu_C final : public UMASettingScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                HeaderBorder;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                MenuBorder;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              TabSZ;                                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BottomActionBar_C*                   W_BottomActionBar;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Settings_Menu(int32 EntryPoint);
	void BP_OnDeactivated();
	void CustomEvent_0(const TArray<class FName>& ConflictingBindNames, const struct FInputActionKeyMapping& Key);
	void BndEvt__WBP_Settings_Menu_TopSettingsTabList_K2Node_ComponentBoundEvent_0_OnTabSelected__DelegateSignature(class FName TabId);
	void Construct();
	void BeforePush_9F4202494F9631C2AC6E36ACD205C70A(class UCommonActivatableWidget* UserWidget);
	void AfterPush_9F4202494F9631C2AC6E36ACD205C70A(class UCommonActivatableWidget* UserWidget);
	void RegisterTopLevelTab(class FName VideoCollection);
	void NavigateFromIndex();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Settings_Menu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Settings_Menu_C")
	}
	static class UWBP_Settings_Menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_Menu_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Settings_Menu_C;

}

