#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabHomeRow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_TabHomeRow.WBP_TabHomeRow_C.ExecuteUbergraph_WBP_TabHomeRow
// 0x0078 (0x0078 - 0x0000)
struct WBP_TabHomeRow_C_ExecuteUbergraph_WBP_TabHomeRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0058)(HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabHomeRow_C_ExecuteUbergraph_WBP_TabHomeRow;

// Function WBP_TabHomeRow.WBP_TabHomeRow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabHomeRow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TabHomeRow_C_PreConstruct;

// Function WBP_TabHomeRow.WBP_TabHomeRow_C.Get_BTN_TXT_Text_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_TabHomeRow_C_Get_BTN_TXT_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_WBP_TabHomeRow_C_Get_BTN_TXT_Text_0;

// Function WBP_TabHomeRow.WBP_TabHomeRow_C.Get_BTN_TXT_ColorAndOpacity_0
// 0x0078 (0x0078 - 0x0000)
struct WBP_TabHomeRow_C_Get_BTN_TXT_ColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            EnabledColor;                                      // 0x0028(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            DisabledColor;                                     // 0x0050(0x0028)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_WBP_TabHomeRow_C_Get_BTN_TXT_ColorAndOpacity_0;

// Function WBP_TabHomeRow.WBP_TabHomeRow_C.SetButtonStatus
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabHomeRow_C_SetButtonStatus final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TabHomeRow_C_SetButtonStatus;

// Function WBP_TabHomeRow.WBP_TabHomeRow_C.GetBrush_0
// 0x01A0 (0x01A0 - 0x0000)
struct WBP_TabHomeRow_C_GetBrush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0088(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0110(0x0088)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TabHomeRow_C_GetBrush_0;

}

