#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerExpressions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Midair2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerExpressions.WBP_PlayerExpressions_C
// 0x0028 (0x0368 - 0x0340)
class UWBP_PlayerExpressions_C final : public UMAEscapableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        Switcher;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FirstKey;                                          // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Key_Press_Success;                                 // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Key_Press_Abort;                                   // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PlayerExpressions(int32 EntryPoint);
	void BP_OnDeactivated();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void Construct();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void Clear();
	void PopulateSelf();
	void FindOrCreateCategory(const class FText& Category, class UWBP_PlayerExpressionPanel_C** Return_Value);
	void FocusAndBegin();
	void EndKeyHandling();
	void SwitchToCategory(const class FText& Category);
	void FindCategory(const class FText& Category, class UWBP_PlayerExpressionPanel_C** Return_Value);
	void ProcessInput(const struct FKey& Key, bool IsAbortKey, bool* Handled);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_PlayerExpressions_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_PlayerExpressions_C")
	}
	static class UWBP_PlayerExpressions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerExpressions_C>();
	}
};
DUMPER7_ASSERTS_UWBP_PlayerExpressions_C;

}

