#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreboardSpectatorList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ScoreboardSpectatorList.WBP_ScoreboardSpectatorList_C
// 0x00E0 (0x0340 - 0x0260)
class UWBP_ScoreboardSpectatorList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_96;                                         // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderIcon;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PlayerList;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardSpecatorSlot1_C*         WBP_ScoreboardSpecatorSlot1;                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardSpecatorSlot1_C*         WBP_ScoreboardSpecatorSlot1_1;                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardSpecatorSlot1_C*         WBP_ScoreboardSpecatorSlot1_2;                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardSpecatorSlot1_C*         WBP_ScoreboardSpecatorSlot1_3;                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardSpecatorSlot1_C*         WBP_ScoreboardSpecatorSlot1_4;                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardSpecatorSlot1_C*         WBP_ScoreboardSpecatorSlot1_5;                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            Header_Icon;                                       // 0x02B0(0x0088)(Edit, BlueprintVisible)
	uint8                                         TeamId;                                            // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ScoreboardSpectatorList(int32 EntryPoint);
	void Construct();
	void Slow_Tick();
	void UpdateVBoxWithPlayers(TArray<class AMAPlayerState*>& players);
	class FText Get_Status_Text_0();
	class FText Get_Team_Score_0();
	struct FLinearColor Get_Team_Color();
	void Set_Team_Icon(int32 TeamId_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ScoreboardSpectatorList_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ScoreboardSpectatorList_C")
	}
	static class UWBP_ScoreboardSpectatorList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ScoreboardSpectatorList_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ScoreboardSpectatorList_C;

}

