#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BuySkinConfirmation

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "LootLockerSDK_structs.hpp"


namespace SDK::Params
{

// Function WBP_BuySkinConfirmation.WBP_BuySkinConfirmation_C.ExecuteUbergraph_WBP_BuySkinConfirmation
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_BuySkinConfirmation_C_ExecuteUbergraph_WBP_BuySkinConfirmation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FLootLockerResponse& Var)> K2Node_CreateDelegate_OutputDelegate;     // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetItemPriceFromClass_ReturnValue;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FLootLockerResponse& Var)> K2Node_CreateDelegate_OutputDelegate_1;   // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SelectableButton_C*                K2Node_ComponentBoundEvent_Clicked_Button_3;       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMAPlayerControllerBase*                K2Node_DynamicCast_AsMAPlayer_Controller_Base;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMALocalPlayer*                         CallFunc_GetMALocalPlayer_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLootLockerResponse                    K2Node_CustomEvent_Var_1;                          // 0x0068(0x0070)()
	class FString                                 CallFunc_GetLootLockerCatalogIdFromClass_ReturnValue; // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetLootLockerShardCatalogIdFromClass_ReturnValue; // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLootLockerResponse                    K2Node_CustomEvent_Var;                            // 0x0108(0x0070)()
	class UWBP_SelectableButton_C*                K2Node_ComponentBoundEvent_Clicked_Button_2;       // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_SelectableButton_C*                K2Node_ComponentBoundEvent_Clicked_Button_1;       // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_SelectableButton_C*                K2Node_ComponentBoundEvent_Clicked_Button;         // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_SelectableButton_C*                K2Node_ComponentBoundEvent_Selected_Button;        // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_2;           // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_3;           // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemShardPriceFromClass_ReturnValue;   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_BuySkinConfirmation_C_ExecuteUbergraph_WBP_BuySkinConfirmation;

// Function WBP_BuySkinConfirmation.WBP_BuySkinConfirmation_C.BndEvt__WBP_BuySkinConfirmation_ConfirmButton_5_K2Node_ComponentBoundEvent_5_ButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuySkinConfirmation_C_BndEvt__WBP_BuySkinConfirmation_ConfirmButton_5_K2Node_ComponentBoundEvent_5_ButtonSelected__DelegateSignature final
{
public:
	class UWBP_SelectableButton_C*                Selected_Button;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BuySkinConfirmation_C_BndEvt__WBP_BuySkinConfirmation_ConfirmButton_5_K2Node_ComponentBoundEvent_5_ButtonSelected__DelegateSignature;

// Function WBP_BuySkinConfirmation.WBP_BuySkinConfirmation_C.BndEvt__WBP_BuySkinConfirmation_WBP_SelectableButtonWithText_K2Node_ComponentBoundEvent_6_ButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuySkinConfirmation_C_BndEvt__WBP_BuySkinConfirmation_WBP_SelectableButtonWithText_K2Node_ComponentBoundEvent_6_ButtonClicked__DelegateSignature final
{
public:
	class UWBP_SelectableButton_C*                Clicked_Button;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BuySkinConfirmation_C_BndEvt__WBP_BuySkinConfirmation_WBP_SelectableButtonWithText_K2Node_ComponentBoundEvent_6_ButtonClicked__DelegateSignature;

// Function WBP_BuySkinConfirmation.WBP_BuySkinConfirmation_C.BndEvt__WBP_BuySkinConfirmation_ConfirmButton_5_K2Node_ComponentBoundEvent_7_ButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuySkinConfirmation_C_BndEvt__WBP_BuySkinConfirmation_ConfirmButton_5_K2Node_ComponentBoundEvent_7_ButtonClicked__DelegateSignature final
{
public:
	class UWBP_SelectableButton_C*                Clicked_Button;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BuySkinConfirmation_C_BndEvt__WBP_BuySkinConfirmation_ConfirmButton_5_K2Node_ComponentBoundEvent_7_ButtonClicked__DelegateSignature;

// Function WBP_BuySkinConfirmation.WBP_BuySkinConfirmation_C.BndEvt__WBP_BuySkinConfirmation_ConfirmButton_4_K2Node_ComponentBoundEvent_1_ButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuySkinConfirmation_C_BndEvt__WBP_BuySkinConfirmation_ConfirmButton_4_K2Node_ComponentBoundEvent_1_ButtonClicked__DelegateSignature final
{
public:
	class UWBP_SelectableButton_C*                Clicked_Button;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BuySkinConfirmation_C_BndEvt__WBP_BuySkinConfirmation_ConfirmButton_4_K2Node_ComponentBoundEvent_1_ButtonClicked__DelegateSignature;

// Function WBP_BuySkinConfirmation.WBP_BuySkinConfirmation_C.CustomEvent_0
// 0x0070 (0x0070 - 0x0000)
struct WBP_BuySkinConfirmation_C_CustomEvent_0 final
{
public:
	struct FLootLockerResponse                    Var;                                               // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_BuySkinConfirmation_C_CustomEvent_0;

// Function WBP_BuySkinConfirmation.WBP_BuySkinConfirmation_C.PurchaseRequestComplete
// 0x0070 (0x0070 - 0x0000)
struct WBP_BuySkinConfirmation_C_PurchaseRequestComplete final
{
public:
	struct FLootLockerResponse                    Var;                                               // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_BuySkinConfirmation_C_PurchaseRequestComplete;

// Function WBP_BuySkinConfirmation.WBP_BuySkinConfirmation_C.BndEvt__WBP_SelectableButtonWithText_1_K2Node_ComponentBoundEvent_3_ButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_BuySkinConfirmation_C_BndEvt__WBP_SelectableButtonWithText_1_K2Node_ComponentBoundEvent_3_ButtonClicked__DelegateSignature final
{
public:
	class UWBP_SelectableButton_C*                Clicked_Button;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_BuySkinConfirmation_C_BndEvt__WBP_SelectableButtonWithText_1_K2Node_ComponentBoundEvent_3_ButtonClicked__DelegateSignature;

// Function WBP_BuySkinConfirmation.WBP_BuySkinConfirmation_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_BuySkinConfirmation_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_BuySkinConfirmation_C_PreConstruct;

// Function WBP_BuySkinConfirmation.WBP_BuySkinConfirmation_C.GetText_1
// 0x0038 (0x0038 - 0x0000)
struct WBP_BuySkinConfirmation_C_GetText_1 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
};
DUMPER7_ASSERTS_WBP_BuySkinConfirmation_C_GetText_1;

// Function WBP_BuySkinConfirmation.WBP_BuySkinConfirmation_C.GetVisibility_0
// 0x0010 (0x0010 - 0x0000)
struct WBP_BuySkinConfirmation_C_GetVisibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_BuySkinConfirmation_C_GetVisibility_0;

// Function WBP_BuySkinConfirmation.WBP_BuySkinConfirmation_C.GetButtonText
// 0x0020 (0x0020 - 0x0000)
struct WBP_BuySkinConfirmation_C_GetButtonText final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_BuySkinConfirmation_C_GetButtonText;

// Function WBP_BuySkinConfirmation.WBP_BuySkinConfirmation_C.GetShardBalanceRemainingText
// 0x0038 (0x0038 - 0x0000)
struct WBP_BuySkinConfirmation_C_GetShardBalanceRemainingText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
};
DUMPER7_ASSERTS_WBP_BuySkinConfirmation_C_GetShardBalanceRemainingText;

}

