#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputDisplay

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Midair2_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InputDisplay.WBP_InputDisplay_C
// 0x0030 (0x0290 - 0x0260)
class UWBP_InputDisplay_C final : public UUserWidget
{
public:
	class UTextBlock*                             A_Text;                                            // 0x0260(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             D_Text;                                            // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Jet_Text;                                          // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             S_Text;                                            // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Skii_Text;                                         // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             W_Text;                                            // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void GetText_0();
	struct FSlateColor Get_Jet_Text_ColorAndOpacity_0();
	struct FSlateColor Get_W_Text_ColorAndOpacity_1();
	void GetMAPlayerController(class AMAPlayerController** AsMAPlayer_Controller);
	struct FSlateColor GetSlateColorForInputType(EPlayerRecordableInputTypes InputType);
	struct FSlateColor Get_A_Text_ColorAndOpacity_0();
	struct FSlateColor Get_S_Text_ColorAndOpacity_0();
	struct FSlateColor Get_D_Text_ColorAndOpacity_0();
	struct FSlateColor Get_Skii_Text_ColorAndOpacity_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_InputDisplay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_InputDisplay_C")
	}
	static class UWBP_InputDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InputDisplay_C>();
	}
};
DUMPER7_ASSERTS_UWBP_InputDisplay_C;

}

