#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WeaponStatusSlot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WeaponStatusSlot.WBP_WeaponStatusSlot_C
// 0x0030 (0x0290 - 0x0260)
class UWBP_WeaponStatusSlot_C final : public UUserWidget
{
public:
	class UProgressBar*                           ProgressBar_40;                                    // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1603;                                    // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1605;                                    // 0x0270(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 WeaponIconImage;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AMAWeapon*                              Weapon;                                            // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Selected;                                          // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void UpdateInfo(int32 PriorityNumber, class AMAWeapon* Weapon_0, bool Selected_0);
	class FText GetMaxAmmo();
	class FText GetCurrentAmmo();
	float GetPercent_0();
	struct FLinearColor GetBrushColor_0();
	struct FLinearColor GetBrushColor_1();
	struct FSlateColor GetForegroundColor_0();
	ESlateVisibility GetVisibility_0();
	struct FSlateColor GetForegroundColor_1();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_WeaponStatusSlot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_WeaponStatusSlot_C")
	}
	static class UWBP_WeaponStatusSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WeaponStatusSlot_C>();
	}
};
DUMPER7_ASSERTS_UWBP_WeaponStatusSlot_C;

}

