#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PersonalStat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PersonalStat.WBP_PersonalStat_C
// 0x00D0 (0x0330 - 0x0260)
class UWBP_PersonalStat_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         StatHeader;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StatIMG;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           stats;                                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StatTitleText;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HeaderTitle;                                       // 0x0288(0x0018)(Edit, BlueprintVisible)
	struct FSlateBrush                            HeaderImage;                                       // 0x02A0(0x0088)(Edit, BlueprintVisible)
	bool                                          ShowImage;                                         // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_PersonalStat(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void GenerateStats(const class FText& StatText, int32 FontSize, float StatValue);
	void SetImage();
	void RemoveAllStats();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_PersonalStat_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_PersonalStat_C")
	}
	static class UWBP_PersonalStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PersonalStat_C>();
	}
};
DUMPER7_ASSERTS_UWBP_PersonalStat_C;

}

