#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Dynamic_Crosshair_Settings

#include "Basic.hpp"

#include "Dynamic_Crosshair_Struct_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Midair2_structs.hpp"


namespace SDK::Params
{

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.ExecuteUbergraph_WBP_Dynamic_Crosshair_Settings
// 0x0490 (0x0490 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_ExecuteUbergraph_WBP_Dynamic_Crosshair_Settings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_11;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_2;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_3;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_4;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_5;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue_6;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_4;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_1;              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue_7;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_8;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_9;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_5;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChecked_ReturnValue_1;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChecked_ReturnValue_2;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsChecked_ReturnValue_3;                  // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_ComponentBoundEvent_InValue_10;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_10;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_9;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_8;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_7;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_6;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_5;         // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_5;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_InValue_5;              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_4;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_3;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_InValue_2;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_4;           // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_3;           // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_2;           // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x009F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_ComponentBoundEvent_InValue_1;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_4;         // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_4;        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_3;         // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_3;        // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Get_Crosshair_Color_ReturnValue;          // 0x00D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Get_Crosshair_Outline_Color_ReturnValue;  // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue_4;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue_11;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_InValue;                // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Get_Hitmarker_Color_ReturnValue;          // 0x0104(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Get_Hitmarker_Headshot_Color_ReturnValue; // 0x0114(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Get_Hitmarker_Kill_Color_ReturnValue;     // 0x0124(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_2;         // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_2;        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMADynamicCrosshair                    K2Node_MakeStruct_MADynamicCrosshair;              // 0x014C(0x008C)(NoDestructor)
	struct FDynamic_Crosshair_Struct              K2Node_MakeStruct_Dynamic_Crosshair_Struct;        // 0x01D8(0x008C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem_1;         // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType_1;        // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMAHUD*                                 K2Node_DynamicCast_AsMAHUD;                        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HUD2_C*                            K2Node_DynamicCast_AsWBP_HUD2;                     // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue;        // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAGameUserSettings*                    CallFunc_GetMAGameUserSettings_ReturnValue_1;      // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMADynamicCrosshair                    CallFunc_GetDynamicCrosshairSettings_ReturnValue;  // 0x02E0(0x008C)(NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDynamic_Crosshair_Struct              K2Node_MakeStruct_Dynamic_Crosshair_Struct_1;      // 0x0374(0x008C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue_2;              // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDynamic_Crosshair_Struct              K2Node_MakeStruct_Dynamic_Crosshair_Struct_2;      // 0x0404(0x008C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_ExecuteUbergraph_WBP_Dynamic_Crosshair_Settings;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Hitmarker_Kill_Color_K2Node_ComponentBoundEvent_23_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hitmarker_Kill_Color_K2Node_ComponentBoundEvent_23_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hitmarker_Kill_Color_K2Node_ComponentBoundEvent_23_OnSelectionChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Hitmarker_Headshot_Color_K2Node_ComponentBoundEvent_22_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hitmarker_Headshot_Color_K2Node_ComponentBoundEvent_22_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hitmarker_Headshot_Color_K2Node_ComponentBoundEvent_22_OnSelectionChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Hitmarker_Color_K2Node_ComponentBoundEvent_21_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hitmarker_Color_K2Node_ComponentBoundEvent_21_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hitmarker_Color_K2Node_ComponentBoundEvent_21_OnSelectionChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Hitmarker_Render_Scale_K2Node_ComponentBoundEvent_20_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hitmarker_Render_Scale_K2Node_ComponentBoundEvent_20_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hitmarker_Render_Scale_K2Node_ComponentBoundEvent_20_OnSpinBoxValueChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Enable_Hitmarker?_K2Node_ComponentBoundEvent_19_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Enable_Hitmarker__K2Node_ComponentBoundEvent_19_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Enable_Hitmarker__K2Node_ComponentBoundEvent_19_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Outline_Color_K2Node_ComponentBoundEvent_18_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Outline_Color_K2Node_ComponentBoundEvent_18_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Outline_Color_K2Node_ComponentBoundEvent_18_OnSelectionChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Color_K2Node_ComponentBoundEvent_17_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Color_K2Node_ComponentBoundEvent_17_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Color_K2Node_ComponentBoundEvent_17_OnSelectionChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Render_Scale_K2Node_ComponentBoundEvent_16_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Render_Scale_K2Node_ComponentBoundEvent_16_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Render_Scale_K2Node_ComponentBoundEvent_16_OnSpinBoxValueChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Hide_Bottom_Line?_K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hide_Bottom_Line__K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hide_Bottom_Line__K2Node_ComponentBoundEvent_15_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Hide_Top_Line?_K2Node_ComponentBoundEvent_14_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hide_Top_Line__K2Node_ComponentBoundEvent_14_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hide_Top_Line__K2Node_ComponentBoundEvent_14_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Hide_Left_Line?_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hide_Left_Line__K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hide_Left_Line__K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Hide_Right_Line?_K2Node_ComponentBoundEvent_12_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hide_Right_Line__K2Node_ComponentBoundEvent_12_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Hide_Right_Line__K2Node_ComponentBoundEvent_12_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Dot_Outline_Opacity_K2Node_ComponentBoundEvent_11_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Dot_Outline_Opacity_K2Node_ComponentBoundEvent_11_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Dot_Outline_Opacity_K2Node_ComponentBoundEvent_11_OnSpinBoxValueChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Dot_Outline_Thickness_K2Node_ComponentBoundEvent_10_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Dot_Outline_Thickness_K2Node_ComponentBoundEvent_10_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Dot_Outline_Thickness_K2Node_ComponentBoundEvent_10_OnSpinBoxValueChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Dot_Opacity_K2Node_ComponentBoundEvent_9_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Dot_Opacity_K2Node_ComponentBoundEvent_9_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Dot_Opacity_K2Node_ComponentBoundEvent_9_OnSpinBoxValueChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Dot_Size_K2Node_ComponentBoundEvent_8_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Dot_Size_K2Node_ComponentBoundEvent_8_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Dot_Size_K2Node_ComponentBoundEvent_8_OnSpinBoxValueChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Dot_Shape_K2Node_ComponentBoundEvent_7_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Dot_Shape_K2Node_ComponentBoundEvent_7_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Dot_Shape_K2Node_ComponentBoundEvent_7_OnSelectionChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Outline_Opacity_K2Node_ComponentBoundEvent_6_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Outline_Opacity_K2Node_ComponentBoundEvent_6_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Outline_Opacity_K2Node_ComponentBoundEvent_6_OnSpinBoxValueChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Opacity_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Opacity_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Opacity_K2Node_ComponentBoundEvent_5_OnSpinBoxValueChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Outline_Thickness_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Outline_Thickness_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Outline_Thickness_K2Node_ComponentBoundEvent_4_OnSpinBoxValueChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Thickness_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Thickness_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Thickness_K2Node_ComponentBoundEvent_3_OnSpinBoxValueChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Length_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Length_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Length_K2Node_ComponentBoundEvent_2_OnSpinBoxValueChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Gap_K2Node_ComponentBoundEvent_1_OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Gap_K2Node_ComponentBoundEvent_1_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_BndEvt__Dynamic_Crosshair_Example_W_Crosshair_Gap_K2Node_ComponentBoundEvent_1_OnSpinBoxValueChangedEvent__DelegateSignature;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.Get Crosshair Color
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_Get_Crosshair_Color final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FLinearColor>      LocalColorsMap;                                    // 0x0010(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FLinearColor>      K2Node_MakeVariable_MakeVariableOutput;            // 0x0060(0x0050)()
	class FString                                 CallFunc_GetSelectedOption_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_Get_Crosshair_Color;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.Get Crosshair Outline Color
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_Get_Crosshair_Outline_Color final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FLinearColor>      LocalColorsMap;                                    // 0x0010(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FLinearColor>      K2Node_MakeVariable_MakeVariableOutput;            // 0x0060(0x0050)()
	class FString                                 CallFunc_GetSelectedOption_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_Get_Crosshair_Outline_Color;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.Get Hitmarker Color
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_Get_Hitmarker_Color final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FLinearColor>      LocalColorsMap;                                    // 0x0010(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FLinearColor>      K2Node_MakeVariable_MakeVariableOutput;            // 0x0060(0x0050)()
	class FString                                 CallFunc_GetSelectedOption_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_Get_Hitmarker_Color;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.Get Hitmarker Headshot Color
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_Get_Hitmarker_Headshot_Color final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FLinearColor>      LocalColorsMap;                                    // 0x0010(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FLinearColor>      K2Node_MakeVariable_MakeVariableOutput;            // 0x0060(0x0050)()
	class FString                                 CallFunc_GetSelectedOption_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_Get_Hitmarker_Headshot_Color;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.Get Hitmarker Kill Color
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_Get_Hitmarker_Kill_Color final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FLinearColor>      LocalColorsMap;                                    // 0x0010(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FLinearColor>      K2Node_MakeVariable_MakeVariableOutput;            // 0x0060(0x0050)()
	class FString                                 CallFunc_GetSelectedOption_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_Get_Hitmarker_Kill_Color;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.Get Color Key
// 0x0110 (0x0110 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_Get_Color_Key final
{
public:
	struct FLinearColor                           InputColor;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 OutputKey;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, struct FLinearColor>      LocalColorsMap;                                    // 0x0020(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FLinearColor>      K2Node_MakeVariable_MakeVariableOutput;            // 0x0080(0x0050)()
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x00D0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_LinearColorLinearColor_ReturnValue; // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_Get_Color_Key;

// Function WBP_Dynamic_Crosshair_Settings.WBP_Dynamic_Crosshair_Settings_C.SetUIValues
// 0x0100 (0x0100 - 0x0000)
struct WBP_Dynamic_Crosshair_Settings_C_SetUIValues final
{
public:
	struct FDynamic_Crosshair_Struct              CrosshairSettings;                                 // 0x0000(0x008C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Get_Color_Key_OutputKey;                  // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_Color_Key_OutputKey_1;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_Color_Key_OutputKey_2;                // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_Color_Key_OutputKey_3;                // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Get_Color_Key_OutputKey_4;                // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_4;            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_5;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Dynamic_Crosshair_Settings_C_SetUIValues;

}

