#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Midair2_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TabSettings.WBP_TabSettings_C
// 0x00C8 (0x0328 - 0x0260)
class UWBP_TabSettings_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEditableTextBox*                       EditableTextBox_TargetPlayerCount;                 // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_189;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              PubStarterCheckbox;                                // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Details;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DifficultySelector_C*              WBP_DifficultySelector;                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PracticeModeButton_C*              WBP_PracticeModeButton_Load;                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PracticeModeButton_C*              WBP_PracticeModeButton_Load_Generic_PubStarter;    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PracticeModeButton_C*              WBP_PracticeModeButton_Load_PubStarter;            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PracticeModeButton_C*              WBP_PracticeModeButton_Save;                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PracticeModeButton_C*              WBP_PracticeModeButton_Save_PubStarter;            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_C*                           WBP_Title;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Load_Data_From_File;                               // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Save_Data_To_File;                                 // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Go_Back;                                           // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Save_PubStarter_Data_To_File;                      // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Load_PubStarter_Data_From_File;                    // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Load_PubStarter_Generic_Data;                      // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_TabSettings(int32 EntryPoint);
	void BndEvt__WBP_TabSettings_WBP_PracticeModeButton_Load_Generic_PubStarter_K2Node_ComponentBoundEvent_8_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabSettings_WBP_PracticeModeButton_Save_1_K2Node_ComponentBoundEvent_2_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabSettings_WBP_PracticeModeButton_Load_1_K2Node_ComponentBoundEvent_1_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabSettings_WBP_Title_K2Node_ComponentBoundEvent_7_Title_Clicked__DelegateSignature();
	void BndEvt__WBP_TabSettings_EditableTextBox_TargetPlayerCount_K2Node_ComponentBoundEvent_6_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void Construct();
	void BndEvt__WBP_TabSettings_ShootsCheckbox_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__WBP_TabSettings_WBP_PracticeModeButton_Save_K2Node_ComponentBoundEvent_5_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabSettings_WBP_PracticeModeButton_Load_K2Node_ComponentBoundEvent_4_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabSettings_WBP_DifficultySelector_K2Node_ComponentBoundEvent_3_DifficultySelected__DelegateSignature(ERouteTrailDifficulty Difficulty);
	void GetMAPracticeComponentForWidget(class UMAPracticeComponent** MAPracticeComponent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TabSettings_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TabSettings_C")
	}
	static class UWBP_TabSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TabSettings_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TabSettings_C;

}

