#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DropdownOptions

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DropdownOptions.WBP_DropdownOptions_C
// 0x00A0 (0x0300 - 0x0260)
class UWBP_DropdownOptions_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             OptionText;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   OptionTXT;                                         // 0x0270(0x0018)(Edit, BlueprintVisible)
	struct FSlateColor                            TextColor;                                         // 0x0288(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DefaultTextColor;                                  // 0x02B0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            SelectedTextColor;                                 // 0x02D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_DropdownOptions(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	struct FSlateColor Get_OptionText_ColorAndOpacity_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_DropdownOptions_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_DropdownOptions_C")
	}
	static class UWBP_DropdownOptions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DropdownOptions_C>();
	}
};
DUMPER7_ASSERTS_UWBP_DropdownOptions_C;

}

