#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StaticMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_ModalMenu_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StaticMessage.WBP_StaticMessage_C
// 0x0048 (0x02B0 - 0x0268)
class UWBP_StaticMessage_C final : public UWBP_ModalMenu_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             MainTextBlock;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PromptText;                                        // 0x0278(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              OnActionAccepted;                                  // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnRemoved;                                         // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_StaticMessage(int32 EntryPoint);
	void Remove();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_StaticMessage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_StaticMessage_C")
	}
	static class UWBP_StaticMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StaticMessage_C>();
	}
};
DUMPER7_ASSERTS_UWBP_StaticMessage_C;

}

