#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Button_Action

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Button_Action.WBP_Button_Action_C.ExecuteUbergraph_WBP_Button_Action
// 0x0018 (0x0018 - 0x0000)
struct WBP_Button_Action_C_ExecuteUbergraph_WBP_Button_Action final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Button_Action_C_ExecuteUbergraph_WBP_Button_Action;

// Function WBP_Button_Action.WBP_Button_Action_C.Get_Image_Bg_Brush_0
// 0x0110 (0x0110 - 0x0000)
struct WBP_Button_Action_C_Get_Image_Bg_Brush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0088(0x0088)()
};
DUMPER7_ASSERTS_WBP_Button_Action_C_Get_Image_Bg_Brush_0;

// Function WBP_Button_Action.WBP_Button_Action_C.Get_Image_BgHover_Brush_0
// 0x0110 (0x0110 - 0x0000)
struct WBP_Button_Action_C_Get_Image_BgHover_Brush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0088(0x0088)()
};
DUMPER7_ASSERTS_WBP_Button_Action_C_Get_Image_BgHover_Brush_0;

// Function WBP_Button_Action.WBP_Button_Action_C.Get_Image_BgActive_Brush_0
// 0x0110 (0x0110 - 0x0000)
struct WBP_Button_Action_C_Get_Image_BgActive_Brush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0088(0x0088)()
};
DUMPER7_ASSERTS_WBP_Button_Action_C_Get_Image_BgActive_Brush_0;

// Function WBP_Button_Action.WBP_Button_Action_C.Active_Button
// 0x0008 (0x0008 - 0x0000)
struct WBP_Button_Action_C_Active_Button final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Button_Action_C_Active_Button;

// Function WBP_Button_Action.WBP_Button_Action_C.Inactive_Button
// 0x0008 (0x0008 - 0x0000)
struct WBP_Button_Action_C_Inactive_Button final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_Button_Action_C_Inactive_Button;

}

