#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DifficultySelector

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Midair2_structs.hpp"


namespace SDK::Params
{

// Function WBP_DifficultySelector.WBP_DifficultySelector_C.ExecuteUbergraph_WBP_DifficultySelector
// 0x0008 (0x0008 - 0x0000)
struct WBP_DifficultySelector_C_ExecuteUbergraph_WBP_DifficultySelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_3;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_2;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_DifficultySelector_C_ExecuteUbergraph_WBP_DifficultySelector;

// Function WBP_DifficultySelector.WBP_DifficultySelector_C.BndEvt__WBP_DifficultySelector_CheckBox_Hard_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DifficultySelector_C_BndEvt__WBP_DifficultySelector_CheckBox_Hard_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_DifficultySelector_C_BndEvt__WBP_DifficultySelector_CheckBox_Hard_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_DifficultySelector.WBP_DifficultySelector_C.BndEvt__WBP_DifficultySelector_CheckBox_Med_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DifficultySelector_C_BndEvt__WBP_DifficultySelector_CheckBox_Med_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_DifficultySelector_C_BndEvt__WBP_DifficultySelector_CheckBox_Med_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_DifficultySelector.WBP_DifficultySelector_C.BndEvt__WBP_DifficultySelector_CheckBox_Easy_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DifficultySelector_C_BndEvt__WBP_DifficultySelector_CheckBox_Easy_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_DifficultySelector_C_BndEvt__WBP_DifficultySelector_CheckBox_Easy_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_DifficultySelector.WBP_DifficultySelector_C.BndEvt__WBP_DifficultySelector_CheckBox_All_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_DifficultySelector_C_BndEvt__WBP_DifficultySelector_CheckBox_All_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_DifficultySelector_C_BndEvt__WBP_DifficultySelector_CheckBox_All_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_DifficultySelector.WBP_DifficultySelector_C.Get_CheckBox_All_CheckedState_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_DifficultySelector_C_Get_CheckBox_All_CheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_DifficultySelector_C_Get_CheckBox_All_CheckedState_0;

// Function WBP_DifficultySelector.WBP_DifficultySelector_C.Get_CheckBox_Easy_CheckedState_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_DifficultySelector_C_Get_CheckBox_Easy_CheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_DifficultySelector_C_Get_CheckBox_Easy_CheckedState_0;

// Function WBP_DifficultySelector.WBP_DifficultySelector_C.Get_CheckBox_Med_CheckedState_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_DifficultySelector_C_Get_CheckBox_Med_CheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_DifficultySelector_C_Get_CheckBox_Med_CheckedState_0;

// Function WBP_DifficultySelector.WBP_DifficultySelector_C.Get_CheckBox_Hard_CheckedState_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_DifficultySelector_C_Get_CheckBox_Hard_CheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_DifficultySelector_C_Get_CheckBox_Hard_CheckedState_0;

}

