#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RouteTypeSelector

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.ExecuteUbergraph_WBP_RouteTypeSelector
// 0x0010 (0x0010 - 0x0000)
struct WBP_RouteTypeSelector_C_ExecuteUbergraph_WBP_RouteTypeSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_8;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_7;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_6;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_5;           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_4;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_3;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_2;           // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_ExecuteUbergraph_WBP_RouteTypeSelector;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.BndEvt__WBP_RouteTypeSelector_CheckBox_BL_F_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_RouteTypeSelector_C_BndEvt__WBP_RouteTypeSelector_CheckBox_BL_F_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_BndEvt__WBP_RouteTypeSelector_CheckBox_BL_F_K2Node_ComponentBoundEvent_8_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.BndEvt__WBP_RouteTypeSelector_CheckBox_BL_FR_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_RouteTypeSelector_C_BndEvt__WBP_RouteTypeSelector_CheckBox_BL_FR_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_BndEvt__WBP_RouteTypeSelector_CheckBox_BL_FR_K2Node_ComponentBoundEvent_7_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.BndEvt__WBP_RouteTypeSelector_CheckBox_R_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_RouteTypeSelector_C_BndEvt__WBP_RouteTypeSelector_CheckBox_R_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_BndEvt__WBP_RouteTypeSelector_CheckBox_R_K2Node_ComponentBoundEvent_6_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.BndEvt__WBP_RouteTypeSelector_CheckBox_BR_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_RouteTypeSelector_C_BndEvt__WBP_RouteTypeSelector_CheckBox_BR_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_BndEvt__WBP_RouteTypeSelector_CheckBox_BR_K2Node_ComponentBoundEvent_5_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.BndEvt__WBP_RouteTypeSelector_CheckBox_B_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_RouteTypeSelector_C_BndEvt__WBP_RouteTypeSelector_CheckBox_B_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_BndEvt__WBP_RouteTypeSelector_CheckBox_B_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.BndEvt__WBP_DifficultySelector_CheckBox_Hard_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_RouteTypeSelector_C_BndEvt__WBP_DifficultySelector_CheckBox_Hard_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_BndEvt__WBP_DifficultySelector_CheckBox_Hard_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.BndEvt__WBP_DifficultySelector_CheckBox_Med_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_RouteTypeSelector_C_BndEvt__WBP_DifficultySelector_CheckBox_Med_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_BndEvt__WBP_DifficultySelector_CheckBox_Med_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.BndEvt__WBP_DifficultySelector_CheckBox_Easy_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_RouteTypeSelector_C_BndEvt__WBP_DifficultySelector_CheckBox_Easy_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_BndEvt__WBP_DifficultySelector_CheckBox_Easy_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.BndEvt__WBP_DifficultySelector_CheckBox_All_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_RouteTypeSelector_C_BndEvt__WBP_DifficultySelector_CheckBox_All_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_BndEvt__WBP_DifficultySelector_CheckBox_All_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.Get_CheckBox_All_CheckedState_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_RouteTypeSelector_C_Get_CheckBox_All_CheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_Get_CheckBox_All_CheckedState_0;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.Get_CheckBox_FL_CheckedState_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_RouteTypeSelector_C_Get_CheckBox_FL_CheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_Get_CheckBox_FL_CheckedState_0;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.Get_CheckBox_L_CheckedState_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_RouteTypeSelector_C_Get_CheckBox_L_CheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_Get_CheckBox_L_CheckedState_0;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.Get_CheckBox_BL_CheckedState_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_RouteTypeSelector_C_Get_CheckBox_BL_CheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_Get_CheckBox_BL_CheckedState_0;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.Get_CheckBox_B_CheckedState_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_RouteTypeSelector_C_Get_CheckBox_B_CheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_Get_CheckBox_B_CheckedState_0;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.Get_CheckBox_BR_CheckedState_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_RouteTypeSelector_C_Get_CheckBox_BR_CheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_Get_CheckBox_BR_CheckedState_0;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.Get_CheckBox_R_CheckedState_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_RouteTypeSelector_C_Get_CheckBox_R_CheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_Get_CheckBox_R_CheckedState_0;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.Get_CheckBox_BL_FR_CheckedState_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_RouteTypeSelector_C_Get_CheckBox_BL_FR_CheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_Get_CheckBox_BL_FR_CheckedState_0;

// Function WBP_RouteTypeSelector.WBP_RouteTypeSelector_C.Get_CheckBox_BL_F_CheckedState_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_RouteTypeSelector_C_Get_CheckBox_BL_F_CheckedState_0 final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RouteTypeSelector_C_Get_CheckBox_BL_F_CheckedState_0;

}

