#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NewsIcon

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_NewsIcon.WBP_NewsIcon_C.Setup
// 0x0030 (0x0030 - 0x0000)
struct WBP_NewsIcon_C_Setup final
{
public:
	int32                                         NewCount_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_NewsIcon_C_Setup;

// Function WBP_NewsIcon.WBP_NewsIcon_C.ExecuteUbergraph_WBP_NewsIcon
// 0x0004 (0x0004 - 0x0000)
struct WBP_NewsIcon_C_ExecuteUbergraph_WBP_NewsIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_NewsIcon_C_ExecuteUbergraph_WBP_NewsIcon;

}

