#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabRoute

#include "Basic.hpp"

#include "Midair2_structs.hpp"


namespace SDK::Params
{

// Function WBP_TabRoute.WBP_TabRoute_C.ExecuteUbergraph_WBP_TabRoute
// 0x0020 (0x0020 - 0x0000)
struct WBP_TabRoute_C_ExecuteUbergraph_WBP_TabRoute final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_RouteType;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ERouteTrailDifficulty                         K2Node_ComponentBoundEvent_Difficulty;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_C_ExecuteUbergraph_WBP_TabRoute;

// Function WBP_TabRoute.WBP_TabRoute_C.BndEvt__WBP_TabRoute_WBP_DifficultySelector_K2Node_ComponentBoundEvent_3_DifficultySelected__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabRoute_C_BndEvt__WBP_TabRoute_WBP_DifficultySelector_K2Node_ComponentBoundEvent_3_DifficultySelected__DelegateSignature final
{
public:
	ERouteTrailDifficulty                         Difficulty;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_C_BndEvt__WBP_TabRoute_WBP_DifficultySelector_K2Node_ComponentBoundEvent_3_DifficultySelected__DelegateSignature;

// Function WBP_TabRoute.WBP_TabRoute_C.BndEvt__WBP_TabRoute_WBP_RouteTypeSelector_K2Node_ComponentBoundEvent_2_RouteTypeSelected__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_TabRoute_C_BndEvt__WBP_TabRoute_WBP_RouteTypeSelector_K2Node_ComponentBoundEvent_2_RouteTypeSelected__DelegateSignature final
{
public:
	class FString                                 RouteType;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_C_BndEvt__WBP_TabRoute_WBP_RouteTypeSelector_K2Node_ComponentBoundEvent_2_RouteTypeSelected__DelegateSignature;

// Function WBP_TabRoute.WBP_TabRoute_C.Update Route List
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_TabRoute_C_Update_Route_List final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FMARouteTrail& Route)> K2Node_CreateDelegate_OutputDelegate;         // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerControllerID_ReturnValue;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMARouteTrail>                  CallFunc_GetLoadedRouteTrails_ReturnValue;         // 0x0038(0x0010)(ReferenceParm)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMARouteTrail                          CallFunc_Array_Get_Item;                           // 0x0050(0x0100)()
	class AMAPlayerController*                    K2Node_DynamicCast_AsMAPlayer_Controller;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TabRoute_Row_C*                    CallFunc_Create_ReturnValue;                       // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x016E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x016F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FMARouteTrail& Route)> K2Node_CreateDelegate_OutputDelegate_1;       // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FMARouteTrail& Route)> K2Node_CreateDelegate_OutputDelegate_2;       // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FMARouteTrail& Route)> K2Node_CreateDelegate_OutputDelegate_3;       // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_C_Update_Route_List;

// Function WBP_TabRoute.WBP_TabRoute_C.GetMAPracticeComponentForWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_TabRoute_C_GetMAPracticeComponentForWidget final
{
public:
	class UMAPracticeComponent*                   MAPracticeComponent;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerControllerID_ReturnValue;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMAPlayerController*                    K2Node_DynamicCast_AsMAPlayer_Controller;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TabRoute_C_GetMAPracticeComponentForWidget;

// Function WBP_TabRoute.WBP_TabRoute_C.EditRouteTrail
// 0x0100 (0x0100 - 0x0000)
struct WBP_TabRoute_C_EditRouteTrail final
{
public:
	struct FMARouteTrail                          Route;                                             // 0x0000(0x0100)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_TabRoute_C_EditRouteTrail;

// Function WBP_TabRoute.WBP_TabRoute_C.DeleteRouteTrail
// 0x0108 (0x0108 - 0x0000)
struct WBP_TabRoute_C_DeleteRouteTrail final
{
public:
	struct FMARouteTrail                          Route;                                             // 0x0000(0x0100)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_C_DeleteRouteTrail;

// Function WBP_TabRoute.WBP_TabRoute_C.LoadRouteTrail
// 0x0108 (0x0108 - 0x0000)
struct WBP_TabRoute_C_LoadRouteTrail final
{
public:
	struct FMARouteTrail                          Route;                                             // 0x0000(0x0100)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_C_LoadRouteTrail;

// Function WBP_TabRoute.WBP_TabRoute_C.SpawnBotOnRoute
// 0x0108 (0x0108 - 0x0000)
struct WBP_TabRoute_C_SpawnBotOnRoute final
{
public:
	struct FMARouteTrail                          Route;                                             // 0x0000(0x0100)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_C_SpawnBotOnRoute;

}

