#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PracticeRouteFileSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PracticeRouteFileSelector.WBP_PracticeRouteFileSelector_C
// 0x0040 (0x02A0 - 0x0260)
class UWBP_PracticeRouteFileSelector_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             FileScroller;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_132;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMAPracticeComponent*                   PracticeComponent;                                 // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const class FString& RouteFileName)> FileSelected;                 // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FString>                         CachedFileNames;                                   // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_PracticeRouteFileSelector(int32 EntryPoint);
	void CustomEvent_0(int32 Ident);
	void SelectedFileEvent(int32 Ident);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_PracticeRouteFileSelector_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_PracticeRouteFileSelector_C")
	}
	static class UWBP_PracticeRouteFileSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PracticeRouteFileSelector_C>();
	}
};
DUMPER7_ASSERTS_UWBP_PracticeRouteFileSelector_C;

}

