#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ESC_Loadout_BTN

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Midair2_structs.hpp"


namespace SDK::Params
{

// Function WBP_ESC_Loadout_BTN.WBP_ESC_Loadout_BTN_C.ExecuteUbergraph_WBP_ESC_Loadout_BTN
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_ESC_Loadout_BTN_C_ExecuteUbergraph_WBP_ESC_Loadout_BTN final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ESC_Loadout_BTN_C*                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerLoadoutsSave*                    CallFunc_GetGlobalLoadoutsSave_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMALoadout                             CallFunc_GetLastSelectedLoadout_outLoadout;        // 0x0030(0x00C0)()
	struct FMALoadout                             K2Node_SetFieldsInStruct_StructOut;                // 0x00F0(0x00C0)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMAPlayerController*                    K2Node_DynamicCast_AsMAPlayer_Controller;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_ESC_Loadout_BTN_C_ExecuteUbergraph_WBP_ESC_Loadout_BTN;

// Function WBP_ESC_Loadout_BTN.WBP_ESC_Loadout_BTN_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ESC_Loadout_BTN_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_ESC_Loadout_BTN_C_PreConstruct;

// Function WBP_ESC_Loadout_BTN.WBP_ESC_Loadout_BTN_C.Get_BTN_TXT_Text_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_ESC_Loadout_BTN_C_Get_BTN_TXT_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_WBP_ESC_Loadout_BTN_C_Get_BTN_TXT_Text_0;

// Function WBP_ESC_Loadout_BTN.WBP_ESC_Loadout_BTN_C.Get_BTN_TXT_ColorAndOpacity_0
// 0x0078 (0x0078 - 0x0000)
struct WBP_ESC_Loadout_BTN_C_Get_BTN_TXT_ColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            EnabledColor;                                      // 0x0028(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            DisabledColor;                                     // 0x0050(0x0028)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_WBP_ESC_Loadout_BTN_C_Get_BTN_TXT_ColorAndOpacity_0;

// Function WBP_ESC_Loadout_BTN.WBP_ESC_Loadout_BTN_C.SetButtonStatus
// 0x0001 (0x0001 - 0x0000)
struct WBP_ESC_Loadout_BTN_C_SetButtonStatus final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_ESC_Loadout_BTN_C_SetButtonStatus;

// Function WBP_ESC_Loadout_BTN.WBP_ESC_Loadout_BTN_C.SetDefaults
// 0x0060 (0x0060 - 0x0000)
struct WBP_ESC_Loadout_BTN_C_SetDefaults final
{
public:
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0000(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_ESC_Loadout_BTN_C_SetDefaults;

// Function WBP_ESC_Loadout_BTN.WBP_ESC_Loadout_BTN_C.SetLoadoutText
// 0x0018 (0x0018 - 0x0000)
struct WBP_ESC_Loadout_BTN_C_SetLoadoutText final
{
public:
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0000(0x0018)()
};
DUMPER7_ASSERTS_WBP_ESC_Loadout_BTN_C_SetLoadoutText;

// Function WBP_ESC_Loadout_BTN.WBP_ESC_Loadout_BTN_C.SetNewLoadout
// 0x0008 (0x0008 - 0x0000)
struct WBP_ESC_Loadout_BTN_C_SetNewLoadout final
{
public:
	class UPlayerLoadoutsSave*                    CallFunc_GetGlobalLoadoutsSave_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ESC_Loadout_BTN_C_SetNewLoadout;

// Function WBP_ESC_Loadout_BTN.WBP_ESC_Loadout_BTN_C.RefreshSelectedLoadout
// 0x0010 (0x0010 - 0x0000)
struct WBP_ESC_Loadout_BTN_C_RefreshSelectedLoadout final
{
public:
	class UPlayerLoadoutsSave*                    CallFunc_GetGlobalLoadoutsSave_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLastSelectedIndex_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_ESC_Loadout_BTN_C_RefreshSelectedLoadout;

}

