#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameStatus_MatchDuel

#include "Basic.hpp"

#include "WBP_GameStatusBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameStatus_MatchDuel.WBP_GameStatus_MatchDuel_C
// 0x0038 (0x02A8 - 0x0270)
class UWBP_GameStatus_MatchDuel_C final : public UWBP_GameStatusBase_C
{
public:
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ATeamScoreText;                                    // 0x0278(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BTeamScoreText_1;                                  // 0x0280(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_46;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TimeLeftText;                                      // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TimeLeftText_2;                                    // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	class FText Get_ATeamScoreText_Text_0();
	class FText Get_BTeamScoreText_Text_0();
	class FText Get_TimeLeftText_Text_0();
	float Get_ATeamScoreBar_Percent_0();
	float Get_BTeamScoreBar_Percent_0();
	void Get_Team_Status_Text(uint8 TeamId_0, class FText* Text);
	ESlateVisibility Get_PlayerIsTeamA_Visibility_0();
	ESlateVisibility Get_PlayerIsTeamB_Visibility_0();
	ESlateVisibility Get_TeamAStatus_Visibility_0();
	ESlateVisibility Get_TeamBStatus_Visibility_0();
	class FText Get_TimeLeftText_2_Text_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_GameStatus_MatchDuel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_GameStatus_MatchDuel_C")
	}
	static class UWBP_GameStatus_MatchDuel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameStatus_MatchDuel_C>();
	}
};
DUMPER7_ASSERTS_UWBP_GameStatus_MatchDuel_C;

}

