#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CurrencyItem

#include "Basic.hpp"

#include "LootLockerSDK_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CurrencyItem.WBP_CurrencyItem_C.SetupFromCurrency
// 0x0068 (0x0068 - 0x0000)
struct WBP_CurrencyItem_C_SetupFromCurrency final
{
public:
	struct FLootLockerCurrencyDetails             NewCurrencyDetails;                                // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0018)()
};
DUMPER7_ASSERTS_WBP_CurrencyItem_C_SetupFromCurrency;

// Function WBP_CurrencyItem.WBP_CurrencyItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CurrencyItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_CurrencyItem_C_PreConstruct;

// Function WBP_CurrencyItem.WBP_CurrencyItem_C.ExecuteUbergraph_WBP_CurrencyItem
// 0x0140 (0x0140 - 0x0000)
struct WBP_CurrencyItem_C_ExecuteUbergraph_WBP_CurrencyItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0020(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x00A8(0x0088)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CurrencyItem_C_ExecuteUbergraph_WBP_CurrencyItem;

}

