#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ReplayControl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ReplayControl.WBP_ReplayControl_C
// 0x0038 (0x0298 - 0x0260)
class UWBP_ReplayControl_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_222;                                        // 0x0268(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                ReplayPositionSlider;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                ReplaySpeedSlider;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_27;                                      // 0x0290(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ReplayControl(int32 EntryPoint);
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_155_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Slider_1_K2Node_ComponentBoundEvent_123_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__Slider_0_K2Node_ComponentBoundEvent_194_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void Construct();
	float Get_ReplayPositionSlider_Value_0();
	float Get_ReplaySpeedSlider_Value_0();
	class FText GetText_0();
	class FText GetText_1();
	struct FEventReply OnMouseButtonDown_0(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ReplayControl_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ReplayControl_C")
	}
	static class UWBP_ReplayControl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ReplayControl_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ReplayControl_C;

}

