#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ValidationPopup

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ValidationPopup.WBP_ValidationPopup_C.ExecuteUbergraph_WBP_ValidationPopup
// 0x0030 (0x0030 - 0x0000)
struct WBP_ValidationPopup_C_ExecuteUbergraph_WBP_ValidationPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ValidationPopup_C_ExecuteUbergraph_WBP_ValidationPopup;

// Function WBP_ValidationPopup.WBP_ValidationPopup_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ValidationPopup_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_ValidationPopup_C_PreConstruct;

// Function WBP_ValidationPopup.WBP_ValidationPopup_C.Get_ValidationText_Text_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_ValidationPopup_C_Get_ValidationText_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_WBP_ValidationPopup_C_Get_ValidationText_Text_0;

// Function WBP_ValidationPopup.WBP_ValidationPopup_C.Get_OptionOneTXT_Text_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_ValidationPopup_C_Get_OptionOneTXT_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_WBP_ValidationPopup_C_Get_OptionOneTXT_Text_0;

// Function WBP_ValidationPopup.WBP_ValidationPopup_C.Get_OptionTwoText_Text_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_ValidationPopup_C_Get_OptionTwoText_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_WBP_ValidationPopup_C_Get_OptionTwoText_Text_0;

// Function WBP_ValidationPopup.WBP_ValidationPopup_C.GetBackground_0
// 0x0088 (0x0088 - 0x0000)
struct WBP_ValidationPopup_C_GetBackground_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_WBP_ValidationPopup_C_GetBackground_0;

}

