#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Currency

#include "Basic.hpp"

#include "Midair2_classes.hpp"
#include "Engine_structs.hpp"
#include "LootLockerSDK_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Currency.WBP_Currency_C
// 0x0140 (0x0468 - 0x0328)
class UWBP_Currency_C final : public UMAActivatableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScalarAnimation;                                   // 0x0338(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_Frame;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_1;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_128;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_0;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      CurrencyGridPanel;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             FinalCreditAmount;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_159;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                TryAgainBtn;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Coin_C*                            WBP_Coin_58;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrencyItem_C*                    WBP_CurrencyItem;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrencyItem_C*                    WBP_CurrencyItem_1;                                // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrencyItem_C*                    WBP_CurrencyItem_2;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CurrencyItem_C*                    WBP_CurrencyItem_239;                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 EntitlementId;                                     // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          ShouldQueryPurchase;                               // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              CheckPurchase;                                     // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABP_CoinPreview_C*                      CoinPreview;                                       // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMALocalPlayer*                         LocalPlayer;                                       // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Error_Message;                                     // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          InProgress;                                        // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALootCrate_GoldRT_C*                    LootCrate;                                         // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           MainCamera;                                        // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLootLockerCurrencyDetails             CurrentPurchaseDetails;                            // 0x0418(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnGetCurrencies(TArray<struct FLootLockerCurrencyDetails>& Response);
	void CoinSplurgeFinished();
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void On_Finalize_Purchase(const struct FLootLockerResponse& Var);
	void FinalizePurchase();
	void OnQueryPurchaseResponse(const struct FLootLockerQuerySteamPurchaseRedemptionStatusResponse& Response);
	void QueryPurchase();
	void OnBeginSteamPurchase(const struct FLootLockerBeginSteamPurchaseRedemptionResponse& Response);
	void MakePurchase(const struct FLootLockerCurrencyDetails& CurrencyDetails);
	void Construct();
	void CheckSteamPurchase();
	void BndEvt__WBP_Currency_Button_128_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_Currency_WBP_CurrencyItem_K2Node_ComponentBoundEvent_2_ButtonSelected__DelegateSignature(const struct FLootLockerCurrencyDetails& CurrencyDetails);
	void BndEvt__WBP_Currency_WBP_CurrencyItem_1_K2Node_ComponentBoundEvent_3_ButtonSelected__DelegateSignature(const struct FLootLockerCurrencyDetails& CurrencyDetails);
	void BndEvt__WBP_Currency_WBP_CurrencyItem_2_K2Node_ComponentBoundEvent_0_ButtonSelected__DelegateSignature(const struct FLootLockerCurrencyDetails& CurrencyDetails);
	void BndEvt__WBP_Currency_WBP_CurrencyItem_239_K2Node_ComponentBoundEvent_3_ButtonSelected__DelegateSignature(const struct FLootLockerCurrencyDetails& CurrencyDetails);
	void BndEvt__WBP_Currency_WBP_CurrencyItem_K2Node_ComponentBoundEvent_5_ButtonHovered__DelegateSignature();
	void BndEvt__WBP_Currency_WBP_CurrencyItem_K2Node_ComponentBoundEvent_6_ButtonUnhovered__DelegateSignature();
	void BndEvt__WBP_Currency_WBP_Coin_58_K2Node_ComponentBoundEvent_7_CoinHovered__DelegateSignature();
	void BndEvt__WBP_Currency_WBP_Coin_58_K2Node_ComponentBoundEvent_8_CoinUnhovered__DelegateSignature();
	void BndEvt__WBP_Currency_WBP_CurrencyItem_1_K2Node_ComponentBoundEvent_9_ButtonHovered__DelegateSignature();
	void BndEvt__WBP_Currency_WBP_CurrencyItem_1_K2Node_ComponentBoundEvent_10_ButtonUnhovered__DelegateSignature();
	void BndEvt__WBP_Currency_WBP_CurrencyItem_2_K2Node_ComponentBoundEvent_11_ButtonHovered__DelegateSignature();
	void BndEvt__WBP_Currency_WBP_CurrencyItem_2_K2Node_ComponentBoundEvent_12_ButtonUnhovered__DelegateSignature();
	void BndEvt__WBP_Currency_WBP_CurrencyItem_239_K2Node_ComponentBoundEvent_13_ButtonHovered__DelegateSignature();
	void BndEvt__WBP_Currency_WBP_CurrencyItem_239_K2Node_ComponentBoundEvent_14_ButtonUnhovered__DelegateSignature();
	void BndEvt__WBP_Currency_TryAgainBtn_K2Node_ComponentBoundEvent_16_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Currency_Button_1_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Currency_Button_128_K2Node_ComponentBoundEvent_17_OnButtonClickedEvent__DelegateSignature();
	void BP_OnActivated();
	void BP_OnDeactivated();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WBP_Currency(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Currency_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Currency_C")
	}
	static class UWBP_Currency_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Currency_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Currency_C;

}

