#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MidairCombobox_Item

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MidairCombobox_Item.WBP_MidairCombobox_Item_C.ExecuteUbergraph_WBP_MidairCombobox_Item
// 0x0028 (0x0028 - 0x0000)
struct WBP_MidairCombobox_Item_C_ExecuteUbergraph_WBP_MidairCombobox_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0018)()
	int32                                         K2Node_ComponentBoundEvent_Ident;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MidairCombobox_Item_C_ExecuteUbergraph_WBP_MidairCombobox_Item;

// Function WBP_MidairCombobox_Item.WBP_MidairCombobox_Item_C.BndEvt__WBP_StyledButton_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_MidairCombobox_Item_C_BndEvt__WBP_StyledButton_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature final
{
public:
	int32                                         Ident_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_MidairCombobox_Item_C_BndEvt__WBP_StyledButton_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature;

}

