#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MatchHighlight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MatchHighlight.WBP_MatchHighlight_C
// 0x0080 (0x02E0 - 0x0260)
class UWBP_MatchHighlight_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Background;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HighlightTitleText;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerNameText;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StatValueText;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundColor;                                   // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   HighlightTitle;                                    // 0x0298(0x0018)(Edit, BlueprintVisible)
	class FText                                   PlayerName;                                        // 0x02B0(0x0018)(Edit, BlueprintVisible)
	class FText                                   StatValue;                                         // 0x02C8(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WBP_MatchHighlight(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	class FText Get_PlayerNameText_Text_0();
	void Update();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_MatchHighlight_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_MatchHighlight_C")
	}
	static class UWBP_MatchHighlight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MatchHighlight_C>();
	}
};
DUMPER7_ASSERTS_UWBP_MatchHighlight_C;

}

