#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatDisplay_Scoreboard

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_StatDisplay_Scoreboard.WBP_StatDisplay_Scoreboard_C.ExecuteUbergraph_WBP_StatDisplay_Scoreboard
// 0x0008 (0x0008 - 0x0000)
struct WBP_StatDisplay_Scoreboard_C_ExecuteUbergraph_WBP_StatDisplay_Scoreboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_StatDisplay_Scoreboard_C_ExecuteUbergraph_WBP_StatDisplay_Scoreboard;

// Function WBP_StatDisplay_Scoreboard.WBP_StatDisplay_Scoreboard_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_StatDisplay_Scoreboard_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_StatDisplay_Scoreboard_C_PreConstruct;

// Function WBP_StatDisplay_Scoreboard.WBP_StatDisplay_Scoreboard_C.Get_ScoreDisplay_Text_0
// 0x0040 (0x0040 - 0x0000)
struct WBP_StatDisplay_Scoreboard_C_Get_ScoreDisplay_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0028(0x0018)()
};
DUMPER7_ASSERTS_WBP_StatDisplay_Scoreboard_C_Get_ScoreDisplay_Text_0;

}

