#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PracticeMenuComboBox_Row

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_PracticeMenuComboBox_Row.WBP_PracticeMenuComboBox_Row_C.ExecuteUbergraph_WBP_PracticeMenuComboBox_Row
// 0x0130 (0x0130 - 0x0000)
struct WBP_PracticeMenuComboBox_Row_C_ExecuteUbergraph_WBP_PracticeMenuComboBox_Row final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0050(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C0(0x0070)(ConstParm)
};
DUMPER7_ASSERTS_WBP_PracticeMenuComboBox_Row_C_ExecuteUbergraph_WBP_PracticeMenuComboBox_Row;

// Function WBP_PracticeMenuComboBox_Row.WBP_PracticeMenuComboBox_Row_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct WBP_PracticeMenuComboBox_Row_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_PracticeMenuComboBox_Row_C_OnMouseLeave;

// Function WBP_PracticeMenuComboBox_Row.WBP_PracticeMenuComboBox_Row_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_PracticeMenuComboBox_Row_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WBP_PracticeMenuComboBox_Row_C_OnMouseEnter;

// Function WBP_PracticeMenuComboBox_Row.WBP_PracticeMenuComboBox_Row_C.Get_TextBlock_Option_Text_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_PracticeMenuComboBox_Row_C_Get_TextBlock_Option_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_WBP_PracticeMenuComboBox_Row_C_Get_TextBlock_Option_Text_0;

}

