#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InputDisplay

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Midair2_structs.hpp"


namespace SDK::Params
{

// Function WBP_InputDisplay.WBP_InputDisplay_C.Get_Jet_Text_ColorAndOpacity_0
// 0x0078 (0x0078 - 0x0000)
struct WBP_InputDisplay_C_Get_Jet_Text_ColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            NewLocalVar_0;                                     // 0x0028(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            CallFunc_GetSlateColorForInputType_ReturnValue;    // 0x0050(0x0028)()
};
DUMPER7_ASSERTS_WBP_InputDisplay_C_Get_Jet_Text_ColorAndOpacity_0;

// Function WBP_InputDisplay.WBP_InputDisplay_C.Get_W_Text_ColorAndOpacity_1
// 0x0050 (0x0050 - 0x0000)
struct WBP_InputDisplay_C_Get_W_Text_ColorAndOpacity_1 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_GetSlateColorForInputType_ReturnValue;    // 0x0028(0x0028)()
};
DUMPER7_ASSERTS_WBP_InputDisplay_C_Get_W_Text_ColorAndOpacity_1;

// Function WBP_InputDisplay.WBP_InputDisplay_C.GetMAPlayerController
// 0x0030 (0x0030 - 0x0000)
struct WBP_InputDisplay_C_GetMAPlayerController final
{
public:
	class AMAPlayerController*                    AsMAPlayer_Controller;                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerControllerID_ReturnValue;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMAPlayerController*                    K2Node_DynamicCast_AsMAPlayer_Controller;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_InputDisplay_C_GetMAPlayerController;

// Function WBP_InputDisplay.WBP_InputDisplay_C.GetSlateColorForInputType
// 0x0090 (0x0090 - 0x0000)
struct WBP_InputDisplay_C_GetSlateColorForInputType final
{
public:
	EPlayerRecordableInputTypes                   InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0058(0x0028)()
	class AMAPlayerController*                    CallFunc_GetMAPlayerController_AsMAPlayer_Controller; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsKeyReplayActive_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_InputDisplay_C_GetSlateColorForInputType;

// Function WBP_InputDisplay.WBP_InputDisplay_C.Get_A_Text_ColorAndOpacity_0
// 0x0050 (0x0050 - 0x0000)
struct WBP_InputDisplay_C_Get_A_Text_ColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_GetSlateColorForInputType_ReturnValue;    // 0x0028(0x0028)()
};
DUMPER7_ASSERTS_WBP_InputDisplay_C_Get_A_Text_ColorAndOpacity_0;

// Function WBP_InputDisplay.WBP_InputDisplay_C.Get_S_Text_ColorAndOpacity_0
// 0x0050 (0x0050 - 0x0000)
struct WBP_InputDisplay_C_Get_S_Text_ColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_GetSlateColorForInputType_ReturnValue;    // 0x0028(0x0028)()
};
DUMPER7_ASSERTS_WBP_InputDisplay_C_Get_S_Text_ColorAndOpacity_0;

// Function WBP_InputDisplay.WBP_InputDisplay_C.Get_D_Text_ColorAndOpacity_0
// 0x0050 (0x0050 - 0x0000)
struct WBP_InputDisplay_C_Get_D_Text_ColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_GetSlateColorForInputType_ReturnValue;    // 0x0028(0x0028)()
};
DUMPER7_ASSERTS_WBP_InputDisplay_C_Get_D_Text_ColorAndOpacity_0;

// Function WBP_InputDisplay.WBP_InputDisplay_C.Get_Skii_Text_ColorAndOpacity_0
// 0x0050 (0x0050 - 0x0000)
struct WBP_InputDisplay_C_Get_Skii_Text_ColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            CallFunc_GetSlateColorForInputType_ReturnValue;    // 0x0028(0x0028)()
};
DUMPER7_ASSERTS_WBP_InputDisplay_C_Get_Skii_Text_ColorAndOpacity_0;

}

