#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerExpressionEntry

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerExpressionEntry.WBP_PlayerExpressionEntry_C
// 0x0078 (0x02D8 - 0x0260)
class UWBP_PlayerExpressionEntry_C final : public UUserWidget
{
public:
	class UTextBlock*                             ChatTextBox;                                       // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KeyBox;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DisplayText;                                       // 0x0270(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   KeyText;                                           // 0x0288(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         ExpressionIndex;                                   // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsCategory;                                        // 0x02A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Category;                                          // 0x02A8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   ActualKeyText;                                     // 0x02C0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	class FText Get_KeyBox_Text_0();
	class FText Get_ChatTextBox_Text_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_PlayerExpressionEntry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_PlayerExpressionEntry_C")
	}
	static class UWBP_PlayerExpressionEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerExpressionEntry_C>();
	}
};
DUMPER7_ASSERTS_UWBP_PlayerExpressionEntry_C;

}

