#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreboardList_EoM_RB

#include "Basic.hpp"

#include "Midair2_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ScoreboardList_EoM_RB.WBP_ScoreboardList_EoM_RB_C
// 0x00E8 (0x0348 - 0x0260)
class UWBP_ScoreboardList_EoM_RB_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           PlayerList;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardSlot_EoM_RB_C*           WBP_ScoreboardSlot_EoM_RB;                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardSlot_EoM_RB_C*           WBP_ScoreboardSlot_EoM_RB_1;                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardSlot_EoM_RB_C*           WBP_ScoreboardSlot_EoM_RB_2;                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardSlot_EoM_RB_C*           WBP_ScoreboardSlot_EoM_RB_3;                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardSlot_EoM_RB_C*           WBP_ScoreboardSlot_EoM_RB_4;                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardSlot_EoM_RB_C*           WBP_ScoreboardSlot_EoM_RB_5;                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardSlot_EoM_RB_C*           WBP_ScoreboardSlot_EoM_RB_6;                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardSlot_EoM_RB_C*           WBP_ScoreboardSlot_EoM_RB_7;                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            Header_Icon;                                       // 0x02B0(0x0088)(Edit, BlueprintVisible)
	uint8                                         TeamId;                                            // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SlowTickTimer;                                     // 0x0340(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ScoreboardList_EoM_RB(int32 EntryPoint);
	void Destruct();
	void Construct();
	void Slow_Tick();
	void UpdateVBoxWithPlayers(TArray<class AMAPlayerState*>& players, int32 TeamId_0);
	class FText Get_Status_Text_0();
	class FText Get_Team_Score_0();
	class FText Get_Team_Name();
	struct FLinearColor Get_Team_Color();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ScoreboardList_EoM_RB_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ScoreboardList_EoM_RB_C")
	}
	static class UWBP_ScoreboardList_EoM_RB_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ScoreboardList_EoM_RB_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ScoreboardList_EoM_RB_C;

}

