#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabHome

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TabHome.WBP_TabHome_C
// 0x0050 (0x02B0 - 0x0260)
class UWBP_TabHome_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_TabHomeRow_C*                      WBP_TabHomeRow;                                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabHomeRow_C*                      WBP_TabHomeRow_0;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabHomeRow_C*                      WBP_TabHomeRow_1;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabHomeRow_C*                      WBP_TabHomeRow_2;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabHomeRow_C*                      WBP_TabHomeRow_3;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TabHomeRow_C*                      WBP_TabHomeRow_4;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_C*                           WBP_Title;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const class FString& TabName)> TabHomeRowClicked;                  // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_TabHome(int32 EntryPoint);
	void BndEvt__WBP_TabHome_WBP_TabHomeRow_K2Node_ComponentBoundEvent_5_ButtonClicked__DelegateSignature(class UWBP_TabHomeRow_C* OptionsBTN, const class FString& TabName);
	void BndEvt__WBP_TabHome_WBP_TabHomeRow_4_K2Node_ComponentBoundEvent_4_ButtonClicked__DelegateSignature(class UWBP_TabHomeRow_C* OptionsBTN, const class FString& TabName);
	void BndEvt__WBP_TabHome_WBP_TabHomeRow_3_K2Node_ComponentBoundEvent_3_ButtonClicked__DelegateSignature(class UWBP_TabHomeRow_C* OptionsBTN, const class FString& TabName);
	void BndEvt__WBP_TabHome_WBP_TabHomeRow_2_K2Node_ComponentBoundEvent_2_ButtonClicked__DelegateSignature(class UWBP_TabHomeRow_C* OptionsBTN, const class FString& TabName);
	void BndEvt__WBP_TabHome_WBP_TabHomeRow_1_K2Node_ComponentBoundEvent_1_ButtonClicked__DelegateSignature(class UWBP_TabHomeRow_C* OptionsBTN, const class FString& TabName);
	void BndEvt__WBP_TabHome_WBP_TabHomeRow_0_K2Node_ComponentBoundEvent_0_ButtonClicked__DelegateSignature(class UWBP_TabHomeRow_C* OptionsBTN, const class FString& TabName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TabHome_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TabHome_C")
	}
	static class UWBP_TabHome_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TabHome_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TabHome_C;

}

