#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerBrowserInfoRow

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ServerBrowserInfoRow.WBP_ServerBrowserInfoRow_C.ExecuteUbergraph_WBP_ServerBrowserInfoRow
// 0x0050 (0x0050 - 0x0000)
struct WBP_ServerBrowserInfoRow_C_ExecuteUbergraph_WBP_ServerBrowserInfoRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0038(0x0018)()
};
DUMPER7_ASSERTS_WBP_ServerBrowserInfoRow_C_ExecuteUbergraph_WBP_ServerBrowserInfoRow;

}

