#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabBot_Row

#include "Basic.hpp"

#include "Midair2_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TabBot_Row.WBP_TabBot_Row_C
// 0x01D8 (0x0438 - 0x0260)
class UWBP_TabBot_Row_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnimation;                                    // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             BotNameText;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Load;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Action_C*                   WBP_Button_Action_Delete;                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Action_C*                   WBP_Button_Action_Edit;                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMABotConfig                           Bot;                                               // 0x0290(0x0170)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void(const struct FMABotConfig& Bot)> Bot_Edit_Clicked;                 // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_TabBot_C*                          ParentWidget;                                      // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FMABotConfig& Bot)> Bot_Delete_Clicked;               // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const struct FMABotConfig& Bot)> Bot_Load_Clicked;                 // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_TabBot_Row(int32 EntryPoint);
	void BndEvt__WBP_TabRoute_Row_WBP_Button_Action_Delete_K2Node_ComponentBoundEvent_6_Action_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabRoute_Row_WBP_Button_Action_Edit_K2Node_ComponentBoundEvent_5_Action_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_TabRouteRow_Button_Load_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_TabRouteRow_Button_Load_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_TabRouteRow_Button_Load_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void SetBot(const struct FMABotConfig& Bot_0);
	void GetMAPracticeComponentForWidget(class UMAPracticeComponent** MAPracticeComponent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TabBot_Row_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TabBot_Row_C")
	}
	static class UWBP_TabBot_Row_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TabBot_Row_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TabBot_Row_C;

}

