#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Scoreboard_TR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Scoreboard_TR.WBP_Scoreboard_TR_C
// 0x0030 (0x0290 - 0x0260)
class UWBP_Scoreboard_TR_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ScoreboardList_C*                  WBP_ScoreboardList;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScoreboardList_C*                  WBP_ScoreboardList_0;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StatDisplay_Scoreboard_C*          CTFSTAT_AirReturns;                                // 0x0278(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_StatDisplay_Scoreboard_C*          CTFSTAT_CarrierMidairKills;                        // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_StatDisplay_Scoreboard_C*          CTFSTAT_CarrierMidairDeaths;                       // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Scoreboard_TR(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdatePlayerStatBox();
	void InitCustomPinnedStats();
	struct FSlateColor GetForegroundColor_0();
	struct FSlateColor GetForegroundColor_1();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Scoreboard_TR_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Scoreboard_TR_C")
	}
	static class UWBP_Scoreboard_TR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Scoreboard_TR_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Scoreboard_TR_C;

}

