#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabRoute_Details

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Midair2_structs.hpp"


namespace SDK::Params
{

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.ExecuteUbergraph_WBP_TabRoute_Details
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_TabRoute_Details_C_ExecuteUbergraph_WBP_TabRoute_Details final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_1; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_2; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_3; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_4; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_5; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_6; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_MarkerIndex;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_7; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERouteTrailDifficulty                         K2Node_ComponentBoundEvent_Difficulty_1;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_8; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_9; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_10; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERouteTrailDifficulty                         K2Node_ComponentBoundEvent_Difficulty;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_11; // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_RouteType;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_12; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_ExecuteUbergraph_WBP_TabRoute_Details;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.BndEvt__WBP_TabRoute_Details_WBP_RouteTypeSelector_K2Node_ComponentBoundEvent_12_RouteTypeSelected__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_TabRoute_Details_C_BndEvt__WBP_TabRoute_Details_WBP_RouteTypeSelector_K2Node_ComponentBoundEvent_12_RouteTypeSelected__DelegateSignature final
{
public:
	class FString                                 RouteType;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_BndEvt__WBP_TabRoute_Details_WBP_RouteTypeSelector_K2Node_ComponentBoundEvent_12_RouteTypeSelected__DelegateSignature;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.BndEvt__WBP_TabRoute_Details_WBP_DifficultySelector_Route_K2Node_ComponentBoundEvent_8_DifficultySelected__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabRoute_Details_C_BndEvt__WBP_TabRoute_Details_WBP_DifficultySelector_Route_K2Node_ComponentBoundEvent_8_DifficultySelected__DelegateSignature final
{
public:
	ERouteTrailDifficulty                         Difficulty;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_BndEvt__WBP_TabRoute_Details_WBP_DifficultySelector_Route_K2Node_ComponentBoundEvent_8_DifficultySelected__DelegateSignature;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.BndEvt__WBP_TabRoute_Details_WBP_DifficultySelector_K2Node_ComponentBoundEvent_1_DifficultySelected__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabRoute_Details_C_BndEvt__WBP_TabRoute_Details_WBP_DifficultySelector_K2Node_ComponentBoundEvent_1_DifficultySelected__DelegateSignature final
{
public:
	ERouteTrailDifficulty                         Difficulty;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_BndEvt__WBP_TabRoute_Details_WBP_DifficultySelector_K2Node_ComponentBoundEvent_1_DifficultySelected__DelegateSignature;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.BndEvt__WBP_TabRoute_Details_WBP_MarkerSelector_K2Node_ComponentBoundEvent_9_Marker_Index_Updated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_TabRoute_Details_C_BndEvt__WBP_TabRoute_Details_WBP_MarkerSelector_K2Node_ComponentBoundEvent_9_Marker_Index_Updated__DelegateSignature final
{
public:
	int32                                         MarkerIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_BndEvt__WBP_TabRoute_Details_WBP_MarkerSelector_K2Node_ComponentBoundEvent_9_Marker_Index_Updated__DelegateSignature;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.GetMAPracticeComponentForWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_TabRoute_Details_C_GetMAPracticeComponentForWidget final
{
public:
	class UMAPracticeComponent*                   MAPracticeComponent;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerControllerID_ReturnValue;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMAPlayerController*                    K2Node_DynamicCast_AsMAPlayer_Controller;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_GetMAPracticeComponentForWidget;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.Set Route Trail
// 0x0138 (0x0138 - 0x0000)
struct WBP_TabRoute_Details_C_Set_Route_Trail final
{
public:
	struct FMARouteTrail                          RouteTrail;                                        // 0x0000(0x0100)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0100(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0118(0x0018)()
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_Set_Route_Trail;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.SaveRoute
// 0x0058 (0x0058 - 0x0000)
struct WBP_TabRoute_Details_C_SaveRoute final
{
public:
	class UMAPracticeComponent*                   MAPracticeComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0020(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_SaveRoute;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.Get_TextBlock_PlayDisabled_Visibility_0
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabRoute_Details_C_Get_TextBlock_PlayDisabled_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_Get_TextBlock_PlayDisabled_Visibility_0;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.Get_WBP_Button_Play_bIsEnabled_0
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabRoute_Details_C_Get_WBP_Button_Play_bIsEnabled_0 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_Get_WBP_Button_Play_bIsEnabled_0;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.Get_SelectedRouteTrailGrabSpeed_Text_0
// 0x0048 (0x0048 - 0x0000)
struct WBP_TabRoute_Details_C_Get_SelectedRouteTrailGrabSpeed_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPracticeMenuText_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_Get_SelectedRouteTrailGrabSpeed_Text_0;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.Get_SelectedRouteTrailGrabTime_Text_0
// 0x0048 (0x0048 - 0x0000)
struct WBP_TabRoute_Details_C_Get_SelectedRouteTrailGrabTime_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPracticeMenuText_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_Get_SelectedRouteTrailGrabTime_Text_0;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.Get_SelectedRouteTrailCaptureTIme_Text_0
// 0x0048 (0x0048 - 0x0000)
struct WBP_TabRoute_Details_C_Get_SelectedRouteTrailCaptureTIme_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPracticeMenuText_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_Get_SelectedRouteTrailCaptureTIme_Text_0;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.Get_SelectedRouteTrailTotalTime_Text_0
// 0x0048 (0x0048 - 0x0000)
struct WBP_TabRoute_Details_C_Get_SelectedRouteTrailTotalTime_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPracticeMenuText_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_Get_SelectedRouteTrailTotalTime_Text_0;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.Get_SelectedRouteTrailCaptureSpeed_Text_0
// 0x0048 (0x0048 - 0x0000)
struct WBP_TabRoute_Details_C_Get_SelectedRouteTrailCaptureSpeed_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPracticeMenuText_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_Get_SelectedRouteTrailCaptureSpeed_Text_0;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.Get_SelectedRouteTrailMaxSpeed_Text_0
// 0x0048 (0x0048 - 0x0000)
struct WBP_TabRoute_Details_C_Get_SelectedRouteTrailMaxSpeed_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPracticeMenuText_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_Get_SelectedRouteTrailMaxSpeed_Text_0;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.Get_SelectedRouteTrailAverageSpeed_Text_0
// 0x0048 (0x0048 - 0x0000)
struct WBP_TabRoute_Details_C_Get_SelectedRouteTrailAverageSpeed_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPracticeMenuText_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_Get_SelectedRouteTrailAverageSpeed_Text_0;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.Get_HitMarkersText_Text_0
// 0x0048 (0x0048 - 0x0000)
struct WBP_TabRoute_Details_C_Get_HitMarkersText_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPracticeMenuText_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_Get_HitMarkersText_Text_0;

// Function WBP_TabRoute_Details.WBP_TabRoute_Details_C.Get_TotalMarkersText_Text_0
// 0x0048 (0x0048 - 0x0000)
struct WBP_TabRoute_Details_C_Get_TotalMarkersText_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPracticeMenuText_ReturnValue;          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
DUMPER7_ASSERTS_WBP_TabRoute_Details_C_Get_TotalMarkersText_Text_0;

}

