#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkinOptionBTN

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ESkinStatus_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ESelectionStatus_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SkinOptionBTN.WBP_SkinOptionBTN_C
// 0x0628 (0x0888 - 0x0260)
class UWBP_SkinOptionBTN_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 LockedStatus;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NewStatus;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                OptionBorder;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SkinBTN;                                           // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SkinNameText;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        StatusSwitcher;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                UnlockedStatus;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            DefaultBorderColor;                                // 0x02A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            BorderColor;                                       // 0x02C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           DefaultButtonStyle;                                // 0x02F0(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FButtonStyle                           EquippedButtonStyle;                               // 0x0568(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            RarityLockedColor;                                 // 0x07E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            RarityColor;                                       // 0x0808(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 SkinItem;                                          // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0838(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	ESkinStatus                                   SkinStatus;                                        // 0x0850(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_851[0x7];                                      // 0x0851(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UWBP_SkinOptionBTN_C* SelectedSkin)> OnOptionClicked;        // 0x0858(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	ESelectionStatus                              SelectionStatus;                                   // 0x0868(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_869[0x7];                                      // 0x0869(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Cosmetic;                                          // 0x0870(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 rarity;                                            // 0x0878(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_SkinOptionBTN(int32 EntryPoint);
	void BndEvt__SkinBTN_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);
	void SetDefaults();
	void SetRarityColor();
	void SetEquippedButtonStyle();
	void SetSkinStatusColors();
	void SetSelectionStatusColor();
	void SetBorderColor();
	void ChangeSelectionStatus(ESelectionStatus SelectionStatus_0);
	void ChangeSkinStatus(ESkinStatus SkinStatus_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SkinOptionBTN_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SkinOptionBTN_C")
	}
	static class UWBP_SkinOptionBTN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SkinOptionBTN_C>();
	}
};
DUMPER7_ASSERTS_UWBP_SkinOptionBTN_C;

}

