#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SkinOptionBTN

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ESkinStatus_structs.hpp"
#include "ESelectionStatus_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SkinOptionBTN.WBP_SkinOptionBTN_C.ExecuteUbergraph_WBP_SkinOptionBTN
// 0x0008 (0x0008 - 0x0000)
struct WBP_SkinOptionBTN_C_ExecuteUbergraph_WBP_SkinOptionBTN final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_SkinOptionBTN_C_ExecuteUbergraph_WBP_SkinOptionBTN;

// Function WBP_SkinOptionBTN.WBP_SkinOptionBTN_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SkinOptionBTN_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_SkinOptionBTN_C_PreConstruct;

// Function WBP_SkinOptionBTN.WBP_SkinOptionBTN_C.SetRarityColor
// 0x0140 (0x0140 - 0x0000)
struct WBP_SkinOptionBTN_C_SetRarityColor final
{
public:
	struct FSlateColor                            LegendaryLockedColor;                              // 0x0000(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            LegendaryColor;                                    // 0x0028(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            RareLockedColor;                                   // 0x0050(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            RareColor;                                         // 0x0078(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            EpicLockedColor;                                   // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            EpicColor;                                         // 0x00C8(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            CommonLockedColor;                                 // 0x00F0(0x0028)(Edit, BlueprintVisible)
	struct FSlateColor                            CommonColor;                                       // 0x0118(0x0028)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_WBP_SkinOptionBTN_C_SetRarityColor;

// Function WBP_SkinOptionBTN.WBP_SkinOptionBTN_C.SetEquippedButtonStyle
// 0x0300 (0x0300 - 0x0000)
struct WBP_SkinOptionBTN_C_SetEquippedButtonStyle final
{
public:
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0000(0x0088)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0088(0x0278)()
};
DUMPER7_ASSERTS_WBP_SkinOptionBTN_C_SetEquippedButtonStyle;

// Function WBP_SkinOptionBTN.WBP_SkinOptionBTN_C.SetSkinStatusColors
// 0x0030 (0x0030 - 0x0000)
struct WBP_SkinOptionBTN_C_SetSkinStatusColors final
{
public:
	struct FSlateColor                            EquippedColor;                                     // 0x0000(0x0028)(Edit, BlueprintVisible)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_SkinOptionBTN_C_SetSkinStatusColors;

// Function WBP_SkinOptionBTN.WBP_SkinOptionBTN_C.SetSelectionStatusColor
// 0x0084 (0x0084 - 0x0000)
struct WBP_SkinOptionBTN_C_SetSelectionStatusColor final
{
public:
	struct FLinearColor                           CommonLockedColor;                                 // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CommonColor;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EpicLockedColor;                                   // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EpicColor;                                         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RareLockedColor;                                   // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           RareColor;                                         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LegendaryLockedColor;                              // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LegendaryColor;                                    // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_SkinOptionBTN_C_SetSelectionStatusColor;

// Function WBP_SkinOptionBTN.WBP_SkinOptionBTN_C.SetBorderColor
// 0x0088 (0x0088 - 0x0000)
struct WBP_SkinOptionBTN_C_SetBorderColor final
{
public:
	struct FSlateBrush                            NewLocalVar_0;                                     // 0x0000(0x0088)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_WBP_SkinOptionBTN_C_SetBorderColor;

// Function WBP_SkinOptionBTN.WBP_SkinOptionBTN_C.ChangeSelectionStatus
// 0x0001 (0x0001 - 0x0000)
struct WBP_SkinOptionBTN_C_ChangeSelectionStatus final
{
public:
	ESelectionStatus                              SelectionStatus_0;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SkinOptionBTN_C_ChangeSelectionStatus;

// Function WBP_SkinOptionBTN.WBP_SkinOptionBTN_C.ChangeSkinStatus
// 0x0001 (0x0001 - 0x0000)
struct WBP_SkinOptionBTN_C_ChangeSkinStatus final
{
public:
	ESkinStatus                                   SkinStatus_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SkinOptionBTN_C_ChangeSkinStatus;

}

