#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_CheckboxItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_CheckboxItem.WBP_Settings_CheckboxItem_C
// 0x0030 (0x0290 - 0x0260)
class UWBP_Settings_CheckboxItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCheckBox*                              CheckBox_123;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_61;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 SettingName;                                       // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	ECheckBoxState                                SettingValue;                                      // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Settings_CheckboxItem(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__CheckBox_123_K2Node_ComponentBoundEvent_134_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	class FText GetText_0();
	void SetValueFromBool(bool InChecked);
	void GetIsChecked(bool* IsChecked);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_Settings_CheckboxItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_Settings_CheckboxItem_C")
	}
	static class UWBP_Settings_CheckboxItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_CheckboxItem_C>();
	}
};
DUMPER7_ASSERTS_UWBP_Settings_CheckboxItem_C;

}

