#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RouteTrailRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Midair2_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RouteTrailRow.WBP_RouteTrailRow_C
// 0x0238 (0x0498 - 0x0260)
class UWBP_RouteTrailRow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                DeleteRouteTrailButton;                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                LoadRouteTrailButton;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RouteNameText;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMARouteTrail                          RouteTrail;                                        // 0x0280(0x0100)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void()>              NewEventDispatcher_0;                              // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FMARouteTrail                          NewVar_0;                                          // 0x0390(0x0100)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_PracticeModeMenu_C*                ParentWidget;                                      // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_RouteTrailRow(int32 EntryPoint);
	void BndEvt__DeleteRouteTrailButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__LoadRouteTrailButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void SetRouteTrail(const struct FMARouteTrail& RouteTrail_0);
	void GetMAPracticeComponentForWidget(class UMAPracticeComponent** MAPracticeComponent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_RouteTrailRow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_RouteTrailRow_C")
	}
	static class UWBP_RouteTrailRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RouteTrailRow_C>();
	}
};
DUMPER7_ASSERTS_UWBP_RouteTrailRow_C;

}

