#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FriendsOverlay_Button

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Midair2_structs.hpp"


namespace SDK::Params
{

// Function WBP_FriendsOverlay_Button.WBP_FriendsOverlay_Button_C.GetVisibility_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_FriendsOverlay_Button_C_GetVisibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAVoiceChatSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerTalking_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_FriendsOverlay_Button_C_GetVisibility_0;

// Function WBP_FriendsOverlay_Button.WBP_FriendsOverlay_Button_C.SetPartyMember
// 0x0090 (0x0090 - 0x0000)
struct WBP_FriendsOverlay_Button_C_SetPartyMember final
{
public:
	struct FPartyMemberView                       NewPartyMember;                                    // 0x0000(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0078(0x0018)()
};
DUMPER7_ASSERTS_WBP_FriendsOverlay_Button_C_SetPartyMember;

// Function WBP_FriendsOverlay_Button.WBP_FriendsOverlay_Button_C.AfterPush_870434F645E00D36876D0A98469AF8F8
// 0x0008 (0x0008 - 0x0000)
struct WBP_FriendsOverlay_Button_C_AfterPush_870434F645E00D36876D0A98469AF8F8 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_FriendsOverlay_Button_C_AfterPush_870434F645E00D36876D0A98469AF8F8;

// Function WBP_FriendsOverlay_Button.WBP_FriendsOverlay_Button_C.BeforePush_870434F645E00D36876D0A98469AF8F8
// 0x0008 (0x0008 - 0x0000)
struct WBP_FriendsOverlay_Button_C_BeforePush_870434F645E00D36876D0A98469AF8F8 final
{
public:
	class UCommonActivatableWidget*               UserWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_FriendsOverlay_Button_C_BeforePush_870434F645E00D36876D0A98469AF8F8;

// Function WBP_FriendsOverlay_Button.WBP_FriendsOverlay_Button_C.ExecuteUbergraph_WBP_FriendsOverlay_Button
// 0x0058 (0x0058 - 0x0000)
struct WBP_FriendsOverlay_Button_C_ExecuteUbergraph_WBP_FriendsOverlay_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAsyncAction_PushContentToLayerForPlayer* CallFunc_PushContentToLayerForPlayer_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget_1;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonActivatableWidget*               K2Node_CustomEvent_UserWidget;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCommonActivatableWidget* UserWidget)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonActivatableWidget*               Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_FriendsOverlay_Button_C_ExecuteUbergraph_WBP_FriendsOverlay_Button;

}

