#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabRoute_Row

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Midair2_structs.hpp"


namespace SDK::Params
{

// Function WBP_TabRoute_Row.WBP_TabRoute_Row_C.ExecuteUbergraph_WBP_TabRoute_Row
// 0x0020 (0x0020 - 0x0000)
struct WBP_TabRoute_Row_C_ExecuteUbergraph_WBP_TabRoute_Row final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_Row_C_ExecuteUbergraph_WBP_TabRoute_Row;

// Function WBP_TabRoute_Row.WBP_TabRoute_Row_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WBP_TabRoute_Row_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabRoute_Row_C_OnListItemObjectSet;

// Function WBP_TabRoute_Row.WBP_TabRoute_Row_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabRoute_Row_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TabRoute_Row_C_BP_OnItemSelectionChanged;

// Function WBP_TabRoute_Row.WBP_TabRoute_Row_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabRoute_Row_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TabRoute_Row_C_BP_OnItemExpansionChanged;

// Function WBP_TabRoute_Row.WBP_TabRoute_Row_C.SetRouteTrail
// 0x0200 (0x0200 - 0x0000)
struct WBP_TabRoute_Row_C_SetRouteTrail final
{
public:
	struct FMARouteTrail                          RouteTrail_0;                                      // 0x0000(0x0100)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FMARouteTrail                          NewLocalVar_0;                                     // 0x0100(0x0100)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_WBP_TabRoute_Row_C_SetRouteTrail;

// Function WBP_TabRoute_Row.WBP_TabRoute_Row_C.GetMAPracticeComponentForWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_TabRoute_Row_C_GetMAPracticeComponentForWidget final
{
public:
	class UMAPracticeComponent*                   MAPracticeComponent;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerControllerID_ReturnValue;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMAPlayerController*                    K2Node_DynamicCast_AsMAPlayer_Controller;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TabRoute_Row_C_GetMAPracticeComponentForWidget;

// Function WBP_TabRoute_Row.WBP_TabRoute_Row_C.Get_Image_RouteType_Brush_0
// 0x0558 (0x0558 - 0x0000)
struct WBP_TabRoute_Row_C_Get_Image_RouteType_Brush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0088(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0110(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x0198(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_3;                    // 0x0220(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_4;                    // 0x02A8(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_5;                    // 0x0330(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_6;                    // 0x03B8(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_7;                    // 0x0440(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_8;                    // 0x04C8(0x0088)()
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TabRoute_Row_C_Get_Image_RouteType_Brush_0;

}

