#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScoreFeed

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ScoreFeed.WBP_ScoreFeed_C.ExecuteUbergraph_WBP_ScoreFeed
// 0x0040 (0x0040 - 0x0000)
struct WBP_ScoreFeed_C_ExecuteUbergraph_WBP_ScoreFeed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Score_Name;                     // 0x0008(0x0018)()
	float                                         K2Node_CustomEvent_Score_Value;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ScoreFeedItem_C*                   CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ScoreFeed_C_ExecuteUbergraph_WBP_ScoreFeed;

// Function WBP_ScoreFeed.WBP_ScoreFeed_C.Add Score Event
// 0x0020 (0x0020 - 0x0000)
struct WBP_ScoreFeed_C_Add_Score_Event final
{
public:
	class FText                                   Score_Name;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         Score_Value;                                       // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_ScoreFeed_C_Add_Score_Event;

}

