#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConsoleSettings_SliderItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Midair2_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ConsoleSettings_SliderItem.WBP_ConsoleSettings_SliderItem_C
// 0x0068 (0x02C8 - 0x0260)
class UWBP_ConsoleSettings_SliderItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ConsoleSettingsListEntry_C*        WBP_ConsoleSettingsListEntry;                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 SettingName;                                       // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(float NewValue)> ValueAdjusted;                                    // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(float NewValue)> ValueApplied;                                     // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             Slider_Sound;                                      // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasExistedForSomeTime;                            // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           Options;                                           // 0x02B0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         SelectedOptionIndex;                               // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ConsoleSettings_SliderItem(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__WBP_ConsoleSettings_SliderItem_Button_73_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	class FText GetText_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ConsoleSettings_SliderItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ConsoleSettings_SliderItem_C")
	}
	static class UWBP_ConsoleSettings_SliderItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ConsoleSettings_SliderItem_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ConsoleSettings_SliderItem_C;

}

