#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DropdownMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DropdownMenu.WBP_DropdownMenu_C
// 0x00C8 (0x0328 - 0x0260)
class UWBP_DropdownMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                DropdownBG;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DropdownBorder;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        DropdownMenu;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            SelectedTextColor;                                 // 0x0280(0x0028)(Edit, BlueprintVisible)
	struct FLinearColor                           BackgroundColor;                                   // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BorderAndArrowColor;                               // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            DropdownOptions;                                   // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_DropdownOptions_C*>         OptionsWidgets;                                    // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class FString>                         Options;                                           // 0x02E0(0x0010)(Edit, BlueprintVisible)
	class FString                                 SelectedOption;                                    // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const class FString& SelectedItem)> OnSelectionChange;             // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 DefaultOption;                                     // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          HasBorder;                                         // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HasBackground;                                     // 0x0321(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_DropdownMenu(int32 EntryPoint);
	void BndEvt__DropdownMenu_K2Node_ComponentBoundEvent_4_OnSelectionChangedEvent__DelegateSignature(const class FString& SelectedItem, ESelectInfo SelectionType);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	struct FSlateColor GetColorAndOpacity_0();
	struct FLinearColor GetBorderAndArrowColor();
	class UWidget* OnGenerateWidget_0(const class FString& Item);
	void SetSelectedOptionColor(const class FString& SelectedOption_0);
	void CreateOptionsList(const class FString& EquippedOption);
	void SetSelectedOption(const class FString& OptionToSet);
	struct FLinearColor Get_DropdownBackground_BrushColor_0();
	void SetBorderAndArrowColor();
	void SetBackgroundColor();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_DropdownMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_DropdownMenu_C")
	}
	static class UWBP_DropdownMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DropdownMenu_C>();
	}
};
DUMPER7_ASSERTS_UWBP_DropdownMenu_C;

}

