#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SingleStat

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SingleStat.WBP_SingleStat_C.ExecuteUbergraph_WBP_SingleStat
// 0x0020 (0x0020 - 0x0000)
struct WBP_SingleStat_C_ExecuteUbergraph_WBP_SingleStat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0008(0x0018)()
};
DUMPER7_ASSERTS_WBP_SingleStat_C_ExecuteUbergraph_WBP_SingleStat;

// Function WBP_SingleStat.WBP_SingleStat_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SingleStat_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_SingleStat_C_PreConstruct;

// Function WBP_SingleStat.WBP_SingleStat_C.SetTextSize
// 0x0108 (0x0108 - 0x0000)
struct WBP_SingleStat_C_SetTextSize final
{
public:
	struct FSlateFontInfo                         DefaultFont;                                       // 0x0000(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0058(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x00B0(0x0058)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_SingleStat_C_SetTextSize;

}

