#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LoadoutsPanel_New

#include "Basic.hpp"

#include "Midair2_structs.hpp"


namespace SDK::Params
{

// Function WBP_LoadoutsPanel_New.WBP_LoadoutsPanel_New_C.ExecuteUbergraph_WBP_LoadoutsPanel_New
// 0x0218 (0x0218 - 0x0000)
struct WBP_LoadoutsPanel_New_C_ExecuteUbergraph_WBP_LoadoutsPanel_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMALoadout                             K2Node_ComponentBoundEvent_LoadoutToEdit;          // 0x0010(0x00C0)()
	class FString                                 K2Node_ComponentBoundEvent_SkinItemTitle;          // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      K2Node_ComponentBoundEvent_MenuBTN;                // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ComponentBoundEvent_ItemObject;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_LoadoutIndex;           // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TRFlagGoal_C*                       K2Node_ComponentBoundEvent_LevelFlagGoal;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SprayWall_C*                        K2Node_ComponentBoundEvent_LevelSprayWall;         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerLoadoutsSave*                    CallFunc_GetGlobalLoadoutsSave_ReturnValue;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         CallFunc_GetItemsBySteamDefinedType_ReturnValue;   // 0x0110(0x0010)(ReferenceParm)
	TArray<class UClass*>                         CallFunc_GetItemsBySteamDefinedType_ReturnValue_1; // 0x0120(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_1;        // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         CallFunc_GetItemsBySteamDefinedType_ReturnValue_2; // 0x0138(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_2;        // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AMainMenu_CharacterPreview_C*>   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0150(0x0010)(ReferenceParm)
	TArray<class UClass*>                         CallFunc_GetItemsBySteamDefinedType_ReturnValue_3; // 0x0160(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         CallFunc_GetItemsBySteamDefinedType_ReturnValue_4; // 0x0178(0x0010)(ReferenceParm)
	TArray<class UClass*>                         CallFunc_GetItemsBySteamDefinedType_ReturnValue_5; // 0x0188(0x0010)(ReferenceParm)
	TArray<class UClass*>                         CallFunc_GetItemsBySteamDefinedType_ReturnValue_6; // 0x0198(0x0010)(ReferenceParm)
	class UObjectInfo*                            CallFunc_GetObjectInfoFromClass_ReturnValue;       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponInfo*                            K2Node_DynamicCast_AsWeapon_Info;                  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         CallFunc_GetItemsBySteamDefinedType_ReturnValue_7; // 0x01C0(0x0010)(ReferenceParm)
	TArray<class UClass*>                         CallFunc_GetItemsBySteamDefinedType_ReturnValue_8; // 0x01D0(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_3;        // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         CallFunc_GetItemsBySteamDefinedType_ReturnValue_9; // 0x01E8(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMainMenu_CharacterPreview_C*           K2Node_DynamicCast_AsMain_Menu_Character_Preview;  // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_LoadoutsPanel_New_C_ExecuteUbergraph_WBP_LoadoutsPanel_New;

// Function WBP_LoadoutsPanel_New.WBP_LoadoutsPanel_New_C.BndEvt__WBP_EditLoadout_K2Node_ComponentBoundEvent_2_EditSkin__DelegateSignature
// 0x0038 (0x0038 - 0x0000)
struct WBP_LoadoutsPanel_New_C_BndEvt__WBP_EditLoadout_K2Node_ComponentBoundEvent_2_EditSkin__DelegateSignature final
{
public:
	class FString                                 SkinItemTitle_0;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      MenuBTN;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ItemObject;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoadoutIndex;                                      // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TRFlagGoal_C*                       LevelFlagGoal;                                     // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SprayWall_C*                        LevelSprayWall;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_LoadoutsPanel_New_C_BndEvt__WBP_EditLoadout_K2Node_ComponentBoundEvent_2_EditSkin__DelegateSignature;

// Function WBP_LoadoutsPanel_New.WBP_LoadoutsPanel_New_C.BndEvt__WBP_ViewLoadouts_K2Node_ComponentBoundEvent_0_EditLoadoutClicked__DelegateSignature
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_LoadoutsPanel_New_C_BndEvt__WBP_ViewLoadouts_K2Node_ComponentBoundEvent_0_EditLoadoutClicked__DelegateSignature final
{
public:
	struct FMALoadout                             LoadoutToEdit;                                     // 0x0000(0x00C0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WBP_LoadoutsPanel_New_C_BndEvt__WBP_ViewLoadouts_K2Node_ComponentBoundEvent_0_EditLoadoutClicked__DelegateSignature;

// Function WBP_LoadoutsPanel_New.WBP_LoadoutsPanel_New_C.CreateOptions
// 0x0170 (0x0170 - 0x0000)
struct WBP_LoadoutsPanel_New_C_CreateOptions final
{
public:
	class UWBP_MenuButton_C*                      MenuBTN;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Title;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Type;                                              // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerLoadoutsSave*                    CallFunc_GetGlobalLoadoutsSave_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMALoadout                             CallFunc_GetLastSelectedLoadout_outLoadout;        // 0x0040(0x00C0)()
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsCosmetic_Configuration;  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_SkinOptionBTN_C*                   K2Node_DynamicCast_AsWBP_Skin_Option_BTN;          // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_LoadoutsPanel_New_C_CreateOptions;

}

