#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameStatus_Arena2

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_GameStatus_Arena2.WBP_GameStatus_Arena2_C.Get Team B Status Text
// 0x0060 (0x0060 - 0x0000)
struct WBP_GameStatus_Arena2_C_Get_Team_B_Status_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class AMAGameState*                           CallFunc_GetMAGameState_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLivesLeftOnTeam_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
};
DUMPER7_ASSERTS_WBP_GameStatus_Arena2_C_Get_Team_B_Status_Text;

// Function WBP_GameStatus_Arena2.WBP_GameStatus_Arena2_C.Get Team A Status Text
// 0x0060 (0x0060 - 0x0000)
struct WBP_GameStatus_Arena2_C_Get_Team_A_Status_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class AMAGameState*                           CallFunc_GetMAGameState_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLivesLeftOnTeam_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
};
DUMPER7_ASSERTS_WBP_GameStatus_Arena2_C_Get_Team_A_Status_Text;

// Function WBP_GameStatus_Arena2.WBP_GameStatus_Arena2_C.Get_ATeamScoreText_Text_0
// 0x0040 (0x0040 - 0x0000)
struct WBP_GameStatus_Arena2_C_Get_ATeamScoreText_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class AMAGameState*                           CallFunc_GetMAGameState_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMATeamState*                           CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
};
DUMPER7_ASSERTS_WBP_GameStatus_Arena2_C_Get_ATeamScoreText_Text_0;

// Function WBP_GameStatus_Arena2.WBP_GameStatus_Arena2_C.Get_BTeamScoreText_Text_0
// 0x0040 (0x0040 - 0x0000)
struct WBP_GameStatus_Arena2_C_Get_BTeamScoreText_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class AMAGameState*                           CallFunc_GetMAGameState_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMATeamState*                           CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
};
DUMPER7_ASSERTS_WBP_GameStatus_Arena2_C_Get_BTeamScoreText_Text_0;

// Function WBP_GameStatus_Arena2.WBP_GameStatus_Arena2_C.Get_TimeLeftText_Text_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_GameStatus_Arena2_C_Get_TimeLeftText_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Time_Remaining_Text_Text;             // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_WBP_GameStatus_Arena2_C_Get_TimeLeftText_Text_0;

// Function WBP_GameStatus_Arena2.WBP_GameStatus_Arena2_C.Get_ATeamScoreBar_Percent_0
// 0x0008 (0x0008 - 0x0000)
struct WBP_GameStatus_Arena2_C_Get_ATeamScoreBar_Percent_0 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Team_A_Score_Pct_Pct;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_GameStatus_Arena2_C_Get_ATeamScoreBar_Percent_0;

// Function WBP_GameStatus_Arena2.WBP_GameStatus_Arena2_C.Get_BTeamScoreBar_Percent_0
// 0x0008 (0x0008 - 0x0000)
struct WBP_GameStatus_Arena2_C_Get_BTeamScoreBar_Percent_0 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Get_Team_A_Score_Pct_Pct;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_GameStatus_Arena2_C_Get_BTeamScoreBar_Percent_0;

// Function WBP_GameStatus_Arena2.WBP_GameStatus_Arena2_C.Get Team Status Text
// 0x0098 (0x0098 - 0x0000)
struct WBP_GameStatus_Arena2_C_Get_Team_Status_Text final
{
public:
	uint8                                         TeamId_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(Parm, OutParm)
	class AMAGameState*                           CallFunc_GetMAGameState_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetLivePlayersOnTeam_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
};
DUMPER7_ASSERTS_WBP_GameStatus_Arena2_C_Get_Team_Status_Text;

// Function WBP_GameStatus_Arena2.WBP_GameStatus_Arena2_C.Get_PlayerIsTeamA_Visibility_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_GameStatus_Arena2_C_Get_PlayerIsTeamA_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Get_Visibility_for_Team_ID_Out_Visibility; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_GameStatus_Arena2_C_Get_PlayerIsTeamA_Visibility_0;

// Function WBP_GameStatus_Arena2.WBP_GameStatus_Arena2_C.Get_PlayerIsTeamB_Visibility_0
// 0x0002 (0x0002 - 0x0000)
struct WBP_GameStatus_Arena2_C_Get_PlayerIsTeamB_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_Get_Visibility_for_Team_ID_Out_Visibility; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_GameStatus_Arena2_C_Get_PlayerIsTeamB_Visibility_0;

// Function WBP_GameStatus_Arena2.WBP_GameStatus_Arena2_C.Get_TeamAStatus_Visibility_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_GameStatus_Arena2_C_Get_TeamAStatus_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMAGameState*                           CallFunc_GetMAGameState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLivesLeftOnTeam_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_GameStatus_Arena2_C_Get_TeamAStatus_Visibility_0;

// Function WBP_GameStatus_Arena2.WBP_GameStatus_Arena2_C.Get_TeamBStatus_Visibility_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_GameStatus_Arena2_C_Get_TeamBStatus_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMAGameState*                           CallFunc_GetMAGameState_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLivesLeftOnTeam_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_GameStatus_Arena2_C_Get_TeamBStatus_Visibility_0;

// Function WBP_GameStatus_Arena2.WBP_GameStatus_Arena2_C.Get_TimeLeftText_2_Text_0
// 0x0088 (0x0088 - 0x0000)
struct WBP_GameStatus_Arena2_C_Get_TimeLeftText_2_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class AMAGameState*                           CallFunc_GetMAGameState_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ByteToString_ReturnValue_1;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
};
DUMPER7_ASSERTS_WBP_GameStatus_Arena2_C_Get_TimeLeftText_2_Text_0;

}

