#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WidgetCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Midair2_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_WidgetCustomization.WBP_WidgetCustomization_C
// 0x01D8 (0x0518 - 0x0340)
class UWBP_WidgetCustomization_C final : public UMAEscapableWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Exit;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PracticeModeButton_C*              ResetButton;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpinBox*                               SpinBox_Opacity;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpinBox*                               SpinBox_PX;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpinBox*                               SpinBox_PY;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpinBox*                               SpinBox_SX;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpinBox*                               SpinBox_SY;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_WidgetName;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_WidgetList;                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Action_C*                   WBP_Button_Reset;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           WidgetContainer;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWidget*>                        MovableWidgets;                                    // 0x03A0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	TMap<class FString, class UWidget*>           EditWidgets;                                       // 0x03B0(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	TMap<class FString, float>                    HUDMoverConfig;                                    // 0x0400(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UWidget*                                EditedWidget;                                      // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EditedPx;                                          // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EditedPy;                                          // 0x045C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EditedSx;                                          // 0x0460(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EditedSy;                                          // 0x0464(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EditedOpacity;                                     // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EditedWidgetName;                                  // 0x0470(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const class FString& WidgetName)> SetSelectedWidget;               // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FString>                         DefaultVisibleEditWidgets;                         // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, class FString>            WidgetDictionnary;                                 // 0x04A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnCloseClicked;                                    // 0x04F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         ScaleRatioX;                                       // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleRatioY;                                       // 0x0504(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         FilteredWidgets;                                   // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_WidgetCustomization(int32 EntryPoint);
	void BP_OnDeactivated();
	void BndEvt__WBP_WidgetCustomization_SpinBox_Opacity_K2Node_ComponentBoundEvent_15_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__WBP_WidgetCustomization_SpinBox_SY_K2Node_ComponentBoundEvent_13_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__WBP_WidgetCustomization_SpinBox_SX_K2Node_ComponentBoundEvent_11_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__WBP_WidgetCustomization_SpinBox_PY_K2Node_ComponentBoundEvent_9_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__WBP_WidgetCustomization_SpinBox_PX_K2Node_ComponentBoundEvent_8_OnSpinBoxValueChangedEvent__DelegateSignature(float InValue);
	void BndEvt__WBP_WidgetCustomization_WBP_PracticeModeButton_Save_PubStarter_K2Node_ComponentBoundEvent_7_Button_Clicked__DelegateSignature();
	void BndEvt__WBP_WidgetCustomization_Button_Exit_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_WidgetCustomization_WBP_Button_Visibility_K2Node_ComponentBoundEvent_0_Action_Button_Clicked__DelegateSignature();
	void InitWidgetCustomization(TArray<class UWidget*>& MovableWidgets_0, const TMap<class FString, float>& HUDMoverConfig_0);
	void OnWidgetDragMove(const struct FVector2D& DragOffset, const class FString& WidgetName);
	void OnWidgetDragDrop(const struct FVector2D& DragOffset, const class FString& WidgetName);
	void GetHudMoverConfigValues(const class FString& WidgetName, const TMap<class FString, float>& HUDMoverConfig_0, struct FVector2D* position, struct FVector2D* Scale, float* Opacity);
	void OnWidgetClick(const class FString& WidgetName);
	void GetWidgetDisplayName(const class FString& WidgetName, class FString* DisplayName);
	void OnWidgetVisibilityChanged(const class FString& WidgetName, bool Visible);
	void UpdateCvar(const class FString& WidgetName, const class FString& Prop, float Value);
	void InitScales();
	void ResetDefaults();
	void FindParentCanvas(class UWidget* Widget, const struct FVector2D& AccumulatePosition, class UCanvasPanelSlot** CanvasSlot, struct FVector2D* position);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_WidgetCustomization_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_WidgetCustomization_C")
	}
	static class UWBP_WidgetCustomization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_WidgetCustomization_C>();
	}
};
DUMPER7_ASSERTS_UWBP_WidgetCustomization_C;

}

