#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_EditLoadout

#include "Basic.hpp"

#include "Midair2_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_EditLoadout.WBP_EditLoadout_C
// 0x0240 (0x04A0 - 0x0260)
class UWBP_EditLoadout_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_MenuButton_C*                      ArmorSkinOptions;                                  // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                BTN_BackToLoadouts;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               EditLoadoutMenu;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        EditLoadoutSwitcher;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      GoalEffectOptions;                                 // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DropdownMenu_C*                    GrenadeOptionsDropdown;                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                InputBorder;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                InputBorder_1;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                InputBorder_2;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                InputBorder_3;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                InputBorder_4;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      JetTrailOptions;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          LoadoutNameTXT;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DropdownMenu_C*                    PackOptionsDropdown;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      SprayOptions;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      VoicePackOptions;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DropdownMenu_C*                    Weapon01_Option;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      Weapon01_Skin_Options;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DropdownMenu_C*                    Weapon02_Option;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      Weapon02_Skin_Options;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DropdownMenu_C*                    Weapon03_Option;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuButton_C*                      Weapon03_Skin_Options;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         WeaponOptions;                                     // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         GrenadeOptions;                                    // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         PackOptions;                                       // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         EquippedWeapons;                                   // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 EquippedPack;                                      // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 EquippedGrenade;                                   // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              BackToLoadouts;                                    // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         LoadoutIndex;                                      // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMALoadout                             LoadoutToEdit;                                     // 0x0390(0x00C0)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void(const class FString& SkinItemTitle, class UWBP_MenuButton_C* MenuBTN, class UClass* ItemObject, int32 LoadoutIndex, class ABP_TRFlagGoal_C* LevelFlagGoal, class ABP_SprayWall_C* LevelSprayWall)> EditSkin; // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 Weapon1Class;                                      // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Weapon3Class;                                      // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Weapon2Class;                                      // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   LoadoutName;                                       // 0x0478(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_TRFlagGoal_C*                       LevelFlagGoal;                                     // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SprayWall_C*                        LevelSprayWall;                                    // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_EditLoadout(int32 EntryPoint);
	void BndEvt__GoalEffectOptions_K2Node_ComponentBoundEvent_7_OnOptionClicked__DelegateSignature();
	void BndEvt__JetTrailOptions_K2Node_ComponentBoundEvent_3_OnOptionClicked__DelegateSignature();
	void BndEvt__PackOptionsDropdown_K2Node_ComponentBoundEvent_14_OnSelectionChange__DelegateSignature(const class FString& SelectedItem);
	void BndEvt__GrenadeOptionsDropdown_K2Node_ComponentBoundEvent_13_OnSelectionChange__DelegateSignature(const class FString& SelectedItem);
	void BndEvt__LoadoutName_K2Node_ComponentBoundEvent_12_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__BTN_BackToLoadouts_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Weapon03_Option_K2Node_ComponentBoundEvent_10_OnSelectionChange__DelegateSignature(const class FString& SelectedItem);
	void BndEvt__Weapon02_Option_K2Node_ComponentBoundEvent_9_OnSelectionChange__DelegateSignature(const class FString& SelectedItem);
	void BndEvt__Weapon01_Option_K2Node_ComponentBoundEvent_8_OnSelectionChange__DelegateSignature(const class FString& SelectedItem);
	void BndEvt__CharacterSkinOptions_K2Node_ComponentBoundEvent_6_OnOptionClicked__DelegateSignature();
	void BndEvt__SprayOptions_K2Node_ComponentBoundEvent_5_OnOptionClicked__DelegateSignature();
	void BndEvt__VoicePackOptions_K2Node_ComponentBoundEvent_4_OnOptionClicked__DelegateSignature();
	void BndEvt__Weapon03_Skin_Options_K2Node_ComponentBoundEvent_2_OnOptionClicked__DelegateSignature();
	void BndEvt__Weapon02_Skin_Options_K2Node_ComponentBoundEvent_1_OnOptionClicked__DelegateSignature();
	void BndEvt__Weapon01_Skin_Options_K2Node_ComponentBoundEvent_0_OnOptionClicked__DelegateSignature();
	void Construct();
	void SetSkinOptions();
	void SetDropdownOptions();
	void GetDropdownOptions();
	void GetEquippedWeapons();
	void GetEquippedThrowable();
	void GetEquippedPack();
	void SetLoadoutToEdit(const struct FMALoadout& LoadoutToEdit_0);
	void UpdateLoadoutInformation();
	void GetLoadoutName();
	void UpdateLoadoutWeapon(const class FString& WeaponName, int32 WeaponIndex, class UClass** WeaponClassRef);
	void SetLoadoutName(const class FText& NewName);
	void SetLoadoutWeapon(int32 Index_0, class UClass* WeaponToSet);
	void SetLoadoutGrenade(const class FString& GrenadeToSet);
	void SetLoadoutPack(const class FString& PackToSet);
	class FText Get_LoadoutNameTXT_Text_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_EditLoadout_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_EditLoadout_C")
	}
	static class UWBP_EditLoadout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_EditLoadout_C>();
	}
};
DUMPER7_ASSERTS_UWBP_EditLoadout_C;

}

