#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InGameMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Midair2_structs.hpp"
#include "Midair2_classes.hpp"
#include "Engine_structs.hpp"
#include "CommonGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InGameMenu.WBP_InGameMenu_C
// 0x0210 (0x0538 - 0x0328)
class UWBP_InGameMenu_C final : public UMAInGameMenuScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           AdminOptions;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         ChangeMapButton;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_Options_BTN_C*                 ChangeTeamButton;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         CopyCustomCode;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_Options_BTN_C*                 EditHudLayoutButton;                               // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         ExitToMainMenuButton_1;                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_235;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               LoadoutBox;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         LoadoutButton;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             OptionsBox;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_Options_BTN_C*                 PlayerListButton;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         PracticeButton;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         PracticeModeButton;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         QuitButton;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         ReturnToGameButton;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         ServerBrowserBtn;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         SettingsButton;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_28;                                         // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_Options_BTN_C*                 SpectateButton;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         TournamentModeButton;                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_Options_BTN_C*                 VoteAdminButton;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_Options_BTN_C*                 VoteChangeMapButton;                               // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_BottomActionBar_C*                   W_BottomActionBar;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN_1;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN_2;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN_3;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN_4;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN_5;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN_6;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN_7;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN_8;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN_9;                                     // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN_10;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN_11;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN_12;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN_13;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_BTN_C*                         WBP_ESC_BTN_14;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ESC_Loadouts_C*                    WBP_ESC_Loadouts;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AMAGameState*                           Cached_Game_State;                                 // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TournamentModeEnabled;                             // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PracticeModeEnabled;                               // 0x0489(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_48A[0x6];                                      // 0x048A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         PlayerNames;                                       // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ESlateVisibility                              OptionsMenuVisibility;                             // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MidairCombobox_C*                  MidmatchVoteComboBox;                              // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlayerList_C*                      PlayerList;                                        // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ToggleInGameMenu;                                  // 0x04B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_PracticeModeMenu_C*                PracticeMenu;                                      // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_SettingsMenu_C*                    SettingsMenu;                                      // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    MenusArray;                                        // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_ValidationPopup_C*                 ValidationPopup;                                   // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Game_Mode_Options;                                 // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 SelectedGameMode;                                  // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UWBP_LoadoutsPanel_New_C*               LoadoutMenu;                                       // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ConsoleSettingsMenu_C*             Console_Settings_Menu;                             // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Settings_Menu_C*                   UpdatingSettings;                                  // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WidgetCustomizationLoaded;                         // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMAPlayerController*                    CachedPlayerController;                            // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_InGameMenu(int32 EntryPoint);
	void BP_OnActivated();
	void CustomEvent(int32 Selection, const class FString& DisplayString);
	void BndEvt__DisableTournamentModeButton_K2Node_ComponentBoundEvent_0_ButtonClicked__DelegateSignature(class UWBP_SelectableButton_C* Clicked_Button);
	void BndEvt__WBP_InGameMenu_ExitToMainMenuButton_1_K2Node_ComponentBoundEvent_4_ButtonClicked__DelegateSignature();
	void ExitGame();
	void Construct();
	void MidmatchVoteSelectionMade(int32 Selection, const class FString& DisplayString);
	void CustomEvent_1(ESlateVisibility InVisibility);
	void BndEvt__WBP_InGameMenu_CopyCustomCode_K2Node_ComponentBoundEvent_18_ButtonClicked__DelegateSignature();
	void BndEvt__WBP_InGameMenu_EditHudLayoutButton_K2Node_ComponentBoundEvent_11_ButtonClicked__DelegateSignature(class UWBP_ESC_Options_BTN_C* OptionsBTN, int32 OptionIndex);
	void BndEvt__QuitButton_K2Node_ComponentBoundEvent_2_ButtonClicked__DelegateSignature();
	void BndEvt__ReturnToGameButton_K2Node_ComponentBoundEvent_6_ButtonClicked__DelegateSignature();
	void BndEvt__ExitToMainMenuButton_K2Node_ComponentBoundEvent_8_ButtonClicked__DelegateSignature();
	void BndEvt__SettingsButton_K2Node_ComponentBoundEvent_11_ButtonClicked__DelegateSignature();
	void BndEvt__TournamentModeButton_K2Node_ComponentBoundEvent_13_ButtonClicked__DelegateSignature();
	void BndEvt__LoadoutButton_K2Node_ComponentBoundEvent_20_ButtonClicked__DelegateSignature();
	void BndEvt__PracticeModeButton_K2Node_ComponentBoundEvent_15_ButtonClicked__DelegateSignature();
	void BndEvt__VoteAdminButton_K2Node_ComponentBoundEvent_7_ButtonClicked__DelegateSignature();
	void BndEvt__VoteChangeMapButton_K2Node_ComponentBoundEvent_9_ButtonClicked__DelegateSignature();
	void BndEvt__PlayerListButton_K2Node_ComponentBoundEvent_10_ButtonClicked__DelegateSignature();
	void BndEvt__ChangeTeamButton_K2Node_ComponentBoundEvent_12_ButtonClicked__DelegateSignature();
	void ModeToVoteSelected(class UWBP_ESC_Options_BTN_C* ClickedBTN, int32 OptionIndex);
	void BndEvt__SpectateButton_K2Node_ComponentBoundEvent_14_ButtonClicked__DelegateSignature();
	void BndEvt__PracticeButton_K2Node_ComponentBoundEvent_1_ButtonClicked__DelegateSignature();
	void CloseOpenMenus();
	void MapToVoteSelected(class UWBP_ESC_Options_BTN_C* ClickedBTN, int32 OptionIndex);
	void MapOptionSelected(class UWBP_ESC_Options_BTN_C* Clicked_BTN, int32 Option_Index);
	void BndEvt__ChangeMapButton_K2Node_ComponentBoundEvent_9_ButtonClicked__DelegateSignature();
	void AdminToVoteSelected(class UWBP_ESC_Options_BTN_C* ClickedBTN, int32 OptionIndex, const class FString& steamID);
	void OnResult_7E280664437AE1EC74875EA3567FF7B1(ECommonMessagingResult Result);
	void OnResult_B74893FF49FB71702952999EBCCCB7AF(ECommonMessagingResult Result);
	void BeforePush_9DC5165C4C64DEAEE6E40E88EE7FBC87(class UCommonActivatableWidget* UserWidget);
	void AfterPush_9DC5165C4C64DEAEE6E40E88EE7FBC87(class UCommonActivatableWidget* UserWidget);
	void BeforePush_ECD022C44C86B5BD4696E3ADEC76D428(class UCommonActivatableWidget* UserWidget);
	void AfterPush_ECD022C44C86B5BD4696E3ADEC76D428(class UCommonActivatableWidget* UserWidget);
	void BeforePush_DA7371D74232DF95390273928B41B780(class UCommonActivatableWidget* UserWidget);
	void AfterPush_DA7371D74232DF95390273928B41B780(class UCommonActivatableWidget* UserWidget);
	void BeforePush_E01FB01B41C8145FABF413B69E9BB740(class UCommonActivatableWidget* UserWidget);
	void AfterPush_E01FB01B41C8145FABF413B69E9BB740(class UCommonActivatableWidget* UserWidget);
	void BeforePush_5F1BC48147D7E30DC2969AB40F4F54F7(class UCommonActivatableWidget* UserWidget);
	void AfterPush_5F1BC48147D7E30DC2969AB40F4F54F7(class UCommonActivatableWidget* UserWidget);
	void BeforePush_612D81BD42314739136CCB8616AEB34F(class UCommonActivatableWidget* UserWidget);
	void AfterPush_612D81BD42314739136CCB8616AEB34F(class UCommonActivatableWidget* UserWidget);
	void OnSuccess_6EB7E0E648188A45ACA9D6A90A607952(const struct FMAHathoraServer& HathoraServer);
	void OnFail_6EB7E0E648188A45ACA9D6A90A607952(const struct FMAHathoraServer& HathoraServer);
	void OnSuccess_76DFB1F946EF8ECEF37B1783382377F3(const struct FMAHathoraServer& HathoraServer);
	void OnFail_76DFB1F946EF8ECEF37B1783382377F3(const struct FMAHathoraServer& HathoraServer);
	void AddHangToast(const class FText& Message1);
	class UWidget* OnGetMenuContent();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ToggleMode(bool CurrentStatus, class UWBP_ESC_BTN_C* BTN_Ref, class AMAPlayerController** MAPlayerControllerRef, bool* ReturnStatus);
	void ToggleOnOffTXT(class UWBP_ESC_BTN_C* BNT_Ref, bool OnStatus);
	void SetOnOffTXT(bool OnStatus, class UWBP_ESC_BTN_C* BTN_Ref);
	void SetModeStatus();
	void AdminCheck(bool* isAdmin_);
	void CloseMenus(class UUserWidget* Menus);
	void PopulateOptions(TArray<class FString>& OptionsList, const class FString& VoteType);
	ESlateVisibility Get_OptionsBox_Visibility_0();
	void SetPlayerNames();
	void HideOptionsMenu();
	void ClearAllPopups();
	void PopulateOptionsMap(TArray<class FString>& OptionsList);
	void GetMapsForGameMode(const class FString& GameMode, TArray<class FString>& MapRotation, TArray<class FString>* maps);
	ESlateVisibility IsInCustomGameVisibility();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void GetPlayerNames(TArray<class FString>* PlayerNames_0);
	void Populate_Options_Admin();
	ESlateVisibility GetIsMatchmadeGame();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_InGameMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_InGameMenu_C")
	}
	static class UWBP_InGameMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InGameMenu_C>();
	}
};
DUMPER7_ASSERTS_UWBP_InGameMenu_C;

}

