#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabDrill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Midair2_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TabDrill.WBP_TabDrill_C
// 0x0050 (0x02B0 - 0x0260)
class UWBP_TabDrill_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VerticalBox_Drills;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Action_C*                   WBP_Button_Action;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_C*                           WBP_Title;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FMADrill& Drill)> Edit_Drill;                         // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Add_Drill;                                         // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Go_Back;                                           // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_TabDrill(int32 EntryPoint);
	void BndEvt__WBP_TabRoute_WBP_Title_K2Node_ComponentBoundEvent_0_Title_Clicked__DelegateSignature();
	void BndEvt__WBP_TabRoute_WBP_Button_Action_K2Node_ComponentBoundEvent_1_Action_Button_Clicked__DelegateSignature();
	void Construct();
	void UpdateDrillList(class UMAPracticeComponent* PracticeComponent, class APlayerController* OwningPlayer);
	void GetMAPracticeComponentForWidget(class UMAPracticeComponent** MAPracticeComponent);
	void EditDrill(const struct FMADrill& Drill);
	void DeleteDrill(const struct FMADrill& Drill);
	void LoadDrill(const struct FMADrill& Drill);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TabDrill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TabDrill_C")
	}
	static class UWBP_TabDrill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TabDrill_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TabDrill_C;

}

