#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabRoute

#include "Basic.hpp"

#include "Midair2_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TabRoute.WBP_TabRoute_C
// 0x0078 (0x02D8 - 0x0260)
class UWBP_TabRoute_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           VerticalBox_Routes;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Button_Action_C*                   WBP_Button_Action;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DifficultySelector_C*              WBP_DifficultySelector;                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RouteTypeSelector_C*               WBP_RouteTypeSelector;                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Title_C*                           WBP_Title;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FMARouteTrail& Route)> Edit_Route;                    // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Add_Route;                                         // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              Go_Back;                                           // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FString                                 RouteTypeFilter;                                   // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	ERouteTrailDifficulty                         DifficultyFilter;                                  // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TabRoute(int32 EntryPoint);
	void BndEvt__WBP_TabRoute_WBP_DifficultySelector_K2Node_ComponentBoundEvent_3_DifficultySelected__DelegateSignature(ERouteTrailDifficulty Difficulty);
	void BndEvt__WBP_TabRoute_WBP_RouteTypeSelector_K2Node_ComponentBoundEvent_2_RouteTypeSelected__DelegateSignature(const class FString& RouteType);
	void BndEvt__WBP_TabRoute_WBP_Title_K2Node_ComponentBoundEvent_0_Title_Clicked__DelegateSignature();
	void BndEvt__WBP_TabRoute_WBP_Button_Action_K2Node_ComponentBoundEvent_1_Action_Button_Clicked__DelegateSignature();
	void Construct();
	void Update_Route_List();
	void GetMAPracticeComponentForWidget(class UMAPracticeComponent** MAPracticeComponent);
	void EditRouteTrail(const struct FMARouteTrail& Route);
	void DeleteRouteTrail(const struct FMARouteTrail& Route);
	void LoadRouteTrail(const struct FMARouteTrail& Route);
	void SpawnBotOnRoute(const struct FMARouteTrail& Route);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TabRoute_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TabRoute_C")
	}
	static class UWBP_TabRoute_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TabRoute_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TabRoute_C;

}

