#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NewsCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Midair2_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NewsCard.WBP_NewsCard_C
// 0x00A8 (0x0308 - 0x0260)
class UWBP_NewsCard_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Thumb;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Body;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Date;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title_1;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MAMenuButton_C*                      W_MAMenuButton;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMABroadcast                           CurrentBroadcast;                                  // 0x0290(0x0078)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetData(const struct FMABroadcast& Broadcast);
	void OnFail_17C2B5A4458E363800481AB415052F41(class UTexture2DDynamic* Texture);
	void OnSuccess_17C2B5A4458E363800481AB415052F41(class UTexture2DDynamic* Texture);
	void Construct();
	void LoadImage(const class FString& URL);
	void BndEvt__WBP_NewsCard_W_MAMenuButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void ExecuteUbergraph_WBP_NewsCard(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_NewsCard_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_NewsCard_C")
	}
	static class UWBP_NewsCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NewsCard_C>();
	}
};
DUMPER7_ASSERTS_UWBP_NewsCard_C;

}

