#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TabLocation_Details

#include "Basic.hpp"

#include "Midair2_structs.hpp"


namespace SDK::Params
{

// Function WBP_TabLocation_Details.WBP_TabLocation_Details_C.ExecuteUbergraph_WBP_TabLocation_Details
// 0x0048 (0x0048 - 0x0000)
struct WBP_TabLocation_Details_C_ExecuteUbergraph_WBP_TabLocation_Details final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_1; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_2;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked_1;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_2; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_3; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_4; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_5; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent_6; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabLocation_Details_C_ExecuteUbergraph_WBP_TabLocation_Details;

// Function WBP_TabLocation_Details.WBP_TabLocation_Details_C.BndEvt__WBP_TabLocation_Details_RestoreAmmoCheckbox_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabLocation_Details_C_BndEvt__WBP_TabLocation_Details_RestoreAmmoCheckbox_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TabLocation_Details_C_BndEvt__WBP_TabLocation_Details_RestoreAmmoCheckbox_K2Node_ComponentBoundEvent_4_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_TabLocation_Details.WBP_TabLocation_Details_C.BndEvt__WBP_TabLocation_Details_RestoreEnergyCheckbox_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabLocation_Details_C_BndEvt__WBP_TabLocation_Details_RestoreEnergyCheckbox_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TabLocation_Details_C_BndEvt__WBP_TabLocation_Details_RestoreEnergyCheckbox_K2Node_ComponentBoundEvent_3_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_TabLocation_Details.WBP_TabLocation_Details_C.BndEvt__WBP_TabLocation_Details_RestoreHealthCheckbox_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_TabLocation_Details_C_BndEvt__WBP_TabLocation_Details_RestoreHealthCheckbox_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TabLocation_Details_C_BndEvt__WBP_TabLocation_Details_RestoreHealthCheckbox_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature;

// Function WBP_TabLocation_Details.WBP_TabLocation_Details_C.GetMAPracticeComponentForWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_TabLocation_Details_C_GetMAPracticeComponentForWidget final
{
public:
	class UMAPracticeComponent*                   MAPracticeComponent;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPlayerControllerID_ReturnValue;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMAPlayerController*                    K2Node_DynamicCast_AsMAPlayer_Controller;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_TabLocation_Details_C_GetMAPracticeComponentForWidget;

// Function WBP_TabLocation_Details.WBP_TabLocation_Details_C.SetLocation
// 0x0090 (0x0090 - 0x0000)
struct WBP_TabLocation_Details_C_SetLocation final
{
public:
	struct FMANamedLocation                       Location;                                          // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0070(0x0018)()
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabLocation_Details_C_SetLocation;

// Function WBP_TabLocation_Details.WBP_TabLocation_Details_C.SaveLocation
// 0x0058 (0x0058 - 0x0000)
struct WBP_TabLocation_Details_C_SaveLocation final
{
public:
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0000(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0018(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMAPracticeComponent*                   CallFunc_GetMAPracticeComponentForWidget_MAPracticeComponent; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_TabLocation_Details_C_SaveLocation;

}

