#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WPB_Minimap_PlayerIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WPB_Minimap_PlayerIcon.WPB_Minimap_PlayerIcon_C
// 0x0020 (0x0280 - 0x0260)
class UWPB_Minimap_PlayerIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 PlayerIcon;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          isBigMapPOI;                                       // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MapController_C*                   WBP_Map_Controller;                                // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WPB_Minimap_PlayerIcon(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WPB_Minimap_PlayerIcon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WPB_Minimap_PlayerIcon_C")
	}
	static class UWPB_Minimap_PlayerIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWPB_Minimap_PlayerIcon_C>();
	}
};
DUMPER7_ASSERTS_UWPB_Minimap_PlayerIcon_C;

}

