#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WSkin_Mortar_Default

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WSkin_DefaultSetup_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WSkin_Mortar_Default.WSkin_Mortar_Default_C
// 0x0030 (0x0328 - 0x02F8)
class AWSkin_Mortar_Default_C : public AWSkin_DefaultSetup_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WSkin_Mortar_Default_C;             // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPointLightComponent*                   PointLight3;                                       // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight2;                                       // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DirectionalLight;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WSkin_Mortar_Default(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WSkin_Mortar_Default_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WSkin_Mortar_Default_C")
	}
	static class AWSkin_Mortar_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWSkin_Mortar_Default_C>();
	}
};
DUMPER7_ASSERTS_AWSkin_Mortar_Default_C;

}

